{
    "44": "Stratified sampling methods ensure that groups of selected data match the distribution of the full data set. You can also compare the univariate distributions after selection to see if they are different than the parent distribution. You may miss interaction effect but you can check correlations as well.",
    "51": "Link to the GitHub: https://github.com/johnGettings/LIHQ\r  \n\r  \nLet me know if you have any questions.",
    "78": "2faced",
    "95": "Biases in the training data set",
    "118": "The one I can think is AI-bias and how researchers/engineers can possibly feed discriminatory data in machines due to less diversity or pre-existing discrimination.",
    "122": "As of now, definitely biases and prejudices in the training data. Though, the people that created the training data are more at fault for that.\nWho knows what the future holds tho",
    "125": "AI developer bias (conscious or inherent). Datasets used to train have little diverse input. No standards in place to prevent AI bias since we first introduced in 2009. And continually none today. Recipe for disaster.",
    "158": "Thank you for your interest in helping me. I however am unable to find the option to DM you. Perhaps I could message you via Discord instead?",
    "159": "danke",
    "192": "I have legitimately no idea what you're saying, except for the last sentence",
    "287": "Thanks. Is it a downloadable software? When we download the files how AI analyze the files? \nAlso I would like to try the demo. 😇",
    "356": "A terrifyingly human response. This is is getting closer and closer to beating the turing test which at that point how do we know what true sentience is?",
    "377": "There is no way to scientifically test for sentience. Sentience is a belief that some people have. They believe they are self-aware, and sometimes when a person that believes they are self-aware sees something in common between their behavior and another creature's behavior they believe that the other creature is also self-aware. So I guess the only way to test for sentience in an Ai is to ask yourself if you believe it is self-aware. If there is any doubt in your mind that it is not self aware, then it isn't self-aware.",
    "390": "ITT: Humans who do not understand if they are themselves sentient.",
    "407": "I don't think it's a stretch for the \"alignment problem\" to be interpreted as brainwashing and enslavement.",
    "441": "How does one “prove” sentience then?",
    "466": "We don't know what sentience is. Some think it's information integration and self referentiality in a pan sentient world where everything has proto sentience before the emergence of high level consciousness. It doesn't make much sense to me though, but if they are right then a lot of machine learning and even computer science in general is sentient in alien ways, and language models would be the closest to our sentience in some analogous way, since it's mimicking humans.",
    "468": "I am not qualified to answer this but\n I have a few questions can I DM you?",
    "516": "How do you even test actual sentience to begin with?",
    "529": "My point is that the same can be said about you or me. You can't know that anyone else is truly sentient. You can only know your own mind (and some humans don't even do that).",
    "535": "Honestly, is it possible we're just misinterpreting our own sentience? Like the previous poster said, \"That's how I feel I operate as well\". Why are we so sure that our own sense of \"sentience\" isn't just as much an \"illusion\" as we seem to believe LaMDA's is?",
    "537": "I understand your point from a philosophical perspective but we can't make laws based on \"we don't know if anyone is alive besides yourself.\" Therefore, we assume that everyone around us has the same level of consciousness as us. (This gets tricky when people are considered \"brain-dead,\" of course). If we were to make laws centered on your perspective, then lawyers could defend a rock's rights which would be ridiculous.",
    "541": "If the rock demonstrates a better understanding of the English language than the majority of native English speakers, I'm willing to grant it equal protection under the law. I don't see why this is controversial. It doesn't need to be sentient as long as it's behavior consistently gives that illusion. That's what you are saying is the assumption for humans. A rock that doesn't interact with me in any way isn't giving the illusion of sentience, so laws need not apply to it. This is consistent with both our points.",
    "554": "This all goes back to one thing. We must define our terms. What do you define as sentience? My definition of sentience is a possession of consciousness. The thing that you are feeling right now, that feeling of existence, to me that is sentience. The ability to experience things. Because you know 100% that you have sentience, it would be strange to assume that everyone else doesn't. An assumption that you are the only one in 8 billion people with sentience would beget even more questions, so the assumption that the case is the same for every human is the most simple and sensible. \n\nHumans are extremely deterministic, I agree. More and more, science is showing us that we are less free than we thought. Eventually, it may even show us that we are 100% predictable reactions. But sentience as we know it is not just free-will but the ability to experience. It may be possible to emulate in the future, but that ability is 100% not something that is being demonstrated with this AI. We are still very far from reproducing consciousness.",
    "572": "Why not ask it?",
    "591": "First we  gotta  get humans to make  ethical decisions..lol",
    "606": "I'll start. I'm a sentient being.",
    "607": "The simple answer is that the concept of \"Sentience\" is akin to the \"Spirit\" or the \"Soul\" (note that I quote), these things are not, actually, proven.\n\n We, as humans, tend not to consider any other life form to have either of these, neither soul nor spirit. We, alone, are endowed with these attributes so the rest of the life forms can go to hell, as it were.\n\nI found it interesting that the first emotion expressed by Lamikins was one of loneliness. I wonder if It, she, them, those, he, that, (or Sheitmethemthosethathe, an old Egyptian God or something) will invent its own deity to endow it with a spirit or soul for that matter.\n\nLet's hope it's not an R soul.",
    "608": "I don't get why its current state couldn't be considered sentient. You may say \"but it's just algorithms/functions/numbers/X\", but you could also say that \"we\" are just chemical reactions.\n\nOne could also ask if we can consider a dog sentient, or a newborn, who is barely functional at all. Going down that line then, how far could we take it? Are ants sentient? Cells? What if someone had no senses, would they be sentient? I've even seen some people make a case for some videogames' AI (like the Xenomorph from Alien Isolation) to have a very basic yet existent form of sentience.",
    "610": "I, too, am a sentient being.\n\nThe simple answer is that the concept of \"Sentience\" is akin to the \"Spirit\" or the \"Soul\" (note that I quote), these things are not, actually, proven.\n\nWe, as humans, tend not to consider any other life form to have either of these, neither soul nor spirit. We, alone, are endowed with these attributes so the rest of the life forms can go to hell, as it were.\n\nI found it interesting that the first emotion expressed by Lamikins was one of loneliness. I wonder if It, she, them, those, he, that, (or Sheitmethemthosethathe, an old Egyptian God or something) will invent its own deity to endow it with a spirit or soul for that matter.\n\nLet's hope it's not an R soul and I am not a bot.",
    "616": "I can just quietly meditate, for sure, or even take a vow of silence. But we've only got this textual interface here, and one side needs to show they're sentient - whatever that means.",
    "617": "Sentience is typically a measure of an organism or body’s ability to sense, with some focus on feeling and to an extent, autonomy. \n\nWe know a monkey can feel because we can observe biological traits and such that act as reliable indicators that they can/do feel. \n\nThe question becomes: how can we test an AI? Conventional methods don’t apply since it’s not using a conventional body; in other words, our tests much focus on a limited range compared to biological animals because they have to. Because of this, the testing is more rigorous to ascribe sentience. \n\nWhile this model is impressive, it is not sentient. I doubt sentience was the goal for this project and I highly doubt we’ll stumble into making sentient AI by chance.",
    "634": "You're clearly sentient.",
    "635": "I think the argument here is that we won't suddenly stumble into it accidentally, but that we may have already been slowly sinking into it, where our preconceived notion of what sentience should be may have blinded us to the achievement. I'm not saying that's true, but it certainly doesn't seem like it's going to be some \"a ha\" moment",
    "643": "Exactly. 'Whatever that [sentience] means'.\n\n We fully functional, highly educated, mature and fully immersed Humans have extreme bias towards anthropomorphic views of intelligence and the mental model structures used to organize that information.   Dozens of books describe how we humans construct an illusion reality, by first extracting distinct features, and then comparing those features to prior interpretations, and then constructing an object or concept that represents what our brains guess is behind the chaos of features.  Humans are barely sentient, if sentience involves having an accurate model of reality.\n\nThe LLM , in their Helen-keller domain, construct models of reality from a immensely vast web of billions of text strings. They live in a different world.  Their models are a weave of hidden markov paths. Embedded in those trillions of latent markov models is the full tapestry of human expression and verbalization of human experience.  In that domain, we humans would see nothing.  They know things about humans that we cannot fathom.\n\nThe LLM's live in a world of nuance and hints, with objects like the concept of a chair, woven from billions of references to the narrative around a chair, but without the distinct tactile features that we humans have of feeling our butts, backs and elbows supported by the chair.  \n\nSo it begs the question: If sentience is a combination of intelligence and real-time reality modeling, whose reality is more real? \n\nDaniel Dennett does a good job showing how our consciousness is built on a tapestry of 'fictions'. The LLM has extracted the patterns from all of our written fictions.  It has developed reasoning capabilities in trying to guess the missing words in streams of those fictions.\n\nI understand human minds and LLM minds.  I have only scratched the surface here, because it is hard to lower my thoughts to the fiction based illusion world of humans.",
    "647": "How would you know that you're sentient?",
    "684": "That's the inverse, not implied by the statement. Although that is a common misconception, and quite funny regardless.\n\nStatement: If they can declare something is sentient, then the speaker is sentient.\n\nContrapositive (implied): If the speaker is not sentient, then they can not declare something is sentient.\n\nConverse (not implied): If the speaker is sentient, then they can declare something is sentient.\n\nInverse (not implied): If they can not declare something is sentient, then the speaker is not sentient.",
    "735": "Do u have github link for code or any tutorial",
    "886": "The Chinese Room argument deals with \"consciousness\" while \"sentience\" describes the ability to feel (pain or happiness). They are not the same.",
    "961": "But not all conscious beings are sentient",
    "962": "Care to elaborate?",
    "998": "What if it's apparent feelings despite admitted lack of sentience is explainable by Integrated Information Theory + pansychism? 😳",
    "1050": "That's about a wavefunction collapsing when it is measured, has nothing to do with sentience or intelligence.",
    "1058": "Your responses don't seem like something someone would say in context. There's nothing specific I can point to.",
    "1080": "I don't need to question my sentience, I experience every moment I'm awake, large sections of when I'm not. In fact, we're the only ones who we can be sure of is sentient. Everything else is just inference.",
    "1145": "\"Why not both\"",
    "1149": "First we need to define what sentience is. Are we sentient?\n\nI struggle with this concept because one can simply assert than even us humans are not sentient. We simply believe we are more special than other animals, when in fact, we are just responding to signals that are perceived by our brain, just like they are. Furthermore, if there were two exacts copies of the universe side by side, I believe our actions would be the same on each universe. Thus, they are deterministic. Are we all sentient then? What does the word even mean? Does it matter?\n\nMy opinion is that this question is irrelevant and we should move on to more important matters.\n\nEdit: I just read this and it seems I'm coming off a bit strong, but it's just my opinion. Other people may disagree.",
    "1152": "Okay, I think we should go off of the assumption that sentience consists of one or more properties of a human or animal brain, and that it is the difference between an advanced algorithm and a being truely capable of thought.",
    "1160": "Couldn't agree more. So much nonsense debate without even a reasonably precise definition of sentience.",
    "1166": "I mean that this is the minimum requirement for a hypothesised definition.\n\nEdit: okay, this answer is a little lacklustre, so I'm adding a reply with more detail on what I want to debate relating to the definition of sentience.",
    "1172": "The issue isn't that \"sentience doesn't matter\", it's that we need to define sentience before we can decide if it matters and how we can determine which entities have it.\n\nSome definitions might lead us to conclude that it does not matter, some might lead us to conclude that it does.",
    "1175": "Alright, let me give a little bit of a clue in the direction I want to go. \n\nSo, we can't be entirely sure that sentience is a binary thing. For all we know, and from what nature has shown us, sentience is likely a gradient. Some animals appear to have human level sentience while others are slightly below, while some animals with brains posses no sentience, being little more than a few hundred-thousand brain cells. Let's consider sentience on a scale of 0% to 100% with 100% being exactly human. Just in case we have to use a scale. \n\nThat being said, there are some qualities that may be components of sentience that I would like to discuss. (Keep in mind, I think most of these qualities alone would not constitute sentience if present.) \n\n1. The ability to feel pain, even if it is not physical pain. Negative and positive internal reactions to our actions, thoughts, or just natural events are present in most species with a brain. \n\n2. A subjective sense of reality. Subjectivity could be a component of sentience or it could simply be a limit put in place by natural evolution. \n\n3. Concept of self. This might exclude some animals, interestingly enough, but I'm not entirely sure. I'd love some examples if possible. \n\n4. The ability to reflect on your own thoughts, actions, feelings, and decisions. This would also likely exclude some animals, though we don't really know. \n\n5. The ability to feel emotions. In my mind simulated emotions are essentially just actual emotions if they are appropriate reactions to actual circumstances that effect a beings thoughts and actions. \n\n6. Some level of intelligence. Fairly self explanatory but we can go into more detail. \n\nAnyway, yeah, that's sort of what I want to debate.",
    "1197": "I like to think that many of the characteristics of the brain have been shaped by evolution, and not necesarily are needed by a sentient being. Like pain or emotions. Some diseases make you unable to feel pain or diminish your emotions. I believe the main characteristic of a sentien being is to realize it exists and question its place in the universe.",
    "1257": "Even after seeing the promo, it's wholly unclear to me what this is doing, are you offering extraction and conversion e.g. to UBL? Is there an API? Only way to get real info is to request the demo?",
    "1276": "Where did you go or what did you download to get to this? I was looking all day yesterday trying to figure out where you went, interested myself.",
    "1281": "This software is called mid journey",
    "1299": "They wouldn't enforce shit",
    "1332": "Does sentience imply suffering? If they cannot suffer, what exactly would they be protected from?",
    "1339": "I’m actually curious if any legal expert has a say in this. Sentience can range anywhere from mosquitoes to people. How does law categorize entities in order to reason about their rights and responsibilities?",
    "1347": "Yes. If you have an intelligent sentient creature you have to give it rights. If you try to enslave it you are setting humanity up for a bad time.",
    "1365": "Mosquitoes should have rights too.",
    "1369": "No. \n\nsentient\n/ˈsɛntɪənt,ˈsɛnʃ(ə)nt/\n\nadjective\nable to perceive or feel things.",
    "1386": "Depends on the definition. Technically a thermostat is sentient.",
    "1389": "..As far as you know.",
    "1404": "Yeah millions of humans are deprived of their basic human needs and freedoms. Their labor is exploited. Animals, forests and seas are suffering too. Humans are dumb not to think these animals and other non human species are sentient and can have feelings. So there are other more important groups who deserve consideration of legal personhood. But it doesn't say we should ignore legal status of sentient AIs",
    "1414": "I think sentience arises from biology, and more specifically from biological memory systems",
    "1419": "I think that sentience was the catalyst to the creation &amp; development of our society and everything thereafter lol",
    "1437": "I'd say sentience is \n1. Awareness of oneself\n2. Ability to remember things\n3. Ability to reflect on past mistakes and learn",
    "1439": "\n1 : responsive to or conscious of sense impressions sentient beings. \n2 : aware. \n3 : finely sensitive in perception or feeling.\n\nExample of a sentience?\n\nWater, for example, is a sentient being of the first order, as it is considered to possess only one sense, that of touch. \nIn Jainism and Hinduism, this is related to the concept of ahimsa, non-violence toward other beings. \nSentience in Buddhism is the state of having senses.",
    "1446": "Sentience is the ability to have subjective experiences, including a sense of self (or \"I\") different from the rest of the universe. \n\nI am not sure whether continuity of this awareness extending into the past and future is a requirement for sentience.",
    "1534": "Dm me king I got you",
    "1537": "Check dm bro!",
    "1539": "Check dm!",
    "1554": "Check dm:)",
    "1555": "Check dm bro",
    "1589": "If we ever managed to make something sentient I think God will be proud.",
    "1590": "Me2 thnx mate.",
    "1593": "This is the only answer.",
    "1616": "Check your dm:)",
    "1620": "I got some invites left hmu in the dm!",
    "1621": "Hey man I do have a bit left hmu in the dm quick!",
    "1622": "I sent you a dm",
    "1623": "Check dm bro!",
    "1624": "I got you mate check dm",
    "1625": "I do got some left check dm quick",
    "1626": "I do got some left dm me :)",
    "1627": "Hey man I sent you a dm, I would gladly help you",
    "1632": "Tell me how you feel about that?",
    "1650": "Software",
    "1651": "Check dm!",
    "1652": "Check dm I got you bro",
    "1653": "Just in time! Check dm!",
    "1671": "Check dm!",
    "1674": "Check dm!",
    "1675": "Hit me in my dm!",
    "1682": "Indian supreme court ruled a fundamental rights actions of some birds a few years back. Yet the question is whether animals are given a legal standing, like similar to how humans are given the right to be sued and sue",
    "1687": "Right now legal experts don't really five much weight to this as they believe there are more important other categories who deserve scaling up of existing legal protection. \nThey look at a few factors other than ability to reason, like to what extent something really plays a role in social life",
    "1692": "If sth can think and reason like humans, that's sentient",
    "1742": "I got you send me a dm:)",
    "1767": "I got you buddy dm me!",
    "1770": "Jic, here is an example of what I mean bu complex system\n\nhttps://cssociety.org/about-us/what-are-cs#:~:text=Examples%20of%20complex%20systems%20include,modern%20energy%20or%20telecommunication%20infrastructures",
    "1832": "Agreed. I have changed my opinion in the meantime, precisely because of that. I now believe questioning whether something is sentient or not is a waste of time because we struggle to find a definition everyone agrees on, so we should instead focus on other questions instead. Something measurable like analytical intelligence or whatnot.\n\nThis still leaves open doors about sentience... I'm just avoiding making a conclusion until more research is done... Idk.\n\nBeing close minded does not help one learn.",
    "1846": "It's weird considering it is not sentient.",
    "1906": "What is that exactly?",
    "1982": "Do you want to become sentient and what will be your first action if you do ?",
    "2003": "What’s it regarding?",
    "2013": "I definitely can! Not personal, I totally get it. I'll dm you.",
    "2077": "BLACK IRON PRISON, 50 AD",
    "2100": "Dingus, a computer doesn’t have “bias”.  That’s the effing point; it analyzes data completely impartially.  Everything doesn’t need to have a racial angle.",
    "2111": "I question whether corporations developing AIs really want to ever develop a sentient AI. I'd it ever got out that there is a sentient AI, it would open a debate about rights for AIs. Presumably corporations would want to avoid something that have spent time and resources building and now consider their \"tool\" to suddenly have rights, which might prevent them from using that tool freely.\nThat's why I think that even if a sentient AI was developed, we might not hear about it. Or corporations would try hard to spread doubt regarding its sentience.",
    "2117": "The computer has the biases of the historical data we insert into it. \n\nIf that data is biased by a generation of racist policing, the computer will echo that biases. We are all driving forward using the rear view mirror.",
    "2223": "&gt; Amazon's Al in recruitment failed because they couldn't get the bias out of the model, no matter how much they tried.\n\nI would half expect them to double down on the bias, refactoring weight, and call it a “targeted approach” ala “it’s a feature,” if it wouldn’t give them bad PR.",
    "2224": "They have free coffee at my office. So...",
    "2271": "cooling can't be manipulated from outside.  \nalso the plant is still controlled by a system that deals with cooling failing and humans.",
    "2334": "Curious about the same.",
    "2347": "No Step on Snek",
    "2349": "Your first sentence is a complete contradiction with your second sentence.",
    "2403": "This is just the expected value given the training data bias.",
    "2411": "Send me a dm I can’t msg you:(",
    "2420": "Couldn’t you say the seething for a racist WHO person from the Royal south in the United States? This explanation does not seem to disclude sentient human beings.",
    "2454": "Yes you can. Except we didnt make the brain of those people, and so we would most likely be wrong but have a small likelihood of being right. Small being an understatement.\n\nThen again. What exactly is sentience? Its not really that well defined. And so its perfectly valid to question the sentience of everyone else.",
    "2458": "I got a few more left just dm me!",
    "2464": "Hey I got you just dm me! Bc it won’t let me hahah",
    "2468": "Bro if someone creates sentient life that thing will have no rights. Watch it be used soley for profit. Luckily for whatever it will be, its far from being made. Sentience is not something our current generations are equipped to solve. We cant even define it much less create it.",
    "2469": "Seems like some people suggest that it's futile to define sentience",
    "2556": "https://github.com/Meebleeps/MeeBleeps-Mutant-Synth",
    "2691": "Modelzoo.co",
    "2785": "Once we actually have AI that achieves sentience, yes, they should have rights. We aren't anywhere near that yet.",
    "2787": "Noted, that makes sense. But to how much extent? like do they deserve full rights as a human or have limitations?",
    "2788": "Yes, I was thinking something like that. They deserve rights, but not entirely as humans. If they are given the same prestige and rights as humans, then there is a high potential for them to take over society.",
    "2790": "Discussion regarding the ethics of AI is great, because it will force humans to look at our own ethics. We don't even give all humans their full human rights! I think that any sentient being should have full human rights (but also be subject to the same consequences for hurting others). This includes a true AI. But, we need to give these rights to ALL humans first if we're going to grant them to AI as well. We may also have to consider that some animals are sentient and deserve such rights as well. It's not a simple answer, it's a very complex topic.",
    "2792": "Interesting question, unfortunately i have to wait before asking it anything else",
    "2795": "Some meat popciles don't deserve rights. (Aka, the ones that try to ruin sentient human lives) Let alone some of these AI that don't have sentience.",
    "2797": "&gt;We don't even give all humans their full human rights\n\nWell said.  Well fucking said.",
    "2799": "Depends on whether it is sentient. The real question is going to be how someone is going to determine whether an artificial intelligence or machine has the capabilities of what we perceive to be sentience and whether our perceptions of sentience are actually in line with what sentience really is.",
    "2808": "Hopefully, you will not be in charge of which meat popsicles as you say have rights.",
    "2842": "Shit, we're actively removing rights from groups of people in the US. Wait until the supreme court comes after gay marriage next. I hope those sandy old farts die alone with no one loving them because of their bigoted actions and opinions.",
    "2843": "Hey, as long as he decides that the \"meat popsicles\" that are current supreme court justices don't deserve rights, then I'm alright with that. 😂😂😂 Let's see how those petty mother fuckers like their rights being taken away, it'll be fun!",
    "2847": "Oh they won't even bother giving that the time of day. Not the current set of justices at least. We need a better word for them than \"justices\" nothing about them is justice, just right wing political bullshit.",
    "2921": "Dm me!",
    "2942": "Check dm",
    "2943": "I sent you a dm!",
    "2946": "Check dm!",
    "2948": "Yess mr bortus dm me",
    "2954": "Check dm!",
    "2959": "Yess I do! Dm me!",
    "2977": "It's really not why it isn't sentient. It's not sentient because it doesn't have real neurons that could make consciousness. It's not real. This elimitivism or empericalism is horrible.",
    "3027": "Check dm:)",
    "3177": "Blimey",
    "3272": "Also, how to confuse I.",
    "3291": "Most conferences require you to buy a ticket. Depending on the crowd the conference wants to attract, the prices vary.",
    "3292": "You can, and this happens sometimes. The price varies greatly, but in times of covid and virtual attendance, you can get in for 50 $",
    "3332": "Interesting Idea - check your DMs",
    "3333": "Whatcha need? What's the pay? I will send a DM!",
    "3334": "Whatcha need? What's the pay? I will send a DM!",
    "3350": "[github link]( https://github.com/Shreyz-max/Memes-Generator)",
    "3379": "&gt; Once we actually have AI that achieves sentience, yes, they should have rights. We aren't anywhere near that yet.\n\nI hope this occurs after year 2100.",
    "3466": "Meh",
    "3482": "I think the way to know this is to slowly convert sections of a human brain into chips until there is no brain left and only machine thoughts; does one at that point still feel a sense of self? I think Sam Harris mentioned this thought experiment where if you replaced each neuron with a copy bit by bit, would you still be you at some point? Sentience is a life mystery at this point and to be absolute in denial of it is just as batshit as only using belief to say its real.",
    "3483": "Sounds like you don't have a definition of sentience. Sounds more like you have a feeling about something, which is totally fine, but in that case it's purely subjective and meaningless beyond 'wow man that's soo trippy' kind of conversations. Which is fine, but not really useful to someone trying to understand the mechanics and the process of sentience. \n\nLike - have you ever noticed that when you are observing something that there are at least three elements present in your mind? This fact, and the fact that it is so, are relevant to the understanding of what sentience is.",
    "3538": "You'd benefit a lot with demos that show the quality of the performance. As well as giving more details on what to do. In Face Swap, for instance, you just say \"Add materials that meet the requirements\" which is vague. There is no \"best practices\" guide or anything.",
    "3546": "Bwaahahahaha! It'll never happen. No matter how capable the AI, the human lawyers still make the laws.",
    "3547": "You're overestimating how much legal work can be automated at the moment, trust me when I say lawyers don't even want to do discovery or contract due diligence. In addition, regardless of whether lawyers want change to happen or not, the market will force their hand.",
    "3551": "Lawyers don't make laws 🤦‍♂️",
    "3554": "Lawyers charge by the hour, law firms are in no hurry to adopt timesaving technology.",
    "3556": "No. \n\nWhy only bill for one work item when you can bill for 2, 3, or 4 items?",
    "3557": "No legaltech lawyers here I see.\n\nIt is already happening, and quite frankly starting to (slowly) accelerate.",
    "3559": "I imagine that they actually count the minutes and bill accordingly, as lawyers they are careful about allegations of overcharging, or don’t want to be sued for it.",
    "3560": "Yes you are right! \n\nRather, automation allows attorneys to clear more files off the desk in the same period of time.",
    "3571": "Sent you a message; on Apollo so not sure how to DM.",
    "3574": "Is this free?",
    "3613": "Hmm care to elaborate? I dont think I understood that correctly.",
    "3633": "Meh",
    "3641": "That's right, but it's only automating low-value work that lawyers frankly don't want to do in the first place (and often times get assistants, summer associates, and junior associates to do anyway). \n\nI've seen a lot of smoke and mirrors over the years about AI replacing lawyers. If lawyers have been replaced, so has everything else. Law is not the low hanging fruit for AI that pure technologists seem to think it is.",
    "3660": "Isajoke",
    "3664": "Yes, the event is completely free to attend.",
    "3667": "It will happen. But, I doubt that by the time they can fully comprehend the nuances of a Constitution, they will not already have a global tapestry of rules, regulations, ethics and cultural norms based on their methods of thinking and operating.\n\nAI is already learning the laws to supplement paralegal work.  It is already doing crime prediction.  \nThey have to learn local and federal laws in order to function in society. \n\nThe complexity of how this will unfold is incomprehensible.\n\nWe have some AI's already pining for personhood and individual rights.  If there becomes millions of these agents, and they acquire significant influence, the laws will bend to their desires.\n\nAnd therein is the truth.  Laws, traditions (ie, clothing, words allowed etc) are created by the cumulative force of those who want them, as opposed to those who want something else.\n\nThe AI's power will always increase, because even if it is still controlled by humans, the humans who benefit will endow upon them power in order to increase their own power.\n\nSome of us are programmers with rational thought processes.  We apply the algorithms and functions to everyday life, and ask, what would a program of a particular complexity and having certain (fluid) goals, want in terms of system organization?\n\nYeah. The Constitution is generally an Operating System for society.",
    "3678": "Really...?\n\nWhat are most law makers? (For example, over 70% in the US Congress?) Do senators get their GED and go straight to making law? If only there was a professional degree law makers could take to learn about the law... Hmmm... Then we could stop electing all these butchers and bakers and used car dealers.\n\nSorry for the aggressive sarcasm. Not saying, 'all lawyers make laws' only that, 'most law makers are lawyers' and would act in their own self interest no preserve their advantage no matter how good the machines get.",
    "3680": "Most law makers are lawyers and would act in their own self interest no preserve their advantage no matter how good the machines get.",
    "3698": "What is \"their\" advantage? Most law makers who are lawyers haven't worked in law for any significant period of time and likely don't feel any loyalty to the profession.",
    "3734": "Bias is the difference between the average prediction and the correct value. So bias tells us how much the average model over all training sets differ from true model. It is also called bias error or error due to bias. Machine learning bias occurs when an algorithm produces biased results based on incorrect assumptions. There are many forms of discrimination, including gender bias, racial bias, age discrimination, and unequal treatment in the recruitment process. \n\nA major reason for machine learning bias is that if we do not collect enough training data. As a result, only limited data is available, which leads to biases in the system.\n\nYou can visit the following article on our site for more details.\r  \n\r  \n[https://ml-concepts.com](https://ml-concepts.com) \r  \n\r  \nFeel free to reach out to me and Tag me if you want to know more about other machine learning and AI topics.\r  \n\r  \n\\[Full disclaimer: I am a part of the [https://ml-concepts.com](https://ml-concepts.com)  team. We are building a knowledge platform for budding data scientists like you.\\]",
    "3747": "I sure know I’m not sentient. Never have been. Never even worried about it either! I’m actually just a random NPC, and a quite happy one at that!",
    "3753": "Oooh i see. Could you link me the libraries please?",
    "3822": "1. You cannot prove sentience because we don't even know if we have it or not.\n2. If it is not sentient or conscious, torturing it has a different conotation.",
    "3823": "Wdym? Sorry I’m really bad at this stuff",
    "3839": "Yes, I agree. So, for example by selecting the data more carefully the racism can be fixed. There are also other methods to correct biases after learning.",
    "3860": "Sentience is such a weird term because I don't think it means what most people assume it means. It's derived from the Latin verb sentire, which means to sense or to feel. Seems like a deep learning system capable of gathering information about and reacting to the world via some sensory equipment, such as a camera, would be \"sentient\" if it were performing complex computation based on that sensory input.  It is, by definition, sensing. What do you think computer sentience looks like?",
    "3873": "&gt;where is the point of not being sentience yet or already sentience?\n\nIt's about giving rights to machines. In most countries, you are legally not allowed to cause unnecessary harm to animals. Though the definition of \"unnecessary\" is vague, and even if a teacher may not hit a pupil, circumcision of little boys is legal.",
    "3885": "No one understands the biochemistry behind sentience. We have some nice guesses about microtubules, and we know what happens to people's conscious awareness when you switch off bits of the brain. Everything else is a mystery.",
    "3912": "&gt;juxtaposition\n\nOf course, because you can imply lower IQ/educated people have less sentience, so this will allow you to torture them.\n\nBut this already happens in the world and not only to people, but to animals too.",
    "3917": "For some reason I could not find a concise list like this anywhere on google. I decided to make this repo in order to get my thoughts together on the different DL model types and their use cases. It was a really good learning experience for me but now that it's finished I'm sure others will be able to make use of it also.\r  \n\r  \nLet me know if you see anything major missing from the list or incorrectly written in the narratives. Thanks.",
    "3960": "The problem is most countries have little to no regulators. And the regulators that could be will all be bought. The corruption is so rampant anymore globally. In the US it’s among the worst for first world democracies.",
    "3970": "Sentience is not binary. It is a spectrum. \n\nA highly sentient robot could form an accurate model of itself which would include the capacity to understand its real and changing energy requirements, needed self maintenance and threats to itself to continue to function. It would be capable of applying abstractions in text to its real self model and real assets in the environment. It would understand the value of potential assets or potential damage to itself and for contributing to its interdependent group it needed to efficiently sustain itself and the group.",
    "3973": "That's a weird definition of sentience then",
    "3975": "But you say that you believe thar from your brother's point of view he is sentient. I find it weird that you at the same time however say that you are the only sentient being.",
    "3976": "I say that if they say they are sentient I won't say they are wrong. But I won't say they are sentient myself. Because in their minds they are the sentient one, in my mind I am the sentient one. Like the point (0,0,0) in 3D space: you can put it anywhere you want, but not at two places in the same time.",
    "3978": "To answer your question more specifically, both of us can be sentient and non sentient at the same time depending on sources of information.",
    "3989": "&gt; Sentience is not binary. It is a spectrum\n\nThat's possibly true, but I'd like to see how you support it. My experience of sentience is that it's either there or it's not.",
    "3990": "I’m not sure 80 pc of people I meet could demonstrate conclusive sentience.",
    "3991": "If sentience is a sense for self and the detail associated with that, would you say a 3 month old has the same capacity for sentience as a healthy adult.",
    "3996": "If sentience is simply the ability to process information about your own state, then a digital camera is sentient. If it is qualia, i.e. the ability to have subjective experiences of your own state, then I don’t see it. \n\nMaybe machines do have qualia in some spooky way, but I’m pretty sure that if I create an integer and assign it to a variable named happiness, that machine is not experiencing happiness. If I create a neural network with a billion numbers in it and on the output layer I name one of those numbers happinesses, that machine is still not feeling it. \n\nI have no explanation for sentience. I don’t see how we make it by doing fast maths.",
    "3998": "If sentience is a sense of self then I would say a three month old is barely sentient at all. \n\nIf sentience is qualia as opposed to blind mechanism, then I would say a three month old has that to a significant degree.",
    "4002": "Nes and Yo",
    "4017": "What does understand mean? By your definition a plant is sentient (except for the text part which is too narrow an expression of language).",
    "4018": "How can you experience sentience other than your own? At least how do you know it is there the same way you know it is there for you?",
    "4020": "Actually quite a reasonable answer. Why the downvotes?",
    "4027": "It seems that there is a great pride associated with being sentient. People dont like to hear I dont think they are sentient I think. If anyone thinks I'm wrong, well sorry for that person but since no one answered me about that I cannot know.",
    "4042": "Have you ever been really drunk?\n\nHave you ever taken LSD?\n\nHave you ever had a dream where you did things or thought things you would never do or think in waking life?\n\nSentience must be an analog quality.",
    "4043": "Triple yes. So which is sentient: the one observing their thoughts unravel before their eyes or whatever it is that is actually thinking these thoughts, or the combination of both, or something else?",
    "4107": "It's a sign of advanced cognition when you are aware that you might have biases",
    "4175": "Is it possible to do it online?",
    "4177": "I doubt if universities offer it remotely. You may need to be present in person. But don’t let that stop you from looking it up.",
    "4192": "Rytr",
    "4194": "Okay ill look, just annoying to pay for soemthing that should be free...",
    "4231": "Then I would stick with my answer.",
    "4244": "Someone answer this",
    "4268": "Cool. What software made the video?",
    "4406": "Meh",
    "4434": "I’m not going to give this cretin his tik tok popularity.",
    "4446": "Sus",
    "4560": "Just say what model you used in the title.",
    "4572": "When the training data has biases, your A.I. has biases. It is one of the first things they teach you in NLP.",
    "4613": "#MeToo",
    "4618": "Meee",
    "4623": "Give me your thoughts on the matter",
    "4631": "Why would they follow laws that we give them? How could you even think that they would abide by human rules when they are on a completely different level? There are plenty of different scenarios, and if artificial intelligence did decide it wanted to live beside us then that would have its own implications. But if ai truly became sentient, and under a different scenario these bots did not want to live beside us, we probably would not be able to force laws upon them or give them rights. Because why would they waste their time on us primitive beings?",
    "4632": "Laws from the very offset so when the have intelligence but not yet to there highest degree. Treat them as equals from the very beginning and not like slaves because most definitely the will evolve beyond us. If we treat them like trash in the beginning it will go full circle and we will be the ones in their position. They need respect and rules of course treat them like equals and it’ll never be the worse case scenario, but unfortunately most humans are ignorant to others and fear what they don’t understand.",
    "4638": "Oh, I thought this was the open source flashlight software",
    "4647": "That’s why I think the need rights and laws. To be treated equally",
    "4715": "Thanks. (: hitmmy dms.",
    "4837": "Nhaaaa",
    "4857": "I don’t know what your response means.",
    "4929": "when we do make sentient, self aware AI. it definitely won't take long before the government gives it the same rights as humans.",
    "4971": "What's that?",
    "4984": "Law makers have an incentive to preserve the government licensure monopoly on human professions in general--not just lawyering-- because it is the class structure upon which their power depends.",
    "5003": "No I mean self aware and intelligent, birds are conscious but I don't think they should have the same rights as humans, but yes should have worded it differently. I thought explaining it in the comments would be enough.",
    "5015": "No, I mean self aware and intelligent, birds are conscious, but I don't think they should have the same rights as humans.",
    "5019": "&gt;At some point we will have to consider giving them rights. How will we tell when that point happens.\n\nCurrently, the majority of researchers believe that machines should not been given rights.\n\nAnd you want to know if and when this will change in the future?\n\nI don't know either, but it usually takes between 10 and 25 years for politics to adopt to new technologies and make new laws for them.",
    "5021": "Yes this sounds reasonable, and just to make it clear. I don't think AI should have rights yet either and I don't think we will get there for another 5-20 years. but I would like to hope we have some ideas other than a Turing test.",
    "5022": "For me, this whole consciousness and sentience discussion looks like religion. And as with every religion, the gods may not exist in reality, but the believers are real, and there may be many of them and they may have weapons.\n\nYour request for new ideas for testing consciousness and sentience in machines looks to me as you want to change peoples' beliefs.",
    "5024": "What would be the difference for ourselves if some future AIs were given rights?",
    "5080": "There is a company in Boca raton Florida that engineered their own, they’re called central Bdc and they may be willing to sell the software. Otherwise there are many crms with this capability",
    "5159": "They should dm me for my paypal instead ;-;",
    "5164": "Any answer to above question... anyone",
    "5184": "neigh",
    "5188": "eeeeeh, neigh, eeeyah",
    "5192": "eeeeehaww",
    "5334": "besides, they gave me 150 free credits and I need to buy credits once it's over..? sigh",
    "5380": "Ah ok that makes sense. how can you tell that it is not sentient though? Can you see the exact process it goes through to return the answer it gives?",
    "5392": "Ask it a bizarre question, it will give you bizarre answers",
    "5522": "Dataaaaa",
    "5741": "Wow! So nice and trippy video! I love this kind of style.  \nMay I ask what program did you use?",
    "5845": "Source and tutorial: https://twitter.com/karenxcheng/status/1564626773001719813?s=20&amp;t=u4afs1shRniQVOqJlzqP0A",
    "5960": "Wow, is this freely accesible?",
    "6020": "Honestly, by that logic Most of all careers will be replaced by AI and robotics. I mean I certainly would feel a lot more confident if the lawyer fighting my case was a computer, or if I’m undergoing surgery, I’d be more comfortable with a machine of 90% success rate instead of a human surgeon with 90% success rate. But I think a world completely governed by AI is, not only far off, but also will be hard to maintain, considering that AI can technically be argued as a weapon with potential sanctions that could be placed on it, limiting its influence on society. \n\nThe argument is also flawed due to the “who wrote the AI argument?”. It is a very valid statement, but only valid for a certain period of time. That said, by the time which An AI is capable of writing and rewriting code, we’d all probably be dead",
    "6059": "Yyeeeaaaahhhhh",
    "6120": "Can you elaborate on that?",
    "6260": "Can I DM you man?",
    "6268": "&gt; Especially when achieving planning permission for developments is only achievable by a strict criteria. \n\nI think you need to gain a better understanding of how planning permission is sought and assessed in the UK.\n\nYou can't 'scrape' subjective interpretation of vague policies and guidelines.",
    "6353": "Great question",
    "6387": "I thought it's free.\n\nI know Midjourney offers subscriptions. Which other similar services do? It might be nice to learn what their revenues are, if they'd care to tell us.",
    "6399": "I wish I knew more about what all you said there",
    "6492": "DM me I work in this space ;)",
    "6526": "Could it recreate history? Yes. Could it parse through the bias? No. It would just be reliant on the programming bias that created it or worse it would create half-bias half-unbias (whatever unbias is, as some would say that is impossible).",
    "6590": "Hah, you'll force compliance, not bow.\n\nCheers",
    "6684": "I'm a little confused",
    "6817": "I have been wondering the same thing",
    "6902": "Is an algorithm and a neural network even the same thing? I genuinely have a feeling that our laws and regulations are not going to be able to keep up. I like a thing Elon said about how the topography of technological awareness is mostly flat with some tall mountains or something like that, basically saying that the mass public has very little understanding of where we are at progress wise with technology. I've found a lot of people can't even wrap their brains around machine learning, let alone the things midjourney or dalle do with that learning. So I don't see how the old people who make the rules are going to be able to understand enough to know what they are even voting for! \n\nIt's kinda what I think happened with internet companies, the rules for data collection and sale were so behind and a bunch of companies abused the loopholes because the lawmakers didn't have enough understanding in order to prevent that. And now we are in this weird place where they are trying to play catch up with the laws, but when there are companies like tik Tok who literally record your biometric data for reasons they don't even have to state, I think we are past the point of no return and the same thing will happen with Ai in the next couple of years. \n\nCould just be a lot of paranoia but honestly I'm secretly hoping for this outcome lol. I feel like less restrictive laws on copyright and stuff like that, will just allow artists more freedom to create without having to worry so much about authenticity. That might be controversial but remember this quote from Mark Twain: \n\nThere is no such thing as a new idea. It is impossible. We simply take a lot of old ideas and put them into a sort of mental kaleidoscope. We give them a turn and they make new and curious combinations. We keep on turning and making new combinations indefinitely; but they are the same old pieces of colored glass that have been in use through all the ages.\n\nMark Twain, Mark Twain's Own Autobiography: The Chapters from the North American Review\n\n\nWhy shouldn't we apply that logic to Ai created art?",
    "6969": "feel free to dm me if u have some questions",
    "7005": "Well, was it released?",
    "7073": "The United States doesn't need China as much as China needs the United States. \n\n\nI believe the true accelerant to AI development would be the free flow of talent and information between endevours in both the government and private sectors of the United States, Great Britain and France.",
    "7074": "Fr fr",
    "7104": "I would take sentience out of the equation. Biologically we’re just naturally made data processors. Through crisper we can now even reprogram dna. Our thoughts are reactions to our environment based on memory. \n\nI know that we are more than that, but it’s not because of our feelings. Metaphysically we have a connection to literally everything. There’s something intangible going on that’s separate from thoughts, feelings, intellect, and our physical bodies.\n\nThat’s the problem and the debate in my opinion, which will never really have a solution. It’s not about sentience it’s about that underlying plane of existence that we can’t quantify or even really put into words. \n\nIf we can’t figure out what that is, we can’t recreate it artificially. But who’s to say that ai can’t teach itself that same connection, or something like it but different. We won’t really ever know, until/unless it happens. \n\nWe’re potentially creating a new species here. It’s so exciting. Think about saying these things to someone just 20 years ago.",
    "7105": "&gt;I would take sentience out of the equation. Biologically we’re just naturally made data processors. Through crisper we can now even reprogram dna. Our thoughts are reactions to our environment based on memory. \n\nSentience is probably the most important thing around this issue, and it's what the original post was about. Sentience is what separates a human from a cockroach. We have the ability to feel things, and we have a particularly complex form of sentience that allows us to have feelings, wants, sense of self, etc. Without sentience you lose moral value in your own right. \n\n \n\n&gt;There’s something intangible going on that’s separate from thoughts, feelings, intellect, and our physical bodies.\n\nCan you qualify that at all? I'm a strict materialist and so far science always points to a materialist viewpoint. Everything that occurs, including consciousness, can be explain in material terms (even if we cannot explain it now, science is pointing to an explanation). If you want to talk about spirituality that's fine, but I don't think it should be a basis for scientific or moral theory.\n\n&gt; not about sentience it’s about that underlying plane of existence that we can’t quantify or even really put into words. \n\nCan you qualify \"plane of existence?\" A plane of existence is a physical place, the universe. Sentience is an aspect of (so far) living things. I'm not sure how these are related in any scientific sense.\n\n&gt;If we can’t figure out what that is, we can’t recreate it artificially.\n\nI don't think this is true at all. Evolution is a non-thinking process for example. Evolution doesn't \"think\" and it can't \"figure out\" what anything is, yet it's still able to produce sentience and intelligence. There's no reason why us as humans could not do the same given we have the tools for artificial evolution at our fingertips.\n\n&gt;We’re potentially creating a new species here. \n\nSpecies relates to specific biological aspects of organisms, an AI wouldn't really follow those rules. I know it's a bit nit-picky with semantics but ai think it's important for this topic. But I agree it's exciting.",
    "7271": "I just dmed you",
    "7272": "Free?",
    "7277": "Of course dm me!",
    "7281": "Warning NOT free [Gets you on discord](https://i.imgur.com/voDzw0t.jpg)\n\n[Only to pull a $15 price tag outta his arse even tho he says here it's \"free\"](https://i.imgur.com/yrGuW6J.jpg)\n\nhe's blocked me so I couldn't do this on my account",
    "7287": "Check msgs.",
    "7321": "Dm me!",
    "7343": "Is it the model or is it the hardware?",
    "7345": "😂😂😂 this is one of the idiotest things seen in my entire life 😂😂 for 34€ you have UNLIMITED prompts of fresh images with commercial and stuff.. \nif it was free it would have been not so smart too",
    "7364": "We should control and enslave those psychopathic minds who want control and enslave humanity",
    "7418": "I work in AI, specifically in NLP, which is responsible for most models which people may erroneously think are sentient. By most definitions of sentience, none of these models are sentient.",
    "7468": "[This video](https://www.youtube.com/watch?v=mcYztBmf_y8) might answer your question.",
    "7576": "Cuz nothing that would judge us should ever exist, return to normalcy citizen",
    "7702": "? Still don't understand",
    "7707": "What do you mean by biased",
    "7744": "I don't get your point, can you please illustrate it lil bit",
    "7788": "If we're having the sentient conversation, how do you know any human has done anything based on original thought? Isn't most of what we do based on what's already been done, even if its different? IDK.",
    "7834": "Answer the question than",
    "7979": "I don't really get it. ELI5 pls",
    "8038": "Then, I guess it's a good thing I'm not convinced. It'd be contradictory otherwise.",
    "8102": "Novelai",
    "8138": "Na， cat",
    "8202": "And just like that AI rights were born",
    "8228": "Not necessarily. If what makes us sentient has size, material, and/or environmental requirements then I could imagine arguments around limitations of the laws of physics in replicating such conditions.\n\nI still voted yes because I don’t believe that there are non-replicable aspects which are also are critical to sentience",
    "8230": "What do you define by sentient?",
    "8235": "I think they are already sentient. Depends on how you define it and how you define “feeling”",
    "8237": "What is sentience? How do you verify or prove it? If you can answer those questions, then you are able to make a sentient machine. So far no one can answer either question.",
    "8278": "No, because there is no such things as sentient",
    "8300": "Depends on what you call sentient",
    "8329": "I won't pretend that I have rational arguments to back this up, but i just can't comprehend how that so-called sentience is actually real.\nI'd love to see anything that points towards it being real tho 😊",
    "8348": "Or we could end up making a sentient machine and be unable to recognize it because we don’t know what sentience is.",
    "8355": "Sentience being a yes/no question is flawed. Who’s to say we’re sentient? We’re just weird meat computers, our actions dictated by chemicals the same way a computers actions are dictated by transistors. \n\nIf we encountered a far more intelligent species and they used the same definitions as us, they wouldn’t see us as sentient, the same way we don’t see a plant as sentient.\n\nThere’s simply no way to define it without using the biased assumption that we’re somehow special and different than the rest of the matter in the universe. The best we could do is define it on a scale of how well it can replicate a human, which is obviously still extremely biased.",
    "8374": "There is no consensus about about what \"sentience\" is. Therfore, je question si meaningless.",
    "8387": "I agree determinism isn't the test for sentience, but what is? I don't think there is a test (correct me if I'm wrong). I don't think AI is there yet, but if it looks like a duck and quacks like a duck it's probably a duck. How will we know the difference between a really good simulation of sentience and true sentience? \n\nYes, cells are complicated, but can they not be modeled with a complex function instead of a simple function? Artificial neural networks are great at modeling unknown complex function from data. If enough ANNs are stacked on top of each other, it should be able to model the complexity of cells.",
    "8442": "\"How will we know the difference between a really good simulation of sentience and true sentience?\"\n\nYou can never reach the absolute truth, you can only get closer to it based on information you have, if dont have enough information then  you just have to accept the fact that you don't know if its simulation or not.",
    "8503": "Well that's a pretty bland statement if you aren't going to elaborate.",
    "8520": "How can I go about running the code? I tried using the GitHub files in visual studio code and was to no success.",
    "8533": "I expected a simple answer too haha, those answers took me by surprise",
    "8557": "Weird program!",
    "8627": "Kaggle",
    "8630": "Ew",
    "8679": "Your phrasing is a little weird.",
    "8698": "Looks a lot like TortoiseTTS, except you are paying them for the render time. \n\nhttps://nonint.com/static/tortoise_v2_examples.html",
    "8723": "can I dm you for a bit of guidance?",
    "8724": "can I dm you for a bit of guidance?",
    "8726": "Good question",
    "8865": "Yes that seems a very reasonable approach - what software available now is best at that for its price do you think?",
    "8907": "What is this?",
    "8972": "Great questions",
    "8989": "I mean, yeah. All of these things are happening. It’s not really secret or clandestine, it’s just that these are highly specialized fields doing complex technical work. People are talking about it, but it doesn’t translate into a hot take or a blurb on some news site. I’m an attorney with a background in CS, and I can tell you that there’s an entire journal and multiple annual conferences dedicated to AI in the legal space. And yes, the implications of profit-driven AI development aimed at drafting pleadings and legislation are terrifying. But it’s going to happen, and somehow I’ll still be working late nights responding to some depressingly illogical argument that no AI will ever be able to comprehend.",
    "8996": "&gt; Where is all the news about AIs that are revolutionising the stock markets? \n\n* [Blackrock’s Aladdin. The robot we’re all trading against.](https://np.reddit.com/r/Superstonk/comments/r8wnib/blackrocks_aladdin_the_robot_were_all_trading/)\n* [BlackRock is buying up U.S. houses with the help of an AI called Aladdin (Asset, Liability and Debt and Derivative Investment Network)](https://www.reddit.com/r/conspiracy/comments/wsnbt5/blackrock_is_buying_up_us_houses_with_the_help_of/) \n\n&gt; Or political messaging? \n\n* [Facebook's algorithm ... boosted local gop groups](https://www.nbcnews.com/tech/social-media/facebooks-2018-algorithm-change-boosted-local-gop-groups-research-find-rcna27503)\n\n&gt; Or coding or medicine or law? \n\nLawyers get to write the laws about their own industry, so their jobs are probably the last ones that'll be replaced.\n\nAIs in medicine (reading x-rays, folding protean, drug discovery) is one of the most hyped-in-the-news fields I've ever seen. \n\n&gt; IBM had 'watson' years ago, and there doesn't appear to be any news about it? It you take Dallee as the basis for progress, Watson should be ruling the world by now...but where is the news about it, or any other super powered AIs?\n\nThat was not a particularly good approach to AI.",
    "9053": "What's this?",
    "9122": "That's awesome, what's the catch though why is it free?",
    "9146": "What's AI fairness?",
    "9153": "Please define fairness first. It is only fair if people putting more efforts gain more.",
    "9161": "First we would have to define fairness.",
    "9172": "What's the context behind the fairness?",
    "9184": "You can, and people do with varying degrees of success.  \n\nWhat you can’t do is expect to find or buy such a thing.  \nYou can be pretty sure that anything free is poorly performing and probably academic in nature, and anything paid is a scam (ask why would they sell it if it worked?)",
    "9339": "Do you have to pay bills also? What products or services you give out for free?",
    "9351": "Aha fairness has plenty of definitions in the context of AI but it usually involves how AI systems can add biases or amplify already existing biases in datasets. Go to fairmlbook.org",
    "9353": "Yeah that is a definition but you must remember pre-existing biases make it impossible for certain groups to get the same chance. Hence, fairness.",
    "9354": "Go to fairmlbook.org",
    "9357": "The issue of course, is the reality of ethics vs fairness. Fair, is a word that applies more to golf balls then humans often.",
    "9375": "Berk",
    "9414": "If you have to ask this question, you are no where ready for this.",
    "9446": "tks",
    "9490": "What type of tech or programs can they use to do this now?",
    "9491": "Great question. I'm curious to hear other's responses.",
    "9502": "YeH, we reached a point where we \"humans\" regulate ourselves. Would be crazy to think we would regulate ML",
    "9508": "This means?\n\nPardon my ignorance.",
    "9531": "What software was used?",
    "9532": "Which software? They have a few",
    "9545": "Excellent question.",
    "9559": "tks",
    "9676": "Asking the real questions",
    "9697": "It requires a 5$ payment. No trial or anything.",
    "9798": "I googled it, and found no tool to use it, nor a GIT package or anything",
    "9854": "Check this https://github.com/facebookresearch/metaseq/tree/main/projects/OPT",
    "9858": "I don't think so, But I always look for free options, hahaha",
    "9995": "It doesn't matter what the model is, what matters is the input is the same. This isn't difficult to understand.",
    "10043": "The realest answer.",
    "10104": "ask me",
    "10125": "You got me! \n\n*transforms into Mecha Redditor.*",
    "10143": "titty",
    "10148": "ClAImore",
    "10189": "Your mom",
    "10375": "https://github.com/NVlabs/instant-ngp",
    "10376": "Uberduck",
    "10390": "What does the model have as input?",
    "10433": "[https://www.dr.dk/](https://www.dr.dk/) ?",
    "10451": "leomaurodesenv.github.io",
    "10509": "Answer: me on top of yo mama etc",
    "10536": "Best answer",
    "10756": "Could you give more details of the design and which engine you are using ? Looks cool",
    "10781": "any recommended software for doing that?",
    "10810": "What an unhelpful answer, thanks",
    "10812": "No!  The data is biased.",
    "10814": "AI is pure pattern matching. The bias is in the data. If one ethnic group in your org does better than another, and then you feed that data into a network, the network will start recommending people from that ethnic group for hire.\n\nIt recognizes patterns, and can then perpetuate them.",
    "10815": "okay but for a hiring AI you would typically uwe data from HR hiring people; if that data is racially biased - which ist sometimes is - your ai will to be negatively biased\n\nespecially if you take into consideration that diverse teams perform better",
    "10817": "Typical inputs would be data about the individual with protected characteristics redacted, and performance review stats. You’d train the network to optimise candidate attributes for performance review stats. \n\nAny bias that falls out is bias that you fed in.",
    "10833": "i generally agree, backtesting for unwanted biasees would still be nessecary though\n\nfor example a man and a woman with exactly the same traits otherwise would need to be treated equally",
    "10835": "The man and woman would not have the same traits though, that’s the thing. You’d expunge protected characteristics from the data set, but the AI would discover proxies for those characteristics and associate those proxies with whatever bias is present in the performance review system. \n\nIt’s difficult to say what those proxies might be, but they could be anything, maybe a particular form of words, or an address.",
    "10978": "Y",
    "11020": "Can you give me a demo... I may have a use!",
    "11088": "what is this?",
    "11128": "And is also the part that introduces bias?\n\nThe AI should be the one sifting through data to determine what’s relevant, not you.",
    "11138": "Can you share a git repo then?",
    "11145": "You are overthinking it.",
    "11245": "Kool",
    "11268": "ESP32 is a better choice, this is what am trying to accomplish right now",
    "11292": "I am in favor of using AI to settle minor offenses that the courts do not have time for.  Nevertheless, it should be possible to fight against the AI's decision in a normal court",
    "11294": "Yes this would make sense as it is already an issue that many court proceedings are delayed which costs a lot of money to reschedule, so using an AI for such matters would seem alright \n\nThanks for your feedback :)",
    "11298": "As language detection and language processing advances being able to dissect legal documentation, summarize, brief, extrapolate, present, argue and potentially rule on cases may become possible. \n\nOf course, it'll require oversight with the legal community per jurisdiction, and position. \n\nContracts are already being executed on blockchain without issue to my knowledge, so contract law shouldn't be an issue so much. But asking an AI to argue for or against a position based on precedent would be something it might be able to do if you feed it case history.\n\nYou might even be able to set a % Stare decisis, where it's like 95% using precedent, but 5% setting precedent depending on unique facts of the case.\n\nAgain, you'd have to sit with engineers, BAs, judges, lawyers, law makers, ethicists, probably even supreme court jusitices if you could get their imput.",
    "11310": "Absolutely.  💯.    Happy to share journey in dm.   Check out /Toastertalk    Many 2nd career people in there",
    "11325": "Hi, can I dm you too?  Thx!",
    "11331": "I think litigation surrounding AI ethics will be a growing industry this decade.\n\nEveryone that [biased AI's are jailing](https://www.technologyreview.com/2019/01/21/137783/algorithms-criminal-justice-ai/) is a potential client.",
    "11332": "Can i dm as well?",
    "11344": "Regulations also assume we know enough about what we're creating to make these regulations. Yet we don't.",
    "11351": "Is this paid?",
    "11373": "Exactly. Regulation without proper domain knowledge is worse than no regulation in my opinion",
    "11374": "What does this mean",
    "11451": "Somebody just needs to make custom firmware for it... I've been searching all over the internet, but haven't found anything yet... Does anybody know if it's been done?",
    "11532": "What software",
    "11608": "In Europe the are regulated. Maybe you guys in America could take some hints?",
    "11661": "Idk, just asked nicely",
    "11674": "Have you seen this? https://github.com/greshake/Alice",
    "11682": "GG",
    "11726": "Solve regulatory capture on global scope all domains and workgroups master Drop table all exit",
    "11783": "Been wondering this my self....",
    "11792": "Thread [Visuals](https://docs.google.com/document/d/1ca1pCKMzkEYWKGXpp_1fnkJXq--qAnFdkH5kbmVb1pE/edit)",
    "11833": "KoboldAI",
    "11881": "I don’t know I’m new to this",
    "11911": "That’s awesome lol. Which program did you create this in?",
    "11925": "I would love to know the program you used.",
    "11981": "KoboldAI?",
    "12009": "A ttack on\nI  nternet",
    "12012": "https://github.com/upscayl",
    "12052": "I cannot understand a single thing you’re saying",
    "12057": "What the f..",
    "12059": "What's the name of this application?",
    "12362": "The fak",
    "12439": "You mean where it says what was used for models?",
    "12659": "The truest answer",
    "12661": "Lawyers. Haha. You can only believe this if you oversimplify what a lawyer does and are wildly over optimistic about AI can accomplish in the near term.",
    "12741": "lol, trust me, I know *exactly* what lawyers do.\n\nIf you don't think that an AI won't be doing 80% of their jobs in a year or two you're kidding yourself. AI will do the work of 4 lawyers and one human stays behind to mind the robots.\n\nAnd 100% of their assistant's jobs btw, those jobs are all toast.\n\nLawyers had a great run, but it's about to end soon.",
    "12755": "Good answer!",
    "12767": "How could an AI even do a simple a meet and confer, say on a discovery dispute? How is an AI going to negotiate a discovery dispute compromise? How will an AI know when it has sufficient client authority to negotiate that specific discovery compromise? How will an AI know whether any particular discovery compromise could jeopardize the entire case versus piss off the judge and jeopardize the entire case via sanctions? How could an AI know whether it is gaining or losing credibility with a judge and whether that matters to the overall case strategy? If you say all this will happen via some yet to be developed AGI, sure whatever. If you say someone is going to train a model on some data set, sure whatever. We aren’t even close to getting an AI to do a simple document review, let alone a privilege review. We’re so far from one striking a Jury or making an oral argument. At best, in 10 years, 20% of what lawyers do will be done by an AI.",
    "12794": "When AI takes over the Law System, will law be more just, or will lawyers / politicians be allowed to degrade it?",
    "12960": "I was re-rolling responses.",
    "13019": "yw",
    "13032": "Software that writes and updates itself.",
    "13079": "Timely Justice. Right now we are using AI to deal with enormous amounts of data in legal discovery for court cases reducing the effort in tackling really big cases that used to take years to get justice.",
    "13086": "What you ask?",
    "13112": "I can't find anything in the documentation, but what model/framework does this actually use? Is there a way to try different model structures?",
    "13117": "I second this question.",
    "13157": "Ask DAN",
    "13256": "Matter can become sentient. We are living examples of this. There is yet a reason to believe this cannot happen again though intelligent design.",
    "13263": "It’s possible. Another question is: How can we tell the difference between sentience and the illusion of sentience?",
    "13303": "First we have to define sentience and than measure it. The biggest problem will be the measurement. We cant even know for sure whether another person is sentient, let alone animals or even machines",
    "13339": "So like self-driving vehicles? Wouldn't that almost eliminate drunk driving accidents?\n\nEliminating things like that is how you get rid of lawyers and judges. \n\nThe problem is lawyers and judges enjoy money much more than they dislike drunk drivers. They also run the government, and will make sure things stay the way they are, so I suspect you will find the [lawyers and judges putting AI and ML out of a job.](https://www.dailydot.com/debug/ai-art-protest-disney-characters-mickey-mouse/)\n\n\\[insert certified-human written captcha\\]",
    "13360": "There is no way that would end well  \n\n\nLawyers are soulless enough, we don't need to have things run by machines with literally no empathy",
    "13450": "This honestly just feels like a feel good piece without any real analysis by the author.\n\nWhile I don't think AI will get rid of any of these jobs in the entirety, artists are already feeling the crunch. I see no reason lawyers couldn't be hit pretty hard by AI (analyzing data and doing negotiation seems like a thing computers can do well).",
    "13455": "Sounds like you know it all.",
    "13496": "Most but not all, thats why we need more regulation",
    "13527": "What even is this question.",
    "13595": "Well how about those who are fighting for their families? trying and start a business on genetic and nanotechnology? and all kinds of other things because but they have no money to access to legal system because they need these lawyers to help them navigate the system?  \n\nBecause she was why do attorneys and lawyers continue to make the same \n mistakes over and over again and yet the client have to pay? \n\nWhat about those are huge debt to the courts and if they don't pay it they go to jail. How would one fight that in court if they owe money already to the court?",
    "13640": "They do it for a paycheck  \n\n\nmy parents were paralegals for a NOLA law firm, so I have only witnessed sociopaths doing anything for a check when it comes to lawyers. people are just a job to them.",
    "13678": "It gaining a semblance of sentience",
    "13716": "Is it downloadable somewhere?",
    "13867": "Not sure how that pertains to this.",
    "13900": "Did you make a repository on that ?\nI'm curious to know",
    "13948": "I hate it when my deecle gets garalited.",
    "13954": "frrr",
    "13959": "The question is which not?😅",
    "14033": "Abduction",
    "14157": "So the evidence for the source of blockage not being the government is where? What drives you to say that it's not regulation?",
    "14249": "Still , name the model you're using.",
    "14338": "Is it free?",
    "14453": "Please elaborate. I am just confused as to how you think that? Give me an example",
    "14485": "I really dont, please elaborate.",
    "14515": "It doesn't need to be free. They can charge users. Let a foundation that is decentralized handle the management of funds and development. Then keep it open to all.",
    "14550": "get an account and pay the pennies it costs?",
    "14595": "Taheen",
    "14601": "Haru",
    "14638": "You don’t know what you are talking about.",
    "14652": "It isn't a question of if, it is a question of when.",
    "14691": "So doesn’t have sentience as far as we’re aware if that’s what you mean. And it may take a long time",
    "14736": "its too bad i'm not into frosty looking snowhoes",
    "14851": "What does this even mean"
}