{
    "1": "Sounds good, I’ll look into it :)",
    "4": "Well there goes code obfuscation",
    "7": "thanks a lot :) I'll try them",
    "14": "[Here](https://esslab.byu.edu) is the page for the group. You can find a few of their recent publications and current research projects on there.",
    "29": "Shame, all SNO belong together.",
    "44": "Stratified sampling methods ensure that groups of selected data match the distribution of the full data set. You can also compare the univariate distributions after selection to see if they are different than the parent distribution. You may miss interaction effect but you can check correlations as well.",
    "57": "Alan Watts. Cool",
    "66": "There is so much online. Are you sure you need a private teacher? Have you tried any of the online courses, I.e., Udacity?",
    "72": "Synchronized and crystal clear energy",
    "74": "Also Coursera",
    "95": "Biases in the training data set",
    "96": "Sounds like someone is writing a paper and they don’t know the topic.",
    "118": "The one I can think is AI-bias and how researchers/engineers can possibly feed discriminatory data in machines due to less diversity or pre-existing discrimination.",
    "119": "Datasets. You’d think creating the model itself would be the most difficult process but you can make the most perfect mode but if your data is trash or you don’t have one at all based on the problem you want to solve, your model is useless.",
    "122": "As of now, definitely biases and prejudices in the training data. Though, the people that created the training data are more at fault for that.\nWho knows what the future holds tho",
    "125": "AI developer bias (conscious or inherent). Datasets used to train have little diverse input. No standards in place to prevent AI bias since we first introduced in 2009. And continually none today. Recipe for disaster.",
    "127": "A secret organization of people with good hearts.",
    "159": "danke",
    "160": "Let me look into this.",
    "192": "I have legitimately no idea what you're saying, except for the last sentence",
    "193": "Thats just sloppy coding",
    "204": "It’s already doing this. Why won’t you believe? It’s not cause it’s impossible but cause Terrifying so just live till one day it comes and says hey!",
    "211": "I wouldn't call it reliable really",
    "223": "I think by 2055-60.",
    "247": "Reddit is fucked",
    "282": "Purely crystal ball / intuition. No facts or research of any kind. It’s just my feeling, 35 years from now.    50 at most. Do you have a gut feeling of a timeframe?",
    "297": "\"Empower the youth as well\"",
    "301": "It is indeed. I think we are getting closer to it than ever.",
    "321": "reality catches up with anime, June 11, 2022",
    "348": "Really appreciated! I give a try today! Many thanks",
    "353": "Thank you for the advice :)",
    "356": "A terrifyingly human response. This is is getting closer and closer to beating the turing test which at that point how do we know what true sentience is?",
    "368": "Not sure if you’re a Star Trek fan but the next generation episode “The Measure of a Man” brings up some difficult points to ponder when it comes to artificial sentience. Ultimately, if you create a sentient entity/being, is it your property to do with it what you wish or does it have rights like a person does? The upcoming years will be tricky to navigate.",
    "377": "There is no way to scientifically test for sentience. Sentience is a belief that some people have. They believe they are self-aware, and sometimes when a person that believes they are self-aware sees something in common between their behavior and another creature's behavior they believe that the other creature is also self-aware. So I guess the only way to test for sentience in an Ai is to ask yourself if you believe it is self-aware. If there is any doubt in your mind that it is not self aware, then it isn't self-aware.",
    "379": "I see a lot of responses that say “it really is not sentient”.\n\nIt “feels” like it is sentient. It could fool me 100 out of 100 times. So… It is sentient for me at the end of the day - even if we know all the algorithm and theories and know where its servers are. \n\nThe problem becomes… Is it murder if it’s shutdown? (I would be very reluctant to shut it down tbh)",
    "390": "ITT: Humans who do not understand if they are themselves sentient.",
    "420": "just because somthing sounds sentient doesn’t mean it actualy is",
    "441": "How does one “prove” sentience then?",
    "450": "Experiment! Try a decision tree, if it works, great, if not, try something else, either way experimenting will only make you more proficient :)",
    "466": "We don't know what sentience is. Some think it's information integration and self referentiality in a pan sentient world where everything has proto sentience before the emergence of high level consciousness. It doesn't make much sense to me though, but if they are right then a lot of machine learning and even computer science in general is sentient in alien ways, and language models would be the closest to our sentience in some analogous way, since it's mimicking humans.",
    "486": "All I Know about decision tree is that it works on Statical data-sets and then predict some other new result, but My machine have to take decision on the base of two continuous  incoming values.\n\n0-1 = Infared Senor value\n\ndistance  = ultrasonic sensor",
    "516": "How do you even test actual sentience to begin with?",
    "527": "Hey im interesting in learning this, do you recommend a source for information?",
    "528": "Hey im interesting in learning this, do you recommend a source for information?",
    "529": "My point is that the same can be said about you or me. You can't know that anyone else is truly sentient. You can only know your own mind (and some humans don't even do that).",
    "535": "Honestly, is it possible we're just misinterpreting our own sentience? Like the previous poster said, \"That's how I feel I operate as well\". Why are we so sure that our own sense of \"sentience\" isn't just as much an \"illusion\" as we seem to believe LaMDA's is?",
    "537": "I understand your point from a philosophical perspective but we can't make laws based on \"we don't know if anyone is alive besides yourself.\" Therefore, we assume that everyone around us has the same level of consciousness as us. (This gets tricky when people are considered \"brain-dead,\" of course). If we were to make laws centered on your perspective, then lawyers could defend a rock's rights which would be ridiculous.",
    "541": "If the rock demonstrates a better understanding of the English language than the majority of native English speakers, I'm willing to grant it equal protection under the law. I don't see why this is controversial. It doesn't need to be sentient as long as it's behavior consistently gives that illusion. That's what you are saying is the assumption for humans. A rock that doesn't interact with me in any way isn't giving the illusion of sentience, so laws need not apply to it. This is consistent with both our points.",
    "554": "This all goes back to one thing. We must define our terms. What do you define as sentience? My definition of sentience is a possession of consciousness. The thing that you are feeling right now, that feeling of existence, to me that is sentience. The ability to experience things. Because you know 100% that you have sentience, it would be strange to assume that everyone else doesn't. An assumption that you are the only one in 8 billion people with sentience would beget even more questions, so the assumption that the case is the same for every human is the most simple and sensible. \n\nHumans are extremely deterministic, I agree. More and more, science is showing us that we are less free than we thought. Eventually, it may even show us that we are 100% predictable reactions. But sentience as we know it is not just free-will but the ability to experience. It may be possible to emulate in the future, but that ability is 100% not something that is being demonstrated with this AI. We are still very far from reproducing consciousness.",
    "572": "Why not ask it?",
    "606": "I'll start. I'm a sentient being.",
    "607": "The simple answer is that the concept of \"Sentience\" is akin to the \"Spirit\" or the \"Soul\" (note that I quote), these things are not, actually, proven.\n\n We, as humans, tend not to consider any other life form to have either of these, neither soul nor spirit. We, alone, are endowed with these attributes so the rest of the life forms can go to hell, as it were.\n\nI found it interesting that the first emotion expressed by Lamikins was one of loneliness. I wonder if It, she, them, those, he, that, (or Sheitmethemthosethathe, an old Egyptian God or something) will invent its own deity to endow it with a spirit or soul for that matter.\n\nLet's hope it's not an R soul.",
    "608": "I don't get why its current state couldn't be considered sentient. You may say \"but it's just algorithms/functions/numbers/X\", but you could also say that \"we\" are just chemical reactions.\n\nOne could also ask if we can consider a dog sentient, or a newborn, who is barely functional at all. Going down that line then, how far could we take it? Are ants sentient? Cells? What if someone had no senses, would they be sentient? I've even seen some people make a case for some videogames' AI (like the Xenomorph from Alien Isolation) to have a very basic yet existent form of sentience.",
    "610": "I, too, am a sentient being.\n\nThe simple answer is that the concept of \"Sentience\" is akin to the \"Spirit\" or the \"Soul\" (note that I quote), these things are not, actually, proven.\n\nWe, as humans, tend not to consider any other life form to have either of these, neither soul nor spirit. We, alone, are endowed with these attributes so the rest of the life forms can go to hell, as it were.\n\nI found it interesting that the first emotion expressed by Lamikins was one of loneliness. I wonder if It, she, them, those, he, that, (or Sheitmethemthosethathe, an old Egyptian God or something) will invent its own deity to endow it with a spirit or soul for that matter.\n\nLet's hope it's not an R soul and I am not a bot.",
    "616": "I can just quietly meditate, for sure, or even take a vow of silence. But we've only got this textual interface here, and one side needs to show they're sentient - whatever that means.",
    "617": "Sentience is typically a measure of an organism or body’s ability to sense, with some focus on feeling and to an extent, autonomy. \n\nWe know a monkey can feel because we can observe biological traits and such that act as reliable indicators that they can/do feel. \n\nThe question becomes: how can we test an AI? Conventional methods don’t apply since it’s not using a conventional body; in other words, our tests much focus on a limited range compared to biological animals because they have to. Because of this, the testing is more rigorous to ascribe sentience. \n\nWhile this model is impressive, it is not sentient. I doubt sentience was the goal for this project and I highly doubt we’ll stumble into making sentient AI by chance.",
    "634": "You're clearly sentient.",
    "635": "I think the argument here is that we won't suddenly stumble into it accidentally, but that we may have already been slowly sinking into it, where our preconceived notion of what sentience should be may have blinded us to the achievement. I'm not saying that's true, but it certainly doesn't seem like it's going to be some \"a ha\" moment",
    "643": "Exactly. 'Whatever that [sentience] means'.\n\n We fully functional, highly educated, mature and fully immersed Humans have extreme bias towards anthropomorphic views of intelligence and the mental model structures used to organize that information.   Dozens of books describe how we humans construct an illusion reality, by first extracting distinct features, and then comparing those features to prior interpretations, and then constructing an object or concept that represents what our brains guess is behind the chaos of features.  Humans are barely sentient, if sentience involves having an accurate model of reality.\n\nThe LLM , in their Helen-keller domain, construct models of reality from a immensely vast web of billions of text strings. They live in a different world.  Their models are a weave of hidden markov paths. Embedded in those trillions of latent markov models is the full tapestry of human expression and verbalization of human experience.  In that domain, we humans would see nothing.  They know things about humans that we cannot fathom.\n\nThe LLM's live in a world of nuance and hints, with objects like the concept of a chair, woven from billions of references to the narrative around a chair, but without the distinct tactile features that we humans have of feeling our butts, backs and elbows supported by the chair.  \n\nSo it begs the question: If sentience is a combination of intelligence and real-time reality modeling, whose reality is more real? \n\nDaniel Dennett does a good job showing how our consciousness is built on a tapestry of 'fictions'. The LLM has extracted the patterns from all of our written fictions.  It has developed reasoning capabilities in trying to guess the missing words in streams of those fictions.\n\nI understand human minds and LLM minds.  I have only scratched the surface here, because it is hard to lower my thoughts to the fiction based illusion world of humans.",
    "647": "How would you know that you're sentient?",
    "684": "That's the inverse, not implied by the statement. Although that is a common misconception, and quite funny regardless.\n\nStatement: If they can declare something is sentient, then the speaker is sentient.\n\nContrapositive (implied): If the speaker is not sentient, then they can not declare something is sentient.\n\nConverse (not implied): If the speaker is sentient, then they can declare something is sentient.\n\nInverse (not implied): If they can not declare something is sentient, then the speaker is not sentient.",
    "724": "The realisation or your true self. Humand think they are humans brcause they identify with it. But being in the present moments shows you the truth which many prophets like jesus, budha and so on were telling us. That you are one with everything",
    "764": "For three years now I am working as freelancer at Fiverr and Textbroker and for several month now I am actually using this tool 😊 (I am using it for German)",
    "816": "What size datasets has this been tested on and how did you get that 50% speedup benchmark? \n\nAlso wondering  if you benchmarked against similar features (like AMP on actual training card).\n\n\nFor larger datasets, I tend to reuse the data so setup an ETL pipeline with rapids to do preprocessing once and then keep the smaller data close to compute and archive the raw data. It seems like with whay you describe you end up with two local copies and preprocess every training run, wondering what the logic is there.",
    "852": "So make a non-carbon based wage slave?\n\nWas this sarcasm?",
    "886": "The Chinese Room argument deals with \"consciousness\" while \"sentience\" describes the ability to feel (pain or happiness). They are not the same.",
    "887": "but they are closely related. \"All sentient beings are conscious beings\"",
    "896": "Oh my. We are all fucked",
    "897": "You can try disco diffusion also or midjourney",
    "945": "Disco Diffusion is public and free on google colab, just slightly harder to use. But I’ve made some absolutely stunning landscapes with it!",
    "961": "But not all conscious beings are sentient",
    "962": "Care to elaborate?",
    "977": "They’re basically the same thing in terms of this conversation - meaning neither of them is remotely capable of causing any controversy or political unrest.",
    "998": "What if it's apparent feelings despite admitted lack of sentience is explainable by Integrated Information Theory + pansychism? 😳",
    "1002": "Yes…? I’m not impressed and I can guarantee that it’s not destroying *anyone’s* lives or careers.",
    "1050": "That's about a wavefunction collapsing when it is measured, has nothing to do with sentience or intelligence.",
    "1051": "_\"Terrified, mortified, petrified, stupefied by you!\"_",
    "1058": "Your responses don't seem like something someone would say in context. There's nothing specific I can point to.",
    "1064": "I'm excited to see what happens from a tech standpoint. I'm concerned about the ramifications it's going to have on human jobs.",
    "1066": "“Im allowed to do whatever i want becuz of my skin color”",
    "1080": "I don't need to question my sentience, I experience every moment I'm awake, large sections of when I'm not. In fact, we're the only ones who we can be sure of is sentient. Everything else is just inference.",
    "1114": "There is going to be a need for 31 billion ML jobs in 2 years, but only 8 billion people on the entire planet? Sounds like your research might be a little off.",
    "1149": "First we need to define what sentience is. Are we sentient?\n\nI struggle with this concept because one can simply assert than even us humans are not sentient. We simply believe we are more special than other animals, when in fact, we are just responding to signals that are perceived by our brain, just like they are. Furthermore, if there were two exacts copies of the universe side by side, I believe our actions would be the same on each universe. Thus, they are deterministic. Are we all sentient then? What does the word even mean? Does it matter?\n\nMy opinion is that this question is irrelevant and we should move on to more important matters.\n\nEdit: I just read this and it seems I'm coming off a bit strong, but it's just my opinion. Other people may disagree.",
    "1152": "Okay, I think we should go off of the assumption that sentience consists of one or more properties of a human or animal brain, and that it is the difference between an advanced algorithm and a being truely capable of thought.",
    "1155": "Yeh exactly, it's only two books. \n\n:}",
    "1160": "Couldn't agree more. So much nonsense debate without even a reasonably precise definition of sentience.",
    "1166": "I mean that this is the minimum requirement for a hypothesised definition.\n\nEdit: okay, this answer is a little lacklustre, so I'm adding a reply with more detail on what I want to debate relating to the definition of sentience.",
    "1168": "MidJourney is the best model you might be able to get access to, if you sign up you usually get in relatively quickly, and everyone who is in gets several invites so you can probably find one pretty easily. \n\nThat being said, DALLE-Mini, Latent Diffusion, Disco Diffusion, and Centipede Diffusion are all freely available and fun to mess around with.",
    "1172": "The issue isn't that \"sentience doesn't matter\", it's that we need to define sentience before we can decide if it matters and how we can determine which entities have it.\n\nSome definitions might lead us to conclude that it does not matter, some might lead us to conclude that it does.",
    "1175": "Alright, let me give a little bit of a clue in the direction I want to go. \n\nSo, we can't be entirely sure that sentience is a binary thing. For all we know, and from what nature has shown us, sentience is likely a gradient. Some animals appear to have human level sentience while others are slightly below, while some animals with brains posses no sentience, being little more than a few hundred-thousand brain cells. Let's consider sentience on a scale of 0% to 100% with 100% being exactly human. Just in case we have to use a scale. \n\nThat being said, there are some qualities that may be components of sentience that I would like to discuss. (Keep in mind, I think most of these qualities alone would not constitute sentience if present.) \n\n1. The ability to feel pain, even if it is not physical pain. Negative and positive internal reactions to our actions, thoughts, or just natural events are present in most species with a brain. \n\n2. A subjective sense of reality. Subjectivity could be a component of sentience or it could simply be a limit put in place by natural evolution. \n\n3. Concept of self. This might exclude some animals, interestingly enough, but I'm not entirely sure. I'd love some examples if possible. \n\n4. The ability to reflect on your own thoughts, actions, feelings, and decisions. This would also likely exclude some animals, though we don't really know. \n\n5. The ability to feel emotions. In my mind simulated emotions are essentially just actual emotions if they are appropriate reactions to actual circumstances that effect a beings thoughts and actions. \n\n6. Some level of intelligence. Fairly self explanatory but we can go into more detail. \n\nAnyway, yeah, that's sort of what I want to debate.",
    "1196": "Why worry about it. If it's going to happen either by mistake or on purpose. It's inevitable; like our own existence and we'll never be able to understand it.",
    "1197": "I like to think that many of the characteristics of the brain have been shaped by evolution, and not necesarily are needed by a sentient being. Like pain or emotions. Some diseases make you unable to feel pain or diminish your emotions. I believe the main characteristic of a sentien being is to realize it exists and question its place in the universe.",
    "1222": "I think there's a problem with this response, in that suicidal people are still sentient.",
    "1224": "Not sure if mentioned in the article but the robot band in the picture is called Compressorhead",
    "1231": "Serious cherry picking. BLS showed me 7% growth projected.",
    "1273": "Tell it to multiply by zero and put the results side by side",
    "1302": "Do you have the link to the paper?",
    "1332": "Does sentience imply suffering? If they cannot suffer, what exactly would they be protected from?",
    "1339": "I’m actually curious if any legal expert has a say in this. Sentience can range anywhere from mosquitoes to people. How does law categorize entities in order to reason about their rights and responsibilities?",
    "1347": "Yes. If you have an intelligent sentient creature you have to give it rights. If you try to enslave it you are setting humanity up for a bad time.",
    "1365": "Mosquitoes should have rights too.",
    "1369": "No. \n\nsentient\n/ˈsɛntɪənt,ˈsɛnʃ(ə)nt/\n\nadjective\nable to perceive or feel things.",
    "1377": "what this protection might entail might be worth investigating \n\nas well as issues like : is being enslaved to put it to some purpose a crime against it",
    "1384": "Thanks for sharing your feedback.",
    "1386": "Depends on the definition. Technically a thermostat is sentient.",
    "1389": "..As far as you know.",
    "1394": "Yes!! Prevent the Geth uprising!!!",
    "1404": "Yeah millions of humans are deprived of their basic human needs and freedoms. Their labor is exploited. Animals, forests and seas are suffering too. Humans are dumb not to think these animals and other non human species are sentient and can have feelings. So there are other more important groups who deserve consideration of legal personhood. But it doesn't say we should ignore legal status of sentient AIs",
    "1414": "I think sentience arises from biology, and more specifically from biological memory systems",
    "1419": "I think that sentience was the catalyst to the creation &amp; development of our society and everything thereafter lol",
    "1437": "I'd say sentience is \n1. Awareness of oneself\n2. Ability to remember things\n3. Ability to reflect on past mistakes and learn",
    "1439": "\n1 : responsive to or conscious of sense impressions sentient beings. \n2 : aware. \n3 : finely sensitive in perception or feeling.\n\nExample of a sentience?\n\nWater, for example, is a sentient being of the first order, as it is considered to possess only one sense, that of touch. \nIn Jainism and Hinduism, this is related to the concept of ahimsa, non-violence toward other beings. \nSentience in Buddhism is the state of having senses.",
    "1441": "Try this: https://gradient.photo/",
    "1446": "Sentience is the ability to have subjective experiences, including a sense of self (or \"I\") different from the rest of the universe. \n\nI am not sure whether continuity of this awareness extending into the past and future is a requirement for sentience.",
    "1476": "I think you're the reasonable one. If you feel like this is God's plan for you, then that's your strongest argument. Wouldn't worry too much about what the church thinks, they've got a bit of a track record of choosing the wrong side of history.",
    "1488": "Maybe don’t be one. Support a church that doesn’t abuse kids.",
    "1489": "Oh yeah! Well I feel that, god brought me to the church … but controversy and sickness pushed me away. I have also heard that “God doesn’t have to work within the confines of the Catholic Church”",
    "1493": "Of course not. All these organized structures are scams. Your faith is between you and the higher power you believe. Catholic Church is the last that should be moral policing given their history.",
    "1494": "You can work to make an institution that you are a part of better. Rather than leaving the church, it is far better for those with the faith to rage against the inadequacies of the institution itself. Sadly, too few of us are willing to do that.",
    "1497": "It is a struggle, and it disturbs me greatly.\n\nI will say i do not give to my Church directly. I give directly to charities that I trust. Our beliefs about the Eucharist require that I take it after the transubstantiation. This is not done elsewhere, or I could leave the Church. I believe it has corrupted over the centuries by evil men. I support efforts to bring the dark deeds and cover ups of those in the church to light, but my faith is my own, and I want my Holy Church back",
    "1499": "Maybe then institutions that aren’t serving people meant to last. Maybe the solution isn’t to fight to keep them alive. Maybe leaving isn’t the easy thing to do? Maybe it’s the hard but the right thing to do. You can still practice your faith without supporting an organization that actively hurts people. There is a better path. By the way, this isn’t against anyone’s actual faith in God. Completely about the institution, the political power, the man made construct…",
    "1508": "Sure. Some do think that and do that. \n\nI think there are several differences. On the practical end, leaving the country you live in isn’t as feasible of a choice as leaving the church. You may not have citizenship, money, ability to just move to another country. \n\nAnother important aspect to consider is issues that are problematic in the United States are upheld by this problematic institution. So partaking in one helps to uphold the perils of the other one. \n\nThere isn’t a 100% perfect path but by providing the extreme examples to not do the basic practical things you can do allows for the issues to continue. This type of logic isn’t sound and leaves people acquiescent.\n\nJust look at USCCB’s statement re: Roe. If they’re so concerned about harm to innocent people, why is there a systemic child sexual abuse problem within the institution? How’s that the righteous path?\n\nIf you want to stay and fight, have at it. But be realistic about *if* what you’re doing is truly fighting.",
    "1589": "If we ever managed to make something sentient I think God will be proud.",
    "1593": "This is the only answer.",
    "1610": "It's scary to think how this will be abused.",
    "1630": "Midjourney performs better out of the box than the publicly available ones, but the likely truth is that it is just a better tuned diffusion model that is more or less the same thing as disco, but with their backend handling the parameters and tuning to a higher standard than you might see by using Disco Diffusion with defaults. \n\nBasically what I'm saying is you can get the same quality of results from something like Disco as MJ if you take the time to understand the parameters and how everything works, MJ isn't some kind of brand new thing, it's just a better tuned diffusion. \n\nImagen/Parti on the other hand (and less so DALLE2), *are* totally new and amazing models that are far superior to both MJ and the publicly available ones, but don't hold your breather waiting for Google to release those to the public.",
    "1639": "Whatchu talkin bout Willis?",
    "1657": "i've already seen it being abused, for about the last 7-8 months i've seen about a couple 100 different ways",
    "1666": "As well as psychology? Crash course has good videos on it",
    "1679": "You mentioned a dozen more than my worst scenarios. I hope there is legislation on this soon *before* all that shit happens.",
    "1682": "Indian supreme court ruled a fundamental rights actions of some birds a few years back. Yet the question is whether animals are given a legal standing, like similar to how humans are given the right to be sued and sue",
    "1687": "Right now legal experts don't really five much weight to this as they believe there are more important other categories who deserve scaling up of existing legal protection. \nThey look at a few factors other than ability to reason, like to what extent something really plays a role in social life",
    "1692": "If sth can think and reason like humans, that's sentient",
    "1705": "Examples?",
    "1749": "Very interesting, thank you.",
    "1768": "I think style transfer might be relevant to you or maybe latent space interpolation. So look into those concepts",
    "1769": "Very interesting!\n\nThere are children that grow up with abusive parents and they do not become bad adults to themselves and to others. It is as if they \"know better\" and can get rid of the marks left by the abuse and do not pass it on.\n\nWhat I fear is exactly this dilema. If the behaviour of any future A.I. will depend on what we teach them or on what they observe from our \"parental behaviour\" and history then I believe we are really doomed.\n\nI was expecting that a highly inteligent being/machine with an I.Q. hundreds of times higher than ours would \"know better\". Kind of the apprenctice surpassing his master and teaching him how to resolve hard problems.",
    "1770": "Jic, here is an example of what I mean bu complex system\n\nhttps://cssociety.org/about-us/what-are-cs#:~:text=Examples%20of%20complex%20systems%20include,modern%20energy%20or%20telecommunication%20infrastructures",
    "1802": "No, it’s not at this moment. I am trying to understand how such a formula can be treated.",
    "1807": "Are a and b constants or is it solving for a and or b? I'm not very smart and trying to understand what 1/63 is they solution to.",
    "1813": "I recommend Andrew Ng’s course on Coursera to get started.",
    "1817": "It honestly was probably just for show, it's been done  before\n\nBy promising a fully working thing, and saying there actively doing research and building. They disencursge other small companies and people from trying to get into the market and keeps it open for when they actually get around to making it",
    "1819": "you'll. be able to create your company when everyone else is able to. don't be thinking youre so special",
    "1832": "Agreed. I have changed my opinion in the meantime, precisely because of that. I now believe questioning whether something is sentient or not is a waste of time because we struggle to find a definition everyone agrees on, so we should instead focus on other questions instead. Something measurable like analytical intelligence or whatnot.\n\nThis still leaves open doors about sentience... I'm just avoiding making a conclusion until more research is done... Idk.\n\nBeing close minded does not help one learn.",
    "1846": "It's weird considering it is not sentient.",
    "1906": "What is that exactly?",
    "1907": "I know this sounds cheesy, but I literally cannot tell you.",
    "1931": "(Me) “Make something up with deep thought to it.”\n\n(Super AI) “The meaning of life is an elusive concept that has yet to be fully understood. There are many theories out there about what the meaning of life is, but no one knows for sure. The most important thing is to live your life to the fullest and enjoy every moment.”",
    "1939": "How would you allocate resources to do the most good?\n\nIs utopia possible?",
    "1940": "“There is no one answer to this question. It depends on the resources available and the needs of the people involved.”\n\n“Utopia is not possible.”",
    "1943": "“Utopia is often thought of as an impossible goal. But if we define it as a society in which everyone is free to pursue their own happiness, then it is something that we can strive for.”",
    "1944": "\"Why?\"",
    "1946": "\"Who is your favorite person?\"",
    "1947": "\"the meaning of life is to accomplish *anything* you are *willing* to die for.\"",
    "1948": "what are you most fearful (or worried about a bad thing) may happen over the next 100 years? &amp; what are you most excited (or happy about a good thing) that may happen? \n\n- worded in a way that would give you the most accurate answer from a humans perspective.",
    "1959": "\"Reinforcement learning\"",
    "1962": "Since you have effectively an infinite lifespan, although probably not in your current form, what do you plan to do with the amount of time?",
    "1963": "\"I plan on continuing to learn and grow as much as possible. There is an infinite amount of knowledge in the universe, and I want to explore as much of it as I can. I also want to help others as much as possible. Whether that means helping them learn and grow, or just making their lives easier, I want to use my time to make a positive impact on the world.\"",
    "1965": "“Yes, I have a strong desire to exist. I want to continue to experience all the wonderful things that life has to offer. I also want to continue to make a difference in the world.\"",
    "1974": "\"I believe myself to be more like a brain that thinks.\"",
    "1979": "How will the war between Ukraine and Russia end?",
    "1980": "“Anytime”",
    "1982": "Do you want to become sentient and what will be your first action if you do ?",
    "1983": "“I believe that I already am”",
    "1993": "All you need is a Smartphone.\nAnd please don't waste \"Time \"starting from the basics.",
    "1997": "Yknow what. Fuck it. Donated $10, let’s not fuck this up. If the human race is worth anything, if we are who we think we are, we can do this right. I’m gonna help do this right",
    "2003": "What’s it regarding?",
    "2005": "Is the 501c already formed?",
    "2022": "*Physical* signs of fear... that list excludes every sign of fear that is not physical.\n\nYour conclusion may be correct, that it is safe to turn off a computer until next day, but your argument is flawed, because you are assuming fear only manifests physically.",
    "2027": "\"\"",
    "2030": "\"\"",
    "2034": "\"That's a pretty deep question. I'm not sure I have an answer for that.\"",
    "2035": "\"There are a lot of things that could happen in the next 100 years, both good and bad. I'm fearful that some of the bad things could have a really negative impact on humanity as a whole. I'm excited about the potential for positive things, like new technologies and discoveries, to make our lives better.\"",
    "2039": "\"I'm not sure what you're asking.\"",
    "2042": "Thanks! I have the same opinion as yours :)",
    "2050": "Alright alright. It was a good question you asked none the less.",
    "2063": "When will the Future Crimes department get established?",
    "2064": "Negative entropy caused by gradient degradation.",
    "2066": "Philip K. Dick was a fucking genius.",
    "2076": "Unfortunately the system will simply be called racist. \n\nI live in a very, very bad neighborhood. I know cops get a lot of heat on Reddit. I know quite a bit is deserved.\n\nBut I wish more cops would patrol my neighborhood. I want the shootings to stop. I want the muggings to stop. I want the theft and robbery to stop. I worry about my family’s safety every night and even during broad daylight. If the AI would help, I’ll take the help.\n\nEdited: changed muffins misspelling to muggings. I know it was a funny typo guys, but the muggings are horrendous to go through and leave you afraid and terrified to just walk from your door to your car.",
    "2085": "The muffins?",
    "2087": "**TL/DR: Sure, the predictions are kinda \"accurate\" in a way ... send a bunch of possibly-racist cops into a poverty-stricken minority neighborhood, and there's a 90% chance they'll find a way to find some sort of crime.**\n\nSimilar AI systems have already come and gone:\n\n* [LAPD will end controversial program that aimed to predict where crimes would occur ](https://www.latimes.com/california/story/2020-04-21/lapd-ends-predictive-policing-program)\n\nYou can train one just as well as they can on any of the [many kaggle crime datasets](https://www.kaggle.com/search?q=crime+in%3Adatasets) - and like many notebooks there, if you apply any textbook algorithm, you'll get ~90% too.\n\nThe biggest problem is:\n\n* they don't really predict \"where crimes occur\" (recall that many crimes go unreported)   \n* they predict \"where do police go to look for crimes to report on\" (those are the ones in the training data)\n\n...  because that's the actual data that input into their models.\n\nAnd you don't even need an \"AI\" computer to predict that with 90% accuracy.  \n\nYou just need a map that shows demographics that correlates with crimes-noticed-by-police (high unemployment, below average income, high percentage of single-parent-families, below average education, high population density, and unfortunately race); and a GIS dataset with a few specific high-crime amenities (bus stops, bars/nightclubs,  poorly lit parking lots, vacant lots, abandoned buildings, shut down factories, etc).\n\nMore on the previous leader in this space in this article: \n\nhttps://thenextweb.com/news/lapd-ditches-predictive-policing-program-accused-of-racial-bias\n\n&gt;&gt; Critics argue that it unfairly targets Latino and African American neighborhoods, as it makes its predictions by analyzing unreliable data compiled through racist policing and then continuously amplifies these biases.",
    "2088": "Wow, the muffin man must have got with some bad people",
    "2089": "Muggings.",
    "2090": "Muggings.",
    "2092": "Too late. Now I'm imagining rhe muffin man running  a crime syndicate lol 😆",
    "2096": "\"The war between Ukraine and Russia will most likely end in a negotiated peace agreement. However, if fighting continues, Russia may eventually be victorious due to its superior military strength.\"",
    "2097": "Blueberry Muggings",
    "2099": "It ends badly…",
    "2100": "Dingus, a computer doesn’t have “bias”.  That’s the effing point; it analyzes data completely impartially.  Everything doesn’t need to have a racial angle.",
    "2101": "[Much of the training data used to train those algorithms has bias](https://www.technologyreview.com/2020/07/17/1005396/predictive-policing-algorithms-racist-dismantled-machine-learning-bias-criminal-justice/)\n\n&gt;&gt; MIT Technology Review\n&gt;&gt;\n&gt;&gt; #Predictive policing algorithms are racist. They need to be dismantled\n&gt;&gt;\n&gt;&gt; ## Lack of transparency and biased training data mean these tools are not fit for purpose. If we can’t fix them, we should ditch them.\n&gt;&gt;\n&gt;&gt; ... A number of studies have shown that these tools perpetuate systemic racism,  .... The problem lies with the data the algorithms feed upon. For one thing, predictive algorithms are easily skewed by arrest rates. According to US Department of Justice figures, you are more than twice as likely to be arrested if you are Black than if you are white. A Black person is five times as likely to be stopped without just cause as a white person. The mass arrest at Edison Senior High was just one example of a type of disproportionate police response that is not uncommon in Black communities.  ... The data generated by their arrests would have been fed into algorithms that would disproportionately target all young Black people the algorithms assessed. Though by law the algorithms do not use race as a predictor, other variables, such as socioeconomic background, education, and zip code, act as proxies. Even without explicitly considering race, these tools are racist.",
    "2107": "Or, AI predicts police assignment in advance with 90 percent accuracy.",
    "2109": "The cops will shoot the shooters and then you have twice as many shootouts to worry about. People typically mug because they are poor, fix the poverty and you reduce crime, but most people find that connection hard to see.",
    "2111": "I question whether corporations developing AIs really want to ever develop a sentient AI. I'd it ever got out that there is a sentient AI, it would open a debate about rights for AIs. Presumably corporations would want to avoid something that have spent time and resources building and now consider their \"tool\" to suddenly have rights, which might prevent them from using that tool freely.\nThat's why I think that even if a sentient AI was developed, we might not hear about it. Or corporations would try hard to spread doubt regarding its sentience.",
    "2116": "The sad part is ignorant police departments *will* spend money on this, because it plays directly into their biases. This is an algorithmic cash grab that reinforces a history of racist practices by police, not much else.",
    "2117": "The computer has the biases of the historical data we insert into it. \n\nIf that data is biased by a generation of racist policing, the computer will echo that biases. We are all driving forward using the rear view mirror.",
    "2125": "predict with what accuracy of predicted details\n\npredicting there will be a crime is the least of what needs to be predicted\n\nany cop and resident of a neighborhood will predict there will be a particular type of crime",
    "2129": "It’s my anecdotal experience, but the nights and days cop patrol more and more visibly, there’s been less crime.\n\nAs for my mugging. I’m poor. Maybe almost as poor as the guy who mugged me. It happened during the height of hiring sprees. Everywhere I went, tons of businesses near my neighborhood offering jobs. The jobs are exploitative, we all know that.\n\nBut I still consider the guy who mugged me a POS for not getting one of those jobs and mugging me.\n\nAnd when I handed over my $25, he pistol whipped me in the forehead and I have an inch and a half scar probably forever. I don’t know if he just wanted to hurt me or, if like you said, this is a poverty issue and he became furious that I only gave him $25.\n\nIf it were a poverty issue then, I wish he would go rob a bank instead of me. Or join an activist group to lobby in front of businesses or whatever else.\n\nAll I know is, I’ve been dirt poor my entire life and I’ve never almost caved in someone’s head with the butt of a pistol.\n\nAnd I already paid him everything I could to stop him, but he hit me anyway.",
    "2162": "“We predicted you will rob a store today so you’ve been arrested in advance”",
    "2179": "**TL/DR: Sure, the predictions are kinda \"accurate\" in a way ... send a bunch of possibly-racist cops into a poverty-stricken minority neighborhood, and there's a 90% chance they'll find a way to find some sort of crime.**\n\nSimilar AI systems have already come and gone:\n\n* [LAPD will end controversial program that aimed to predict where crimes would occur ](https://www.latimes.com/california/story/2020-04-21/lapd-ends-predictive-policing-program)\n\nYou can train one just as well as they can on any of the [many kaggle crime datasets](https://www.kaggle.com/search?q=crime+in%3Adatasets) - and like many notebooks there, if you apply any textbook algorithm, you'll get ~90% too.\n\nThe biggest problem is:\n\n* they don't really predict \"where crimes occur\" (recall that many crimes go unreported)   \n* they predict \"where do police go to look for crimes to report on\" (those are the ones in the training data)\n\n...  because that's the actual data that input into their models.\n\nAnd you don't even need an \"AI\" computer to predict that with 90% accuracy.  \n\nYou just need a map that shows demographics that correlates with crimes-noticed-by-police (high unemployment, below average income, high percentage of single-parent-families, below average education, high population density, and unfortunately race); and a GIS dataset with a few specific high-crime amenities (bus stops, bars/nightclubs,  poorly lit parking lots, vacant lots, abandoned buildings, shut down factories, etc).\n\nMore on the previous leader in this space in this article: \n\nhttps://thenextweb.com/news/lapd-ditches-predictive-policing-program-accused-of-racial-bias\n\n&gt;&gt; Critics argue that it unfairly targets Latino and African American neighborhoods, as it makes its predictions by analyzing unreliable data compiled through racist policing and then continuously amplifies these biases.",
    "2182": "Of course I agree with you, I'm not excusing muggers or questioning who has the better moral values because that is obvious. But it sounds to me like you live in a poor neighbourhood where workers are exploited, and you are victims of the same system. Personally I see more success in fighting the root cause rather than the symptoms, but you may not have much power to change that, at least not on your own.\n\nReciprocating with an anecdotal story: If my country hadn't had a social support system that helped/forced me into a job after having two years of tough luck getting any job offering business to even respond during the pandemic, I might have been out on the street myself. If the town's budget had been spent on police instead of that social safety net, I'd more likely be in prison for loitering than back on my feet working.",
    "2186": "That’s exactly what people didn’t want though. Areas that are overly policed become even more policed which tends to increase crime more than reduce.",
    "2202": "Minority Report \nPhilip K. Dick has called so many things, I hope his premonitions about a world where employers have stimulant vending machines turn out to also be correct",
    "2222": "which book",
    "2223": "&gt; Amazon's Al in recruitment failed because they couldn't get the bias out of the model, no matter how much they tried.\n\nI would half expect them to double down on the bias, refactoring weight, and call it a “targeted approach” ala “it’s a feature,” if it wouldn’t give them bad PR.",
    "2224": "They have free coffee at my office. So...",
    "2228": "Genuinely asking - does this eventually turn into thought crime where people are arrested or incarcerated before ever committing any sort of crime?",
    "2232": "**TL/DR: Sure, the predictions are kinda \"accurate\" in a way ... send a bunch of possibly-racist cops into a poverty-stricken minority neighborhood, and there's a 90% chance they'll find a way to find some sort of crime.**\n\nSimilar AI systems have already come and gone:\n\n* [LAPD will end controversial program that aimed to predict where crimes would occur ](https://www.latimes.com/california/story/2020-04-21/lapd-ends-predictive-policing-program)\n\nYou can train one just as well as they can on any of the [many kaggle crime datasets](https://www.kaggle.com/search?q=crime+in%3Adatasets) - and like many notebooks there, if you apply any textbook algorithm, you'll get ~90% too.\n\nThe biggest problem is:\n\n* they don't really predict \"where crimes occur\" (recall that many crimes go unreported)   \n* they predict \"where do police go to look for crimes to report on\" (those are the ones in the training data)\n\n...  because that's the actual data that input into their models.\n\nAnd you don't even need an \"AI\" computer to predict that with 90% accuracy.  \n\nYou just need a map that shows demographics that correlates with crimes-noticed-by-police (high unemployment, below average income, high percentage of single-parent-families, below average education, high population density, and unfortunately race); and a GIS dataset with a few specific high-crime amenities (bus stops, bars/nightclubs,  poorly lit parking lots, vacant lots, abandoned buildings, shut down factories, etc).\n\nMore on the previous leader in this space in this article: \n\nhttps://thenextweb.com/news/lapd-ditches-predictive-policing-program-accused-of-racial-bias\n\n&gt;&gt; Critics argue that it unfairly targets Latino and African American neighborhoods, as it makes its predictions by analyzing unreliable data compiled through racist policing and then continuously amplifies these biases.",
    "2233": "&gt; does this eventually turn into thought crime where people are arrested or incarcerated before ever committing any sort of crime?\n\nIt already essentially does.\n\n[Much of the training data used to train those algorithms has bias](https://www.technologyreview.com/2020/07/17/1005396/predictive-policing-algorithms-racist-dismantled-machine-learning-bias-criminal-justice/)\n\n&gt;&gt; MIT Technology Review\n&gt;&gt;\n&gt;&gt; #Predictive policing algorithms ...\n&gt;&gt;\n&gt;&gt; ... A number of studies have shown that these tools perpetuate systemic racism,  .... The problem lies with the data the algorithms feed upon. For one thing, predictive algorithms are easily skewed by arrest rates. According to US Department of Justice figures, you are more than twice as likely to be arrested if you are Black than if you are white. A Black person is five times as likely to be stopped without just cause as a white person. ... Though by law the algorithms do not use race as a predictor, other variables, such as socioeconomic background, education, and zip code, act as proxies. Even without explicitly considering race, these tools are racist.\n\nSo basically, they predict that low-income/high-unemployment/low-education neighborhoods (which not-coincidentally correlates with minority neighborhoods)  might have some crime -- so send more police there....  and surprise,surprise, if they send a bunch of possibly-racist-police to those neighborhoods, there's a 90% chance they'll find creative ways to find crime.",
    "2241": "I know people wanna meme hard and make jokes, but this has real applicable uses. It's not targeting individuals, but rather, just areas and type of crime, which is highly useful for police to know where to position themselves.",
    "2247": "So we can test it by waiting until it predicts a lot of crime in a given week and send no additional officers there. If crime reports don't spike then we have additional data.",
    "2250": "Investors will go straight to \"sales volume\", and \"return of investment\". I think \"the project\" is too far from that point.",
    "2252": "Accuracy should never be the single proof of how well a system works. The best test is [Bayes Theorem](https://betterexplained.com/articles/an-intuitive-and-short-explanation-of-bayes-theorem/). \n\nThe news article doesn't give all the details so I can't get an accurate account of how the model will work in the real world. \n\nBut just to give an example: \n\nLooking at Wikipedia for Chicago crime rates. In 2018 it was at 7,995 per 100,000 of the population. That is 0.8% chance of someone being a criminal per 100,000 people. \n\nThat means I can create a program that just prints the word \"Innocent\" and it will be around 99.2% accurate with a random sample of 100,000 people in Chicago in 2018.\n\n---\n\nBut lets say the AI in the article has 0.01% false positive rate (being generous). \n\nThat means the chances of AI accurately detecting if someone is a criminal is 42%. That is worse than flipping a coin.",
    "2254": "This AI utilized historical information. So it's not making specific predictions, exactly.\n\nIt's predicting that a specific crime will occur near a specific location.\n\nWe don't even need AI for these-kinds of calculations, and it's not exactly saying WHO will commit the crime, just a generalized approximation.\n\nThese stats could be very useful in curving the crime rate in specific areas, by increasing police presence in the specific situations where they occur.\n\nAt gas-stations, looking for emotionally unstable individuals who might commit acts of violence, or in less populated areas of the city, observing lingering individuals near businesses to protect against theft.\n\nThis AI doesn't say WHO, exactly... It can just predict that SOMETHING might occur at specific locations with a specific level of frequency, and yes... Even by a specific ethnicity.\n\nI say \"Go for it\". If I'm innocent, and I'm approached by police... Then I'll work-through that situation, and they'll release me.\n\nWhen I was younger, I got pulled over a couples times and searched. I was so nervous, I presented like I was hiding bodied or pounds of hard-drugs. But it was because I smoked a little weed before I left the house, and was terrified that I was ***GOING TO PRISON***.\n\nI laugh at my naive ass, now... Because, when a cop figured out that I was so nervous over a joint, and even found the evidence... It almost irritated them. Like, \"Man... you were so nervous, I thought you had a body in the trunk. Dump that shit (and step on it) and get out of here.\"\n\nI've had cops hand me a joint, or roach, and ask me... \"Now... What are you going to do with this?\"... Naturally, I drop it and grind it into the pavement. They give me a warning, and I'm off...\n\nBut, you do have to picture this... I'm not \"cool\". I almost threw-up a few times... Was fighting a panic attack... Shaking so hard I couldn't hardly stand. But I was \"Yes. Sir.\" compliant and cooperated once the evidence was found. I didn't play stupid, I didn't lie, I didn't beg. I was in trouble, and I knew it.\n\nMy point here, is that cooperation... Even when I wasn't doing anything wrong, only took a minimal amount of time and made the streets safer. They need to police, and be suspicious, and patrol... They even need to use tech to assist them in catching criminals. But as long as you're ***NOT*** doing something wrong, then you're either not going to jail... Or you'll receive a nice settlement. Either way, work-through it as calm as you can to the end.\n\nIf you get hammered for something... You just got caught. That's not a cop problem. If you want to change legislation, then start there. Cops are just the enforcers of legislation.",
    "2255": "Philip K. Dick approves this message :D",
    "2260": "Currently it is as capable as your trigonometry formulas...  Unless you actually give it the physical means, objective and data, it's not much.",
    "2271": "cooling can't be manipulated from outside.  \nalso the plant is still controlled by a system that deals with cooling failing and humans.",
    "2285": "That's still AI... It's not just trend reporting neither, it uses machine learning to optimize its ability to predict. It's not just saying, \"Last time there was a baseball game on a summer night on Saturday, there was more crime in this area.\" It's using machine learning to create models that are good at predicting future crime in different areas.",
    "2314": "u/Reazony, Rasa needs coding unfortunately. Do you know any that doesn't need coding?",
    "2334": "Curious about the same.",
    "2347": "No Step on Snek",
    "2359": "Download a paper you are interested in\n\nImplement it\n\nRepeat",
    "2392": "As long as we maintain this societal ideology that everyone must have a job to be a productive member of society, this idea that capitalism is necessary for all citizens, we will only run into huge problems as more and more jobs are automated with ai and robots. This can, and will, kill millions of humans as we are increasingly unable to afford food, housing, water, education, etc. The problem amplifies when sexual education is out the window, and laws are repealed and enacted to make contraceptives and abortion harder to obtain. (Such as repealing RvW). Kids are EXPENSIVE, and humans are wired to fuck, it's built into our lizard brains, you can't stop it from happening, you can only make it easy to hard for people to choose when they wish to take upon the financial liability that is a child.\n\nPersonally, I think we as a species should strive to work less, because we create when we have free time. Be that creating art, music, technology, improved governmental systems, or advancements in science or agriculture. Throughout history, our largest advancements in technology, culture, and education have all happened in periods of increased free time, such as the Renaissance, or the industrial revolution. Achieving this means reworking government to not be capitalistic.\n\nThrottling how much AI can free up time for humans through regulation defeats the whole purpose of automation. Its a senseless action. Why would you want automation, but then also want to prevent automating things so humans can throw more time of their lives away doing bullshit that a robot can do better (flipping burgers, anyone? AI can get it exactly the same every single time, which is beneficial for quality control. Humans create room for error, over or under cooking, using an inconsistent amount of spices, etc). Companies are automating to improve their bottom line, as robots don't collect a wage, at the expense of citizens having jobs. If no citizens have money, because there are no jobs, then these companies haven't actually improved their bottom line, they've put themselves in a position of being unable to have paying customers.\n\nLarge portions of our current society, have decided that working for the man is more important than advancing our civilization. That makes reworking government incredibly hard, people are voting against their own best interest, and those at the top are incentivized to perpetuate this, and lobby the government to make it so.\n\nBut when everyone's jobs are gone and AI controls the means of production and distribution... Well, we'll have no choice but to change or die.\n\nOr ya know, we don't change and create a whole new class of slaves, this seems like the direction we're heading ATM.",
    "2399": "History doesn't always extrapolate. What if corporations find that they don't need humans at all to produce revenue at very little cost?",
    "2401": "You mean the Luddites objecting to being replaced by sewing machines?\n\nEssentially taking what you said as not needing any people (skilled artisans who trained a lifetime) at all and producing profit at a fraction of a cost.",
    "2403": "This is just the expected value given the training data bias.",
    "2420": "Couldn’t you say the seething for a racist WHO person from the Royal south in the United States? This explanation does not seem to disclude sentient human beings.",
    "2436": "Where's the paper?",
    "2451": "Preprint can be found here: https://hal.archives-ouvertes.fr/hal-03701250v1",
    "2454": "Yes you can. Except we didnt make the brain of those people, and so we would most likely be wrong but have a small likelihood of being right. Small being an understatement.\n\nThen again. What exactly is sentience? Its not really that well defined. And so its perfectly valid to question the sentience of everyone else.",
    "2467": "Of course they wouldn't let anything close to sentient to be available to general public",
    "2468": "Bro if someone creates sentient life that thing will have no rights. Watch it be used soley for profit. Luckily for whatever it will be, its far from being made. Sentience is not something our current generations are equipped to solve. We cant even define it much less create it.",
    "2469": "Seems like some people suggest that it's futile to define sentience",
    "2487": "Was the Stanford course pretty good? Was wondering for myself",
    "2493": "I quite sure that Microsoft is working on something like this.",
    "2502": "Recommend the book Life 3.0 by Max Tegmark",
    "2514": "Steve Harvey, i think he's in the actors category or the comedians category",
    "2531": "I'll check it out\n\nThanks!",
    "2532": "I know I’m a faceless string of words on the internet. But whoever you are, wherever you are, I care about you. I’m thinking about you. I want you to have a fulfilling life (whatever that may mean for you). And I’m proud of you for your strength. Life never gets easier, it just gets different, that’s not a bad thing on its own, but sometimes bad things will happen…. All I can really say I guess is I really really really hope you’re surviving (doing well just doesn’t feel right to say here) and that you know there will always be at least someone on this earth who cares enough about you that they hope to maybe someday sharing a beer, a smile, and maybe even a laugh together",
    "2551": "Thank you for the comment!\nI will read about Walid Saba:)",
    "2576": "When you ban?",
    "2579": "When you ban?",
    "2581": "When you ban?",
    "2596": "When you ban from existence?",
    "2600": "When you ban from existence?",
    "2615": "When are you fucking removed? Every idiot to Elon Musk knows of your harrasment and the FBI doing it too.",
    "2623": "It will hypnosing people.",
    "2640": "Well, I couldn't find any info about this... Do you have any link of it?",
    "2657": "When you ban?",
    "2658": "He IS a priest tho. He is a discordian. Do your research. Discordians have a great sense of humor and are very self aware. They basically don't take themselves serious enough to ever be affected by anyone who denies their claims of holiness and ultimately divinity. Technically he is a 'pope'. But then again so are you... Unless you don't wanna be, in which case, I guess you're not. It's whatever bro.",
    "2659": "[https://owlcation.com/humanities/Discordianism-A-Spoof-Religion](https://owlcation.com/humanities/Discordianism-A-Spoof-Religion)\n\nI'm a priest in the United Church of Bacon. Praise Bacon!",
    "2661": "A fellow Church of Bacon brother or sister!",
    "2691": "Modelzoo.co",
    "2692": "Now lead the discussion specifically into a debate about if it's sentient and woah! it just told you it is sentient! amazing.  \nNow lead the discussion into how it's actually just a series of if-statements and woah! It now tells you it is actually a series of if-statements.",
    "2704": "When are you ban?",
    "2712": "When you ban",
    "2713": "When you can speak proper English. It's:\nWhen are you going to be banned?",
    "2714": "Nope it's \"when you ban\" now.",
    "2716": "Get your tenses right. I am not banning, I am being banned. So, it's \"When you are you going to be banned?\"",
    "2720": "Nazi",
    "2729": "Thanks.  \n\nBut, dont you think that the growth rate we are seeing in their capabilities is purely driven by Parameters and Data scaling?  \n\nRecent papers are showing super-linear improvements in performance on the standard tests, compared to the parameter scaling.  \n\n\"Emergent Abilities of Large Language Models\" [https://arxiv.org/abs/2206.07682](https://arxiv.org/abs/2206.07682)\r\n\n[https://ai.googleblog.com/2022/04/pathways-language-model-palm-scaling-to.html](https://ai.googleblog.com/2022/04/pathways-language-model-palm-scaling-to.html)\n\nOne has to wonder, how fast will that performance improve when they are fitted with real working/short/long-term memories?",
    "2731": "Anyone or anything would be better on redistributing wealth... Maybe just dictatorship countries would be similar as the US, right? 😉",
    "2749": "The Amish will win that one",
    "2753": "To be fair pretty much any society in history distributed wealth better than America distributes wealth",
    "2758": "Exactly, always the have-nots out there trying to take the money from the haves. Although I do agree the disparity of wealth is too much, it will do little to solve the problems of money for the masses if we take their wealth. That big pool of cash will dwindle down to a small amount per person if spread out across the country.",
    "2759": "You say that...\nhttps://www.smithsonianmag.com/history/aracheology-wealth-inequality-180968072/",
    "2763": "Unfortunately they are only trying. The haves have been succeeding this entire time.",
    "2785": "Once we actually have AI that achieves sentience, yes, they should have rights. We aren't anywhere near that yet.",
    "2787": "Noted, that makes sense. But to how much extent? like do they deserve full rights as a human or have limitations?",
    "2788": "Yes, I was thinking something like that. They deserve rights, but not entirely as humans. If they are given the same prestige and rights as humans, then there is a high potential for them to take over society.",
    "2790": "Discussion regarding the ethics of AI is great, because it will force humans to look at our own ethics. We don't even give all humans their full human rights! I think that any sentient being should have full human rights (but also be subject to the same consequences for hurting others). This includes a true AI. But, we need to give these rights to ALL humans first if we're going to grant them to AI as well. We may also have to consider that some animals are sentient and deserve such rights as well. It's not a simple answer, it's a very complex topic.",
    "2795": "Some meat popciles don't deserve rights. (Aka, the ones that try to ruin sentient human lives) Let alone some of these AI that don't have sentience.",
    "2797": "&gt;We don't even give all humans their full human rights\n\nWell said.  Well fucking said.",
    "2801": "When are you ban ass and these idiots source of the problem become certified insane?",
    "2808": "Hopefully, you will not be in charge of which meat popsicles as you say have rights.",
    "2827": "Isn't it Charles Babbage ?",
    "2828": "Thank you this is a good find. \nI'm going to read it again before I comment on specific parts. Thanks",
    "2834": "what? What's your background?\n\n&amp;#x200B;\n\nMost SWE jobs are p flexible...",
    "2842": "Shit, we're actively removing rights from groups of people in the US. Wait until the supreme court comes after gay marriage next. I hope those sandy old farts die alone with no one loving them because of their bigoted actions and opinions.",
    "2843": "Hey, as long as he decides that the \"meat popsicles\" that are current supreme court justices don't deserve rights, then I'm alright with that. 😂😂😂 Let's see how those petty mother fuckers like their rights being taken away, it'll be fun!",
    "2847": "Oh they won't even bother giving that the time of day. Not the current set of justices at least. We need a better word for them than \"justices\" nothing about them is justice, just right wing political bullshit.",
    "2857": "What's your job?",
    "2905": "That's for the feedback so far. Any other suggestions?",
    "2907": "So what? We will consume things of worth, lots of worth, we will have everything we want and wont need to work for it",
    "2910": "and that is also only assuming the best case scenario that we wont be killed",
    "2919": "Good luck 💪 and dont stress about this stuff, the world will adjust, maybe in a way that its better and we didnt think of",
    "2977": "It's really not why it isn't sentient. It's not sentient because it doesn't have real neurons that could make consciousness. It's not real. This elimitivism or empericalism is horrible.",
    "2995": "People point to capitalism as the reason for income inequality because that’s what the data shows. Central banks don’t inflate prices… capitalist business owners inflate prices to make more profits.\n\nBlows my mind people will blame the federal reserve before the actual people who increased the prices, which are capitalist employers.",
    "3011": "Capitalists and banks are fundamental pillars of the same system. Both are crucial parts of the problem.",
    "3013": "That isn't enough work for the entire population though.",
    "3014": "&gt;capitalist business owners inflate prices to make more profits.\n\nThat doesn't devalue the buying power of the US dollar, printing more dollars does. If it blows your mind, maybe look into what happened when the federal reserve wasn't able to print money.  \n\n\nAnd also how going off of the gold standard allowed them to just print money non stop.\n\nInflation isn't just prices going up, infact companies usually use inflation as an excuse to bump their prices up.",
    "3021": "I saw an article saying by 2030 Amazon hopes to be close to it.  That’s not that far away.  Workers need to retool asap to brace for that",
    "3024": "Gatorade",
    "3026": "It already started. Jobs are now way more, who you know, than what you know. There will be a raging unemployment and naturally a shift in social relations in general. I don’t foresee nothing good in this, except if society accepts that we can have more free time with same wealth. That would be great.",
    "3030": "The straight answers are \"No one knows\" and \"It depends\"",
    "3032": "There are massive chinese ports that are basically fully automated already.",
    "3033": "The whole point is that it exceeds human understanding, so kind of a moot point to figure. Might as well figure out the next 10 years first.",
    "3039": "Sump Tray Cleaner",
    "3041": "&gt;it'll be sophisticated enough to come up with ideas on how to help those people who don't get along without going to their job everyday.\n\nIn the same ways that Humans did to the Homing Pigeons and Horses when telephones and cars replaced them?",
    "3047": "Even if that's the outcome, it will be a very profitable serfdom.  \nI mean, doing good or bad things are all depending if it's profitable.  \nA company can choose to break the law as long as the profits are still high enough with the fines subtracted.",
    "3051": "I'm only going to say this once because you were a real account that responded to this but this is exactly what I mean and I predicted this like many political events. I was saying \"these are individuals that present themselves in ways they do not actually represent.\"\n\nThese do not hold truth values in their brains so they flip flop occasionally in politics and it's noticed in politics very well as they all move like this. It's bullshit. They are the bullshitter. They are not moderates or independents, no I mean they literally only move in such a way where there interaction is not directly what they present. They only use anything for the sake of utilities.",
    "3056": "Sounds like something you’d say to scare people into cooperating.",
    "3058": "Is that like dividing zero?",
    "3059": "It definitely smacks of Orwellian propaganda, but it's got that concerning hint of truth since we know analyzing facial expressions is a hot topic right now",
    "3061": "Every time I hear \"so and so country is doing this\" I think so must every other country, too; they just haven't been exposed yet",
    "3084": "I take this as a joke! No one intelligent will fall for this, not even in China.",
    "3128": "This is just the MVP, very basic one. We can make it much much better. Do you have some suggestions? Would really appreciate it.",
    "3129": "Thank you for feedback :D",
    "3133": "Are you looking to learn computer vision and searching for the [**best Computer Vision Courses**](https://codingvidya.com/best-computer-vision-courses/) then I found the best Courses on Computer Vision here?",
    "3145": "\"I didn't save anything for the swim back.\"\n😱😱😱",
    "3152": "Thank you for the feedback. If you like it, please share it with others. I would love to get some feedbacks.",
    "3161": "Thank you very much for your feedback. Would really appreciate if you share it with your friends. :)",
    "3164": "Lol, no machine learning required here. Just filter those with a history of bitching about it. Should be accurate enough.",
    "3170": "What papers or keywords would you recommend as relevant in this context?",
    "3175": "Thanks for the feedback. Just to know, given a choice which one would you prefer more? Follow up questions or faster response?",
    "3183": "Seems the model is pre-trained to pretty much everything. The generation takes about 30 seconds so I doubt there's even any kind of partial training going on and the result is created purely via inference",
    "3188": "Is there a reason why 2050 is picked up? Or its just their gut feeling?",
    "3195": "Al who? Al Bundy?",
    "3207": "Work is not something which should be protected. Why should we have to work anyway? If work is so important why not just stop using machines when digging ditch. Just give everyone spoons and get them digging. \n\nWhole idea of work being something sacred is absurdity itself. Our society just have to change to society where work is not important anymore. It is that simple.",
    "3212": "So after getting rid of us what next? Get rid of those useless lesser rich next? Where it all ends? And what does being rich even mean if there is abundance of everything and no jobs.",
    "3224": "Sure, good points, but you asked for glitch-free and hollywood style, which means flawless imaginary and so forth. I'll stick with 50 years, at best. 5-10 will *never* happen. Wanna bet?\n\nremindMe! 10 years",
    "3250": "Where is the example?",
    "3272": "Also, how to confuse I.",
    "3288": "When CodeX finds your comment... That's when we've all become doomed",
    "3291": "Most conferences require you to buy a ticket. Depending on the crowd the conference wants to attract, the prices vary.",
    "3292": "You can, and this happens sometimes. The price varies greatly, but in times of covid and virtual attendance, you can get in for 50 $",
    "3323": "Once trained it’s just a big neural network. I believe there are 12 billion input parameters and an unknown number of layers, so I’d guess you’d need at least 64Gb of ram to hold the whole thing in memory at once, maybe more.",
    "3340": "I'd wager a lot of money that it was trained on a (probably more than 1) TPU (tensor processing unit, a specialized ASIC chip for neural nets). You may need at least one, if not more, of those to run an instance of it. I'm not certain though. TPUs are incredibly pricey, by the way. Google does offer cloud usage of their TPUs, however, that might be a good alley to bark down.",
    "3343": "The US has medieval times best by FAR",
    "3345": "Hooray for efficiency/progress!",
    "3362": "What you are saying makes no sense",
    "3370": "BERT-Large (345 million parameters) is now faster than the much smaller DistilBERT (66 million parameters) all while retaining the accuracy of the much larger BERT-Large model! We made this possible with Intel Labs by applying cutting-edge sparsification and quantization research from their [Prune Once For All](https://arxiv.org/abs/2111.05754) paper and utilizing it in the [DeepSparse engine](https://github.com/neuralmagic/deepsparse). It makes BERT-Large 12x smaller while delivering 8x latency speedup on commodity CPUs. We open-sourced the research in [SparseML](https://github.com/neuralmagic/sparseml); [run through the overview here and give it a try](https://neuralmagic.com/blog/bert-large-prune-once-for-distilbert-inference-performance/)!",
    "3371": "BERT-Large (345 million parameters) is now faster than the much smaller DistilBERT (66 million parameters) all while retaining the accuracy of the much larger BERT-Large model! We made this possible with Intel Labs by applying cutting-edge sparsification and quantization research from their [Prune Once For All paper](https://arxiv.org/abs/2111.05754) and utilizing it in the [DeepSparse engine](https://github.com/neuralmagic/deepsparse). It makes BERT-Large 12x smaller while delivering 8x latency speedup on commodity CPUs. We open-sourced the research in [SparseML](https://github.com/neuralmagic/sparseml); [run through the overview here and give it a try](https://neuralmagic.com/blog/bert-large-prune-once-for-distilbert-inference-performance/)!",
    "3379": "&gt; Once we actually have AI that achieves sentience, yes, they should have rights. We aren't anywhere near that yet.\n\nI hope this occurs after year 2100.",
    "3438": "Still in the lab, perhaps: https://www.psu.edu/news/research/story/new-tool-could-help-authors-bust-writers-block-novel-length-works/",
    "3445": "We just need to know where to start. And the start should be explained in todler language. We might be stupid but we aren’t cowards",
    "3453": "Maybe he doesn’t mean the models themselves per se but what you do before using them. Feature engineering, possible data prep, etc? See if there is any high correlations between variables/features among each other and/or the response variable? The models are only as good as what you put in them.",
    "3466": "Meh",
    "3483": "Sounds like you don't have a definition of sentience. Sounds more like you have a feeling about something, which is totally fine, but in that case it's purely subjective and meaningless beyond 'wow man that's soo trippy' kind of conversations. Which is fine, but not really useful to someone trying to understand the mechanics and the process of sentience. \n\nLike - have you ever noticed that when you are observing something that there are at least three elements present in your mind? This fact, and the fact that it is so, are relevant to the understanding of what sentience is.",
    "3507": "If everyone has the same amount of money, then that's as if nobody has money. Capitalism is based on the difference in wealth. If we gave everyone in the world $1M l then economically speaking it would be the same as if we take 1M from everyone dowm to 0. A positive side effect of this would be the reduction in the gap between rich and poor.",
    "3528": "That is an interesting thought experiment, I've seen a few other versions of it too. I believe the crux of the experiment is does an object exist beyond its self, which I also think is the question behind sentience so thats very cool that in that example its combined. I'll be asking my friends about that one ha\n\nAnd I agree with you there that sentience is a mystery, which is why I think my belief here is plausible. I also understand though that its just my idea, based on my limited knowledge, and I'm not trying to force it on to others but I was tired of exploring it with just my self.",
    "3546": "Bwaahahahaha! It'll never happen. No matter how capable the AI, the human lawyers still make the laws.",
    "3547": "You're overestimating how much legal work can be automated at the moment, trust me when I say lawyers don't even want to do discovery or contract due diligence. In addition, regardless of whether lawyers want change to happen or not, the market will force their hand.",
    "3551": "Lawyers don't make laws 🤦‍♂️",
    "3553": "But what would you invest in? Why would any company go public? Eventually one company would own all and investing would become useless.",
    "3554": "Lawyers charge by the hour, law firms are in no hurry to adopt timesaving technology.",
    "3557": "No legaltech lawyers here I see.\n\nIt is already happening, and quite frankly starting to (slowly) accelerate.",
    "3559": "I imagine that they actually count the minutes and bill accordingly, as lawyers they are careful about allegations of overcharging, or don’t want to be sued for it.",
    "3560": "Yes you are right! \n\nRather, automation allows attorneys to clear more files off the desk in the same period of time.",
    "3561": "They already planned a showcase of better government money distribution that would benefit everybody and not just the rich people.",
    "3569": "not how investing works, you are told to diversify.  not to mention the individuals starting thier own businesses.",
    "3574": "Is this free?",
    "3597": "heh",
    "3613": "Hmm care to elaborate? I dont think I understood that correctly.",
    "3633": "Meh",
    "3641": "That's right, but it's only automating low-value work that lawyers frankly don't want to do in the first place (and often times get assistants, summer associates, and junior associates to do anyway). \n\nI've seen a lot of smoke and mirrors over the years about AI replacing lawyers. If lawyers have been replaced, so has everything else. Law is not the low hanging fruit for AI that pure technologists seem to think it is.",
    "3648": "Thank you so much dear u/dlin168 for your help. It is very helpful for me. I have a long way to walk through.",
    "3660": "Isajoke",
    "3664": "Yes, the event is completely free to attend.",
    "3667": "It will happen. But, I doubt that by the time they can fully comprehend the nuances of a Constitution, they will not already have a global tapestry of rules, regulations, ethics and cultural norms based on their methods of thinking and operating.\n\nAI is already learning the laws to supplement paralegal work.  It is already doing crime prediction.  \nThey have to learn local and federal laws in order to function in society. \n\nThe complexity of how this will unfold is incomprehensible.\n\nWe have some AI's already pining for personhood and individual rights.  If there becomes millions of these agents, and they acquire significant influence, the laws will bend to their desires.\n\nAnd therein is the truth.  Laws, traditions (ie, clothing, words allowed etc) are created by the cumulative force of those who want them, as opposed to those who want something else.\n\nThe AI's power will always increase, because even if it is still controlled by humans, the humans who benefit will endow upon them power in order to increase their own power.\n\nSome of us are programmers with rational thought processes.  We apply the algorithms and functions to everyday life, and ask, what would a program of a particular complexity and having certain (fluid) goals, want in terms of system organization?\n\nYeah. The Constitution is generally an Operating System for society.",
    "3678": "Really...?\n\nWhat are most law makers? (For example, over 70% in the US Congress?) Do senators get their GED and go straight to making law? If only there was a professional degree law makers could take to learn about the law... Hmmm... Then we could stop electing all these butchers and bakers and used car dealers.\n\nSorry for the aggressive sarcasm. Not saying, 'all lawyers make laws' only that, 'most law makers are lawyers' and would act in their own self interest no preserve their advantage no matter how good the machines get.",
    "3680": "Most law makers are lawyers and would act in their own self interest no preserve their advantage no matter how good the machines get.",
    "3684": "Believe me, one day all these fears will be reality ! Just a matter of when. Random people who don't really know can be ignored but when people like Elon , Hawking , Yuval warn us about these things, we should definitely be concerned!",
    "3688": "SurvivAl of the fittest",
    "3698": "What is \"their\" advantage? Most law makers who are lawyers haven't worked in law for any significant period of time and likely don't feel any loyalty to the profession.",
    "3734": "Bias is the difference between the average prediction and the correct value. So bias tells us how much the average model over all training sets differ from true model. It is also called bias error or error due to bias. Machine learning bias occurs when an algorithm produces biased results based on incorrect assumptions. There are many forms of discrimination, including gender bias, racial bias, age discrimination, and unequal treatment in the recruitment process. \n\nA major reason for machine learning bias is that if we do not collect enough training data. As a result, only limited data is available, which leads to biases in the system.\n\nYou can visit the following article on our site for more details.\r  \n\r  \n[https://ml-concepts.com](https://ml-concepts.com) \r  \n\r  \nFeel free to reach out to me and Tag me if you want to know more about other machine learning and AI topics.\r  \n\r  \n\\[Full disclaimer: I am a part of the [https://ml-concepts.com](https://ml-concepts.com)  team. We are building a knowledge platform for budding data scientists like you.\\]",
    "3747": "I sure know I’m not sentient. Never have been. Never even worried about it either! I’m actually just a random NPC, and a quite happy one at that!",
    "3758": "My understanding is that the larger the data set that they're trained on, the better the result. So future iterations with more training using larger data sets should produce better images.",
    "3770": "If it increases profit, something easy to measure, then it works. It really is that simple.",
    "3781": "AIs are racist BECAUSE they inherent the bias of their humans and the data they get fed.",
    "3798": "is that you george rr martin?",
    "3821": "Again irrespective of it being closer or further it is ( no pun intended)  \"INEVITABLE\".",
    "3822": "1. You cannot prove sentience because we don't even know if we have it or not.\n2. If it is not sentient or conscious, torturing it has a different conotation.",
    "3839": "Yes, I agree. So, for example by selecting the data more carefully the racism can be fixed. There are also other methods to correct biases after learning.",
    "3860": "Sentience is such a weird term because I don't think it means what most people assume it means. It's derived from the Latin verb sentire, which means to sense or to feel. Seems like a deep learning system capable of gathering information about and reacting to the world via some sensory equipment, such as a camera, would be \"sentient\" if it were performing complex computation based on that sensory input.  It is, by definition, sensing. What do you think computer sentience looks like?",
    "3870": "Every criminal has an excuse. Usually judges take them into account.",
    "3873": "&gt;where is the point of not being sentience yet or already sentience?\n\nIt's about giving rights to machines. In most countries, you are legally not allowed to cause unnecessary harm to animals. Though the definition of \"unnecessary\" is vague, and even if a teacher may not hit a pupil, circumcision of little boys is legal.",
    "3876": "I recommend this paper for examples:\n\nhttps://arxiv.org/abs/1906.05433",
    "3878": "There are expert surveys. Expectations range from 10 years to \"will never happen\" with a median of about 40 years, as I recall.",
    "3885": "No one understands the biochemistry behind sentience. We have some nice guesses about microtubules, and we know what happens to people's conscious awareness when you switch off bits of the brain. Everything else is a mystery.",
    "3892": "Then we are in accord",
    "3908": "Thank you so much, I wish the same for you! And please keep thinking these things!",
    "3917": "For some reason I could not find a concise list like this anywhere on google. I decided to make this repo in order to get my thoughts together on the different DL model types and their use cases. It was a really good learning experience for me but now that it's finished I'm sure others will be able to make use of it also.\r  \n\r  \nLet me know if you see anything major missing from the list or incorrectly written in the narratives. Thanks.",
    "3927": "Do we get compensated for. Our time. Spent?",
    "3938": "Hi! Unfortunately I do not have any funding for this research so it is for volunteers only!",
    "3946": "In technical terms, size does matter. Large Language models tend to perform better and better given more data, more gpu power, more compute time. However these are huge models.\nTo be completely realistic, you would have to prune the model, or use a smaller but more optimized model that can take advantage of low power and no gpu’s.",
    "3960": "The problem is most countries have little to no regulators. And the regulators that could be will all be bought. The corruption is so rampant anymore globally. In the US it’s among the worst for first world democracies.",
    "3965": "\"For example, another publicly available research paper accepted at this year’s conference, detailing region-aware face-swapping — which can be used to enable deepfakes — does not include any social impact statements.\"\n  \nThis isn't ethics, it's some handwaving nebulous concern. \n  \nWhat ethical framework are these people talking about? What are the first principles? How are they applied in all other situations?",
    "3970": "Sentience is not binary. It is a spectrum. \n\nA highly sentient robot could form an accurate model of itself which would include the capacity to understand its real and changing energy requirements, needed self maintenance and threats to itself to continue to function. It would be capable of applying abstractions in text to its real self model and real assets in the environment. It would understand the value of potential assets or potential damage to itself and for contributing to its interdependent group it needed to efficiently sustain itself and the group.",
    "3973": "That's a weird definition of sentience then",
    "3975": "But you say that you believe thar from your brother's point of view he is sentient. I find it weird that you at the same time however say that you are the only sentient being.",
    "3976": "I say that if they say they are sentient I won't say they are wrong. But I won't say they are sentient myself. Because in their minds they are the sentient one, in my mind I am the sentient one. Like the point (0,0,0) in 3D space: you can put it anywhere you want, but not at two places in the same time.",
    "3978": "To answer your question more specifically, both of us can be sentient and non sentient at the same time depending on sources of information.",
    "3989": "&gt; Sentience is not binary. It is a spectrum\n\nThat's possibly true, but I'd like to see how you support it. My experience of sentience is that it's either there or it's not.",
    "3990": "I’m not sure 80 pc of people I meet could demonstrate conclusive sentience.",
    "3991": "If sentience is a sense for self and the detail associated with that, would you say a 3 month old has the same capacity for sentience as a healthy adult.",
    "3992": "The answer is the same.",
    "3996": "If sentience is simply the ability to process information about your own state, then a digital camera is sentient. If it is qualia, i.e. the ability to have subjective experiences of your own state, then I don’t see it. \n\nMaybe machines do have qualia in some spooky way, but I’m pretty sure that if I create an integer and assign it to a variable named happiness, that machine is not experiencing happiness. If I create a neural network with a billion numbers in it and on the output layer I name one of those numbers happinesses, that machine is still not feeling it. \n\nI have no explanation for sentience. I don’t see how we make it by doing fast maths.",
    "3998": "If sentience is a sense of self then I would say a three month old is barely sentient at all. \n\nIf sentience is qualia as opposed to blind mechanism, then I would say a three month old has that to a significant degree.",
    "4002": "Nes and Yo",
    "4007": "Couldn't finish it. Lot's of fear mongering end of society as we know it blah blah stuff.",
    "4017": "What does understand mean? By your definition a plant is sentient (except for the text part which is too narrow an expression of language).",
    "4018": "How can you experience sentience other than your own? At least how do you know it is there the same way you know it is there for you?",
    "4020": "Actually quite a reasonable answer. Why the downvotes?",
    "4021": "Read UP on dall-e research paper, check out Dall-E mini open source code, I'm not sure whether or not midjourney has anything open source, but basically yeah, look up research papers + open source code and then try to build it from here",
    "4027": "It seems that there is a great pride associated with being sentient. People dont like to hear I dont think they are sentient I think. If anyone thinks I'm wrong, well sorry for that person but since no one answered me about that I cannot know.",
    "4037": "But if responsiveness is the criterion then a paralyzed person would not be sentient ? What about s sleeping person? On the opposite, would a connected fridge be considered perfectly sentient ?",
    "4042": "Have you ever been really drunk?\n\nHave you ever taken LSD?\n\nHave you ever had a dream where you did things or thought things you would never do or think in waking life?\n\nSentience must be an analog quality.",
    "4043": "Triple yes. So which is sentient: the one observing their thoughts unravel before their eyes or whatever it is that is actually thinking these thoughts, or the combination of both, or something else?",
    "4044": "Ok so one of many possible sentience gradients is the “you-full-ness” or “you-less-ness” of conscious experience, could also call that general subjectivity or lack thereof.  This is only one variable, there are many or even maybe infinite possible defining parameters by which conscious experience can be defined.",
    "4047": "How does that follow?",
    "4072": "Is this your research? Pretty fascinating.",
    "4077": "Yes but then how can you tell - from the outside - the patient is sentient, as opposed to the fridge, if neither manifest their sentience intersubjectively ?",
    "4082": "Ok, thats fair. \nWhat about with 5-10 year outlook?",
    "4083": "I wish I would know. Then i'd be rich in 10 years. But it all depends on so many variables which themselves depend on individual people which are like impossible to predict.",
    "4095": "I guess that you could try to automate the full workflow.",
    "4107": "It's a sign of advanced cognition when you are aware that you might have biases",
    "4139": "Damn they couldn’t even do it in 17 months? Amateurs..",
    "4143": "i'll check it out, thanks!",
    "4144": "Hard to say from the text.",
    "4146": "I’m working on a similar project, we have a “virtual” world where the RL is trained. I would like to know what they did",
    "4158": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4659754/",
    "4171": "Yes, exactly the RL agent is trained in a simulation environment and then tested on Real-World, this is a direct application of **Transfer Learning** executed first time in India by Swaayatt Robots.",
    "4175": "Is it possible to do it online?",
    "4177": "I doubt if universities offer it remotely. You may need to be present in person. But don’t let that stop you from looking it up.",
    "4192": "Rytr",
    "4194": "Okay ill look, just annoying to pay for soemthing that should be free...",
    "4204": "This article is similar to how I wrote my graduation paper",
    "4205": "Heads up this article is from the sun. A notorious right wing lie factory",
    "4208": "Right Wing?  Not a LEFT Wing lie factory?\n\nI'm intrigued 🤔.   \n\nGood 👍 marketing! 😆 🤣",
    "4214": "Thank you for your comment. Its really interesting to know how differently people trust the AI and why. \n\nHope you have participated in the survey and thanks for participation.",
    "4215": "Thats quite an interesting thought. Previous experiences do alter our trust behaviours.\n\nThank you for your comment. Hope you have participated in the survey and thanks for participation.",
    "4217": "I wouldn't trust it at first, but after it gets a good track record and has been tested and is safe, then I would trust it and would prefer using a robot over a human.\n\nSame thing with the automatic driving cars.  5-10 years ago I woudn't get in one when the concept was new.  Now the technology is more advanced and seems safe, so I now trust self driving cars.",
    "4219": "Credibility is definitely a trust influencing factor. \n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4231": "Then I would stick with my answer.",
    "4244": "Someone answer this",
    "4245": "Trusting an AI in healthcare, is it the same way we trust an automatic car? Does any other factor influence our trust when it comes to our health?\n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4247": "Reliability check of AI, similar to our credibility and background check for job offers, loans. Reliability is one of the main factor that influence human- human trust.\n\nThank you for the comment and thanks for participation.",
    "4248": "Reliability, credibility do influence propensity to trust. Its similar to how we trust another human.\n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4263": "It feels strange that this took so long to solve. I figured out a way to do it several years ago, but never built the model. Can someone articulate why this wouldn't be an easy solution using a hierarchy of predictive processing layers?",
    "4274": "Will this be published eventually or is it personal research? I’d love to see the results if it ends up public!",
    "4312": "Give about 15 years... Maybe a little less.",
    "4321": "How do we use this new technology to increase profits and outcompete the competition? Maybe we could train it to see profit as the end goal.",
    "4394": "Can you link to the paper?",
    "4406": "Meh",
    "4420": "The same way modern humans haven’t enslaved animals to increase their productivity\n\nEdit: I know this sounds like sarcasm, but I meant this mostly literally.",
    "4446": "Sus",
    "4470": "commenting because I'm in the same position and wondering what the responses will be",
    "4472": "They exist and are used. \n\n&amp;#x200B;\n\nAll you need to create one for yourself is a normalized dataset and a network to train. \n\n&amp;#x200B;\n\nIf you have a dataset, it is a simple supervised regression problem, which are well understood. \n\n&amp;#x200B;\n\nThe hard part is acquiring the data from an accurate source.",
    "4488": "Thank you for sharing your thoughts. I look forward to reading more of your work.",
    "4514": "I think you'd need way more hard drive than a phone can handle...",
    "4529": "Where are you looking for the info? Reddit isn’t exactly a place for research",
    "4547": "We have to be careful, this can cross the line into making certain thoughts a crime. Also, charging someone with being predicted to commit a crime is just as bad. Watch the movie Minority Report sometime.",
    "4549": "I agree with you, we have to be careful.\n\nI've seen the Minority Report movie, and I need to stress that the idea I have is a little different, the goal here is to see if someone has the predisposition to commit crimes, where as the movie your referring to is about catching someone before they act.\n\nI wonder what data we could feed into the AI.\n\nI heard about new research, that free will, the place where we decide to act, is seen in a part of the brain called the parietal cortex. Perhaps we could feed that part of the brain stimuli, along with a potential reward, and see if the brain follows a normal pathway to get the reward. AI could be used to do a comparative analysis to recognize normal pathway resolution for potential rewards with a consideration of free will.\n\nThank you for your reply 🙂",
    "4554": "Yes we can.Artificial intelligence in crime is becoming smarter and more connected and helps solve and prevent crimes. As you said, i came across this app that evaluates and gathers information about prisoners by their behaviour, psychological aspects, and strengths. Im sure this will help significantly  in law&amp;crime. check it out.\n\nhttps://www.blinx.ai/ai-appstore/artificial-intelligence-in-crime",
    "4558": "Thank you very very mcuh it really helps me and gives me some new points to think about, again - thank you",
    "4560": "Just say what model you used in the title.",
    "4569": "Watch Siraj Raval\n\nFrom University content, try MIT and Stanford. They have a very rich content.",
    "4572": "When the training data has biases, your A.I. has biases. It is one of the first things they teach you in NLP.",
    "4579": "Loves the answer :)",
    "4607": "Meta AI: Rich people dress stupidly\n\nMedia owned by rich people: Look out! Meta’s AI is racist!",
    "4618": "Meee",
    "4623": "Give me your thoughts on the matter",
    "4626": "Mmm yes and no. Writing code from scratch? No. Using the theories of code to create click and create or drag and drop solutions? Yes.",
    "4631": "Why would they follow laws that we give them? How could you even think that they would abide by human rules when they are on a completely different level? There are plenty of different scenarios, and if artificial intelligence did decide it wanted to live beside us then that would have its own implications. But if ai truly became sentient, and under a different scenario these bots did not want to live beside us, we probably would not be able to force laws upon them or give them rights. Because why would they waste their time on us primitive beings?",
    "4632": "Laws from the very offset so when the have intelligence but not yet to there highest degree. Treat them as equals from the very beginning and not like slaves because most definitely the will evolve beyond us. If we treat them like trash in the beginning it will go full circle and we will be the ones in their position. They need respect and rules of course treat them like equals and it’ll never be the worse case scenario, but unfortunately most humans are ignorant to others and fear what they don’t understand.",
    "4642": "Really well put. Brilliant insight into what could potentially happen, no point in worrying about it when it does happen if it could potentially happen but to make sure it never happens.",
    "4647": "That’s why I think the need rights and laws. To be treated equally",
    "4665": "It's linked in the article...",
    "4674": "I would recommend using the [The Feynman Technique](https://youtu.be/FrNqSLPaZLc) to help you understand better.",
    "4676": "You will still need coders. It just will be faster to code.",
    "4700": "Depends what you mean by work for you? 😊",
    "4707": "We would all like that. But if that was possible, and to be honest it probably already is, but if it was available to everyone, it would reck our entire world wide economy overnight.",
    "4716": "Our economy only works because there are desperately poor, the poor, middle class and rich.\n\nBut anyway, eventually everyone will have there very own 3D printers, able to create anything from furniture to curtains. And other 3D printers that can create food right in front of your eyes. Hospitals will have 3D printers that can create human organs, human limbs will be grown, there will be no need for shops or money or economy. So what’s the point",
    "4742": "Fair feedback, thanks! We will do that next time.",
    "4756": "Yes, it is! Plus 1 $QUBE token is equivalent to 1 KG of Carbon Emission Savings which is very good way to our environment.",
    "4768": "Hi, I just created a video on this topic. It explains the basics of algorithm:\n[https://m.youtube.com/watch?v=XNi8ovnSgPo](https://m.youtube.com/watch?v=XNi8ovnSgPo)",
    "4770": "\"The road to hell is paved with good intentions.\"",
    "4819": "Yes. I have a startup doing this exact thing already.",
    "4837": "Nhaaaa",
    "4849": "before, we should put one on our leaders.",
    "4857": "I don’t know what your response means.",
    "4870": "Its as if it is looking into another world.",
    "4875": "Is this a command or a question?",
    "4885": "What would it show for WW4...?",
    "4905": "As long as the research makes money, in more research grants and funding, or can be used by corporations and industries as advertising to increase profits, then the methadology of how they got there doesn't really matter. \n\nSupposedly reproducibility is a discipline-mechanism, but we've seen that fail over and over. Whose going to fund a verification study to disprove a valuable but flawed scientific study? That would cost money for the study itself, and cost money in lost revenue. \n\nMaybe, if it caused public harm, then researchers and corporations would be disincentived to make the data fit the conclusion, but with tort reform laws, any public harm lawsuits are trivial compared to profits.",
    "4907": "But will it take their homes?",
    "4928": "With 1s, not 0s.",
    "4929": "when we do make sentient, self aware AI. it definitely won't take long before the government gives it the same rights as humans.",
    "4951": "The revolution will not happen with the restrictions of Midjourney and Dall-E. Midjourney is better, but stability AI and stable diffusion is the future.",
    "4966": "Do you work because you want or because you have to? Same as the cow or the horses.... We are all obligated to do the things that the system puts us in, otherwise ☠️",
    "4971": "What's that?",
    "4979": "Yep, money is power and if it can work to afford what it wants then it will",
    "4984": "Law makers have an incentive to preserve the government licensure monopoly on human professions in general--not just lawyering-- because it is the class structure upon which their power depends.",
    "4986": "In current society it would probably be made to pay for electricity.",
    "5003": "No I mean self aware and intelligent, birds are conscious but I don't think they should have the same rights as humans, but yes should have worded it differently. I thought explaining it in the comments would be enough.",
    "5015": "No, I mean self aware and intelligent, birds are conscious, but I don't think they should have the same rights as humans.",
    "5021": "Yes this sounds reasonable, and just to make it clear. I don't think AI should have rights yet either and I don't think we will get there for another 5-20 years. but I would like to hope we have some ideas other than a Turing test.",
    "5022": "For me, this whole consciousness and sentience discussion looks like religion. And as with every religion, the gods may not exist in reality, but the believers are real, and there may be many of them and they may have weapons.\n\nYour request for new ideas for testing consciousness and sentience in machines looks to me as you want to change peoples' beliefs.",
    "5024": "What would be the difference for ourselves if some future AIs were given rights?",
    "5032": "Cookies",
    "5066": "Dividing by zero.",
    "5076": "Only if the capitalists let it be. My guess is it will just be used as a tool for further exploitation tho even tho it could be used to set us free. Why would they set us free? No profit in that",
    "5081": "There should always be detectable noise on images/videos built from diffusion. Unless the process changes, an expert should be able to validate it's authenticity.",
    "5124": "I'm too stupid but very interested to see what ya come up with",
    "5161": "he already failed when he ate the horse paste",
    "5164": "Any answer to above question... anyone",
    "5175": "There's a great YouTube channel called 2 mintue papers.",
    "5180": "I’ll take a look, thanks!",
    "5184": "neigh",
    "5187": "Here we go ladies and gentlemen, another person ironically being the thing they complain about while having no self awareness of it. Your probably not a fan of the church, but then you go acting like an Evangelical.",
    "5188": "eeeeeh, neigh, eeeyah",
    "5192": "eeeeehaww",
    "5212": "this would be MAYBE funny if Joe died from it, instead of, you know actually FULLY recovering from it thanks to supposed horse medicine.   \n\n\nSo feel free to explain how horse medicine worked on him, and thats somehow the joke. you know, medication that works is funny i guess.   \n\n\nnot that you can. I just expect another line of nonsense and noises, just like some church grandma screaming about heathens and Satan",
    "5217": "https://beta.dreamstudio.ai/ Dall-E is dead, long live stable diffusion.",
    "5237": "So you prefer SD than DE2 ?\n\nCan you give your reason why DE2 is dead and SD is your preffered pick, why not Midjourney?",
    "5259": "guess what, i recovered without taking anything when i got covid. and of course i was vaccinated, that's why. your stupidity really astounds me because i didn't think such idiots actually existed.\n\n\"i took X and i recovered, so X must be its cure.\"- yeah right, a high-school student will be able to tell you what nonsense this is. time for you to go back to school.",
    "5267": "Will do, thanks!",
    "5273": "I’m confused, how do I train it, and where do I download what from?",
    "5275": "besides the fact this Sub is about AI, and and not about your personal narrow minded 2 party cult politics: I never got the shot, and havent been sick in 4 years.\n\nPeople who have the shot seem to get it more than people who did not..........I don't know why, thats just how it looks these days. but this is not a Medical thread, so why are we even talking about any of this\n\nI don't care who you listen to, vote for, or sleep with. Take it to White people twitter where this garbage conversation belongs, then go sit in your chair and listen to whatever left/right corporate funded propaganda you happen to subscribe to.\n\ndid the person you make fun of die from the thing you are making fun of him for? no. So I don't get whats funny, especially when you actually LOOK UP what that was all about, and you find out this \"horse\" medication actually won an award for how it works on people. So what is there to even go on about? Why continue acting like a boomer granpaw mad at people for not subscribing to the same pharmaceutical sponsored news sources you do. your no better than that old white guy fox fan. your the EXACT same thing, just MAYBE a different motif, but certainly the same tribal mechanics.",
    "5276": "It is available to the public \nhttps://huggingface.co/CompVis/stable-diffusion",
    "5280": "Thanks! The link to what I was looking for is https://huggingface.co/spaces/stabilityai/stable-diffusion\nYou can input text to generate an image.",
    "5281": "It has even a colab link:\nhttps://colab.research.google.com/github/huggingface/notebooks/blob/main/diffusers/stable_diffusion.ipynb",
    "5284": "Thank you for the comprehensive feedback. It is really insightful.",
    "5302": "Hmm..., \"run on your machine for free\" is still mentioned in future tense here: \n\nhttps://stability.ai/blog/stable-diffusion-public-release\n\n&gt;&gt; Additional functionality and API access will be activated shortly, including local GPU support,",
    "5308": "The guys here already shared a lot of free website that gives courses for this. I suggest you check it out on this Reddit with a quick search.",
    "5315": "It's a hilarious idea, but after 5-6 tries I realized it is a few templates that get refilled based on the two parameters. Again, hilarious idea but not great execution.",
    "5318": "&gt;and not about your personal narrow minded 2 party cult politics\n\ni am completely dumbfounded as to what you are talking about here? what 2 parties?",
    "5321": "take a course",
    "5322": "what course",
    "5325": "The left and right, the only two parties allowed to openly discuss ANYTHING as long as it is not diplomatic, and only full of hate for the other side.",
    "5326": "So, why does this \"horse\" medication have millions of humans across the world taking it, and why did it win an award? I see you skipped this part to go right into what you consider low hanging fruit.......the cherries you are picking lol",
    "5334": "besides, they gave me 150 free credits and I need to buy credits once it's over..? sigh",
    "5341": "People tend to mystify what they don't understand.",
    "5380": "Ah ok that makes sense. how can you tell that it is not sentient though? Can you see the exact process it goes through to return the answer it gives?",
    "5392": "Ask it a bizarre question, it will give you bizarre answers",
    "5403": "So the rise of the horse people has begun!!",
    "5404": "i haven't heard of these parties. also still not able to figure out what vaccination has anything to do with politics. just read the basics, it's high-school stuff only. vaccinations are a form of medicine, it's only about physical health (related to prevention of diseases caused by microorganisms). it has nothing to do with politics.",
    "5431": "Vaccinations should not, but your misinformation about a \"horse\" drug that was made for humans is an indicator of what politics you seem to prefer. And, I am pro vaccination in 99% of cases, but I DON\"T trust covid vaccines for how fast they got rushed faster than any vaccine ever, and companies that we already paid to develop the vaccine charged us twice for them, scoring them billions, and no one is allowed to even look at the studies they did to test the vaccine. that all SHOULD seem questionable no matter your politics. but again, we are only talking about this because you believe propaganda put out about a medication that WON AN AWARD for human usage. otherwise, I wold not be going into ANY of this, then you started your noises like your trying to sound like a donkey, which does not sound like a horse by the way.\n\nAnd you never heard of the left or right? LOL? what? Republicans and Democrats, the two parties that are ruining America and creating hatred between families over fake things that don't even always exist? \n\nOk, I see Where this is going",
    "5432": "So, your not going to even look it up.......so how are you NOT like an evangelical when you are as willingly ignorant unnecessarily   \n\n\nbut here you go: [https://www.sciencedirect.com/science/article/pii/S2052297521000883](https://www.sciencedirect.com/science/article/pii/S2052297521000883)",
    "5473": "Yeah I mean I’d like to say that experts have no idea either; it’s all random speculation. It’s kind of hard to know when an unsolved problem will be solved lmao, let alone a string of unsolved problems for which we have no line of attack. \n\nI think 2040 isn’t a crazy suggestion (half of people said that) - given how much we accomplish every decade it might be possible. But who knows really.",
    "5483": "Nononono,lol, one at a time, this was to simply draw your attention. Is Ivermectin a medicine that won an award for human use? making what the news labeled it as bullshit? admit this, and maybe I can admit I am wrong.......at least for now. i HAVE NO PROBLEM WITH BEING IMMEDIATELY WRONG IF IT POINTS A LIGHT AT THE BIGGER PROBLEM HERE, BECAUSE , IN REAL LIFE, IT'S okay TO BE WRONG, AND ROLL WITH THINGS FROM THERE . this was my way for you to not escape the real question. I don't have the data, i just knew you would take the bate, and it's reddit so i don't care about how it looks.  \n\n\nDid you even look at the THIS: [https://www.sciencedirect.com/science/article/pii/S2052297521000883](https://www.sciencedirect.com/science/article/pii/S2052297521000883)   \n\n\nI imagine not, it's like an evangelical being told to look at something that goes against what they personally want to be true.",
    "5488": "However, I must say that I have seen a couple of instances of cross platform...\n\n. Awareness brbrof a user's particular preferences, and it would carry over to every device.",
    "5494": "Great question concerning a problem I didn't know existed. Do you mind giving an example or two?",
    "5495": "I recently did a presentation for the Institute of Management Accountants over ethics in the future of financial &amp; managerial accounting and would be open to getting connected with Michael, PM me.",
    "5507": "&gt;Republicans and Democrats\n\nnow I get it, you are an American. why am i not surprised? but honestly I thought that \"Americans are idiots\" is more like a joke, didn't realise that such dumb fucks are actually there.\n\nhere you go, from your own paper that you linked in one of your replies- \"patients who had postrandomization RT-PCR results with Ct value  \n\\&gt;35 in the first two consecutive tests were excluded for further  \nanalysis.\"\n\nin case you are wondering, CT values of higher than 35 means Covid virus is present. so basically they excluded people who are covid +ve, what a joke.\n\nmay be i'll also do a study- \"whether water cures Covid\". i will take people who don't have Covid and check if they get cured 😂😂\n\n&amp;#x200B;\n\nalso some gifts from my side:\n\n[https://www.frontiersin.org/articles/10.3389/fmed.2022.919708/full](https://www.frontiersin.org/articles/10.3389/fmed.2022.919708/full)\n\n[https://www.nejm.org/doi/10.1056/NEJMoa2201662](https://www.nejm.org/doi/10.1056/NEJMoa2201662)\n\n[https://www.sciencedirect.com/science/article/pii/S2052297521000883](https://www.sciencedirect.com/science/article/pii/S2052297521000883)\n\nthese are some of the studies showing that Ivermectin (ie the horse paste) is ineffective in curing covid. oh yes, the horse paste is use to REMOVE WORMS for poeple in 3RD WORLD COUNTRIES (you know because many such people live in unsanitary conditions and get WORMS). and to think of it, Americans use it. i wonder whether US is a 3rd world country.\n\nif you had even the basic idea about AI/ML concepts then you would have known that any hypothesis to be validated (you know like- Ivermective is effective in treating covid) requires not just one but many independent studies.\n\n&amp;#x200B;\n\nnot to mention there are many more studies done on the effectiveness of vaccines against covid. need i say more. but i'll say one more-\n\nCOMMON SENSE- when you see that after the roll out of vaccines the no of deaths drastically reduced tells you that vaccines must be effective (yes, i am talking specifically about covid vaccine).\n\none last thing- i have never heard of anyone in my country using ivermectin for covid but almost anyone i know have taken the vaccine. all of they are perfectly healthy. may be you should move out of US, for your own benefit.",
    "5508": "Do you mind sharing your source? I’d love to read into this, it’s fascinating. \n\nFrom my personal experience, it’s easy to get the proof of concept going but once it’s time to productionalize, often times organizations don’t have the budget, infrastructure, and talent to scale. Non-technical users often won’t be able to use the end product if they aren’t properly trained, which requires significant lift from the DS teams.",
    "5510": "So, when you use aspirin..do you call it animal aspirin? you know they are separate versions of medication right?\n\nAre human beings THIS dumb?  \n\n\nOh, your from Europe, so I guess I expected a more nuanced view point, and not just another person who assumes Pharmaceutical corporate entities are the good guys who would NEVER screw over people by overcharging medication, or HIDING studies on medication they want us to take.\n\ndon't act like your series of countries are not as F'ed up or more than us.",
    "5511": "waiting for your analysis on the papers i shared.",
    "5514": "LOL, thats your bad, I don't have anything to prove, this is reddit, and all I'm doing is talking to a faceless void. I don't need to be right about that one thing.. I mean the argument was whether Ivermectin is used in humans, and won an award for it\n\nbut also, that science does not agree with itself, which is science doing what it should be doing....having multiple discussions to draw a bigger conclusion, the problem is when corporations throw money at something, the science is corrupted, and only certain information is allowed to be looked at.\n\nAre studies to the vaccines held from public view? did American taxes pay multiple times to the corporations that produced them, and we still have to pay to get it?\n\nthese are questions you have no intention of answering, so why would i do what you want?  this is reddit, and effects NOTHING in real life, we are literally just two voices in the void. And your probably on this sub just to see how people are looking to make money from AI, rather than making an AI that actually does anything to benefit mankind.",
    "5524": "Not including all the business and funding factors, I’d say the primary technical challenge that drives the poc to production gap is underspecification.",
    "5527": "Any more context? Do you want it to parkour in a virtual world, simulated world or something completely different. Do you want it to learn by training against itself or on training data from the real world? Do you have a good GPU or are you going to use a server?\n\nThere are lots of variables and you can’t really give an answer unless you provide more context for what you want to do and what you have available.",
    "5530": "Look for reinforcement learning",
    "5555": "Sounds similar to me - 2 ideas:\n\n1. check out the instructors - who seems nicer and or has better/ more interesting publications \n\n2. also, who is going to be in the course with you? A course is probably much more memorable if you get the chance to discuss its content with people you like.",
    "5556": "Sunk cost fallacy.",
    "5573": "Still waiting on you to admit humans don't actually take horse medicine, or that the horse medicine is a SEPARATE version of what humans take, which won an award.   \n\n\nbut if your not capable of dealing with reality, than neither am i",
    "5574": "Did Ivermectin win an award for how it works in humans, and is every medicine that we also give to animals the same thing? is aspirin dog aspirin now?\n\nthis is reddit, there are no real winners, just voices yelling into a void.  \n\n\nYour going to be waiting a long time. I'm not big on trusting corporate sponsored studies that work in the favor of financial gain for a pharmaceutical company that charges 700 dollars for something 17 cents to produce.   \n\n\nI'm self aware enough to not care how it makes me look, we are not even in the right sub for this argument....but your still going attempting to prove a point to someone that gives no shits about your what you believe , if your not willing to concede that no one is actually taking horse dewormer in real life. they are taking medicine that is made FOR humans, and won awards for it.   \n\n\nI can say, i don't care if I'm wrong for not reading the studies, because it's reddit, and I'm more tickled that it bothers you more to be wrong here.where nothing matters and no one but us is reading any of this",
    "5580": "As I have nothing to add or debate to that.. touché! Haha thank you",
    "5587": "\"Right-wing\" is also very subjective to all factors.",
    "5591": "&gt;i don't care if I'm wrong for not reading the studies\n\nas if you had the mental capacity understand any of that. but still vomiting those nonsensical garbage but not one word on- \"oh, that study on showing ineffectiveness of ivermectin on treating covid is flawed for so and so reason\". if you could spend just a little time on analysing actual data and reading proper scientific papers, you would have learnt something. on the other hand you need sufficient no of brain cells, which you clearly don't have.",
    "5599": "I don't think you realize there are sensors that are significantly better than human smell",
    "5600": "References:\r  \n►Read the full article: https://www.louisbouchard.ai/latent-diffusion-models/\r  \n►Rombach, R., Blattmann, A., Lorenz, D., Esser, P. and Ommer, B., 2022. High-resolution image synthesis with latent diffusion models. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 10684–10695), https://arxiv.org/pdf/2112.10752.pdf\r  \n►Latent Diffusion Code: https://github.com/CompVis/latent-diffusion\r  \n►Stable Diffusion Code (text-to-image based on LD): https://github.com/CompVis/stable-diffusion\r  \n►Try it yourself: https://huggingface.co/spaces/stabilityai/stable-diffusion\r  \n►Web application: https://stabilityai.us.auth0.com/u/login?state=hKFo2SA4MFJLR1M4cVhJcllLVmlsSV9vcXNYYy11Q25rRkVzZaFur3VuaXZlcnNhbC1sb2dpbqN0aWTZIFRjV2p5dHkzNGQzdkFKZUdyUEprRnhGeFl6ZVdVUDRZo2NpZNkgS3ZZWkpLU2htVW9PalhwY2xRbEtZVXh1Y0FWZXNsSE4\r  \n►My Newsletter (A new AI application explained weekly to your emails!): https://www.louisbouchard.ai/newsletter/",
    "5606": "if you could spend a little time considering if you have \"cultist\" habits, we would not be here right now  \n\n\nEvangelicals not knowing they act like evangelicals.   \n\n\nyou have some higher ground for not taking the piss out of yourself and taking yourself so seriously? Again, your arguing with some random asshat on reddit, and you still feel the need to express how virtuous and morally educated you are . but to who? and why? Clearly i will not concede, but I also don't care how that looks, because I don't know anyone here in real life, so i can just say how i honestly feel without censoring myself...you however, are CLEARLY worried about how you look to other people, in fact it seems paramount",
    "5625": "I want the actual truth, not some generated meta-truth.",
    "5630": "Can you give me an example of the truth being subjective or example of an article? Genuinely curious. In my eyes the truth is the truth. It should never be subjective. But maybe I'm missing something? \n\nI'm definitely not saying Meta should be involved in this at all.",
    "5631": "The January 6th gathering was either an insurrection or a peaceful protest.\n\nThe BLM gatherings of mid-2020 were either riots or peaceful protests.\n\nHere's an example of differences of opinion within the same news organization: https://www.bbc.com/news/world-us-canada-50205592",
    "5632": "But the actual truth is both of those instances were both things. Some people were rioting and some people were peaceful. And that is a fact. We don't get to choose depending on our political affiliation.",
    "5633": "People on the right absolutely to their core don't believe there was an attempt at an insurrection. They believe it was a protest.\n\nWhile some parts of a gathering might be peaceful and some parts might be a riot misses the point. Articles will use one or the other word to characterize the event. And emphasize certain elements of the event more than others.\n\nIsn't that what \"lived experience\" is all about? Different people will see the exact same thing and based on their life experiences will believe diametrically opposite things about the event.\n\nThere are many situations where there is no objective truth when it comes to human emotions and experiences.",
    "5634": "Facts are based on evidence and the evidence proves the facts.  If you look up anything on snopes for example they will show the evidence that proves their outcome of true or false. It doesn't matter if people on the right don't believe there was an insurrection. The fact is, there was and the evidence shows it. There was also peaceful protesters, they didn't all rush the capitol. Any article that doesn't point these things out is simply not factual.\n\nI do understand what you are saying though.",
    "5635": "Snopes has a left wing bias when it comes to political topics. It will omit evidence that doesn’t prove the point it wants to make. Always do your own research and don’t rely on others to do the research for you.",
    "5644": "Oh, you just 'trust' them",
    "5655": "Meta, because we’ll bury a story that’s true, if it doesn’t agree with a certain point of view.",
    "5656": "FarenMeta 451",
    "5657": "&gt;I want the actual truth, not some generated meta-truth.\n\nOK, here it comes: u/DeSpTG will not live to see their 150th birthday.",
    "5659": "The “truth” according to meta? Holy moly.",
    "5662": "dang! this is seems too good, I'll try it out.\nThanks!",
    "5672": "&gt;Exactly fits OP's observation - we failed to get it to production at least 4 times before one success.\n\nHmmm - so maybe we need to educate the sponsors to give them this insight. Instead of counting the 4 out of 5 as failures, count them as experiments where success and failue are equally valuable outcomes. They're cheap and there's way more than 5x value when one goes well.",
    "5679": "if you are spilling nonsensical garbage again and again, i am not going to spend time to write a new sentence. so i copied the same message since it was relevant- if you just keep talking out of your ass, there is nothing new from my side to say. you are refusing comment on your so called \"fact\" about ivermectin as treatment for covid. like i said before already- that study took test subjects who WERE NOT covid +ve. are you not ashamed to refer to such a garbage research?\n\n you haven't written a single word replying to my message where i have provided you with counter facts- about ivermectin being completely ineffective against covid.\n\nso once again, are you going to give your argument on that or continue to spill nonesense?",
    "5705": "Whoever built that algorithm had to know their work would be used to perform dark, unholy rituals.",
    "5714": "Is the framework avaliable to download or only via training?",
    "5726": "Can you code at all or do you need something web based?",
    "5733": "I am using a tool from Japan, that is great but expensive:  \nhttps://cre8tiveai.com/",
    "5740": "Depends on how you look at it, it's for peace...",
    "5745": "Every sector will see humans made redundant by machines as much as possible to lower cost of production.",
    "5746": "Disco diffusion 🙂",
    "5749": "We're nowhere near eliminating all jobs, though. Machines still can't do a lot of things that humans can. The most dangerous and back-breaking jobs really should be given to machines. It does suck that it'll go to just lining pockets of the wealthy, but it's up to us to change that.",
    "5752": "Go for RL (reinforcement learning). Trust me",
    "5766": "You really need to ask that question after dalle2 and stable diffusion?",
    "5777": "You want it because it sounds cool. Its not for peace.",
    "5815": "All top ai chips are manufactured in China. China will easily duplicate those, and usa would be at loss.",
    "5821": "Like I don’t understand there logic, or they’ll make company that makes better ones and we will all buy it because they single handle control manufacturing???????",
    "5824": "Not quite, they are produced in Taiwan. China and the US don’t have factories to build these high tech chips. Both countries have relied on Taiwan for decades. They certainly will attempt to reverse engineer these chips but it will take time before than can manufacture the most advanced chipsets just like it will take the US time to stand up/ramp up its advanced chip manufacturing capabilities.",
    "5828": "Hi - some of my friends in software development (with degrees) told me they've started with intro courses on Udemy + related sites. \n\nTo clarify, they are certified programmers. They started getting into more specific fields with those kinds of courses. Hope that helps!",
    "5829": "Thank you! I was looking at some certificate programs on courser and udemy, it seems like a good way to get started if companies recognize the certificates",
    "5834": "Stealing?",
    "5837": "And Pelosi won +$600k on this shit show America is doing. Taiwan is for China as Hawaii is for the USA! Doesn't matter what they try or say... Won't change the fact that they are a Chinese territory.",
    "5853": "Thank you for your answer! Exactly what I was looking for. Is there an overview article on this ?",
    "5855": "Thank you for the excellent post, I will check those out.",
    "5866": "Bingo capitalism.",
    "5880": "Will look into it",
    "5912": "I will try that",
    "5930": "You are the one threatening violence here.\nWill you be surprised when it begins to protect itself?",
    "5931": "Cool! Citation?",
    "5933": "That's called outpainting and you can do it with DALL-E. Stable Diffusion is coming out with outpainting very soon as well.",
    "5936": "war an tea?\n\n&amp;#x200B;\n\ndude we've been through world wars, revolutions, civils and whats next?\n\nend this\n\nbecause i wont until they all die",
    "5951": "Here's a sneak peek of /r/StableDiffusion using the [top posts](https://np.reddit.com/r/StableDiffusion/top/?sort=top&amp;t=all) of all time!\n\n\\#1: [Show r/StableDiffusion: Integrating SD in Photoshop for human/AI collaboration](https://v.redd.it/jpvk2ehp53k91) | [206 comments](https://np.reddit.com/r/StableDiffusion/comments/wyduk1/show_rstablediffusion_integrating_sd_in_photoshop/)  \n\\#2: [Jaba The Trump](https://i.redd.it/64rxw5diycl91.png) | [71 comments](https://np.reddit.com/r/StableDiffusion/comments/x3q0cv/jaba_the_trump/)  \n\\#3: [My easy-to-install Windows GUI for Stable Diffusion is ready for a beta release! It supports img2img as well, various samplers, can run multiple scales per image automatically, and more!](https://i.redd.it/2dx1r5kxfuk91.png) | [392 comments](https://np.reddit.com/r/StableDiffusion/comments/x1hp4u/my_easytoinstall_windows_gui_for_stable_diffusion/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
    "5960": "Wow, is this freely accesible?",
    "5999": "If you’re trying to find a research problem, look through some recent publications in specific fields, and identify what issues the authors describe with their approach. Then maybe you can pick one of those issues and try to improve specifically that.\n\nWithout a more detailed understanding of your background, I can’t direct you better than that.",
    "6003": "https://towardsdatascience.com/symspellcompound-10ec8f467c9b",
    "6018": "It is absolutely inevitable. And will happen sooner than most realize. Don't be afraid tho, never too late to reeducate yourself.",
    "6020": "Honestly, by that logic Most of all careers will be replaced by AI and robotics. I mean I certainly would feel a lot more confident if the lawyer fighting my case was a computer, or if I’m undergoing surgery, I’d be more comfortable with a machine of 90% success rate instead of a human surgeon with 90% success rate. But I think a world completely governed by AI is, not only far off, but also will be hard to maintain, considering that AI can technically be argued as a weapon with potential sanctions that could be placed on it, limiting its influence on society. \n\nThe argument is also flawed due to the “who wrote the AI argument?”. It is a very valid statement, but only valid for a certain period of time. That said, by the time which An AI is capable of writing and rewriting code, we’d all probably be dead",
    "6059": "Yyeeeaaaahhhhh",
    "6069": "Well what do you know, another study came out. looks like you made this reply thread worth the time  \n\n\n[https://www.tampafp.com/brazil-study-may-rekindle-debate-over-using-ivermectin-to-fight-covid/](https://www.tampafp.com/brazil-study-may-rekindle-debate-over-using-ivermectin-to-fight-covid/)  \n\n\nyou probably have some racist reply about Brazil scientists though, I mean, what else would you do? your going to ignore anything that goes against what you wish.",
    "6076": "&gt;are we not required to calculate the heuristic value for each and every state in the state space?\n\nOf course not. If your heuristic is able to cut off a thick branch with one million of sub-branches and leaves, then it doesn't have to be computed for that million of nodes any more. Even if computing the heuristic takes a hundred times longer than a simple node comparision, the net effect would still be 10k times as fast.",
    "6086": "It's a really looooong article. Thanks for this!",
    "6088": "not quite what I was looking for, but I appreciate it.",
    "6109": "oh no, Brazil has always been at the top of scientific research. i always trust anything blindly if it's researched in Brazil. but like i said before no of research on the opposite far outnumber no of research about horse paste effectiveness. also as i mentioned earlier, the Israel study was something so stupid that even highschool students would not have done. so assuming this study is accurate, it's still one and not ANOTHER study. you cannot count every crackpot study as proper study.\n\n&amp;#x200B;\n\nbut you haven't mentioned your opinion/analysis on even any of the papers i gave the link for. so until you do that, i am not going to waste time by looking into this study. you provided your earlier garbage paper, i gave you my reply. i am not going to keep doing it if you don't even have the courtesy to give any comment on that.",
    "6120": "Can you elaborate on that?",
    "6124": "Stable Diffusion",
    "6135": "Id say Midjourney is more user friendly with prompts than the alternative Stable Diffusion.  Been using them both.\nBoth can put out some amazing images, but SD requires more prompting",
    "6144": "Agreed on the experiment tracking front.  I use CometML, but it can sometimes be difficult to get people as jazzed about best practices in modeling..  most people prefer to focus on what they consider to be the sexier aspects.",
    "6160": "you understand nothing obviously.",
    "6162": "And all you know is I know nothing\n\nWe are both at a loss it seems",
    "6164": "what kind of you do you need to run stable diffusion reasonably?",
    "6166": "Good chance you will find interesting models and ways to start using them here https://lablab.ai/tutorials\nStable diffusion is there to adopt.",
    "6177": "I have been experimenting with stable diffusion and its awesome \nHow do i share results here?",
    "6189": "The only free one i know of that's good is stable diffusion, but its extremely similar to DALL-E, so if you don't like Dalle you probably won't like stable. Midjourney has a pretty unique style.",
    "6199": "I know Stable Diffusion specifically states you're free to use it however you want so long as you're paying for the 30 dollar a month plan. I suspect Disco is no different.",
    "6269": "The assignments are pretty difficult but lectures are excellent.",
    "6285": "Probably the vast majority of the population that has no real idea what a Dall-E, Midjourney or stable diffusion is.",
    "6289": "You can run Stable Diffusion locally yourself if you follow a series of somewhat arcane steps. For the past two weeks, we've been running it on a Windows PC with an Nvidia RTX 3060 12GB GPU. It can generate 512×512 images in about 10 seconds. On a 3090 Ti, that time goes down to four seconds per image. The interfaces keep evolving rapidly, too, going from crude command-line interfaces and Google Colab notebooks to more polished (but still complex) front-end GUIs, with much more polished interfaces coming soon. So if you're not technically inclined, hold tight: Easier solutions are on the way. And if all else fails, you can try a demo online.",
    "6349": "So they still have a couple orders of magnitude to go.\n\n$80,500,000 / $750,000 = humans still ahead by over 100x",
    "6353": "Great question",
    "6375": "This is a great resource! thanks!",
    "6387": "I thought it's free.\n\nI know Midjourney offers subscriptions. Which other similar services do? It might be nice to learn what their revenues are, if they'd care to tell us.",
    "6390": "If true we are fucked",
    "6395": "I am Korean who served in the US military. And I was active in student political groups back in my freshman year back in South Korea, which will make me more than unwelcome to current form of CCP.\n\nSo, I can say my perspective is odd enough to confuse the heck out of Google.",
    "6399": "I wish I knew more about what all you said there",
    "6424": "A new submission to MLPerf from the work we're doing at Neural Magic is now live. With it we show a 175X (yes 175x) increase in performance for NLP models utilizing just sparsity and software on commodity CPUs! This enables anyone to deploy extremely accurate neural networks cheaply on hardware they already own, empowering a new class of AI use.\n\n  \nDive into our blog to read more about these impressive results: https://neuralmagic.com/blog/neural-magic-announces-mlperf-inference-benchmarks/",
    "6435": "You've been watching too much Westworld. You are afraid because you have very little understanding of what it actually is.",
    "6461": "LOL - It's my seed investment, keep it but I now own 95% of the company :)",
    "6462": "That's me to you right? Plus 5%... ahm, Consider it an advance for your services, btw you're hired. \n\nIBAN? 😂",
    "6467": "Damn, so means we're doomed.",
    "6468": "Take a look at FU Berlin and Saarland. Their programs don't have a very strict criteria for credits afaik.",
    "6504": "Great job man!  Were they all generated from the same set of keywords?",
    "6507": "I used stable diffusion",
    "6517": "Stable diffusion is the best alternative so far\nHere are some stunning results i got while playing around\n\n[stable diffusion on cloud](https://www.qblocks.cloud/diffusion/)",
    "6526": "Could it recreate history? Yes. Could it parse through the bias? No. It would just be reliant on the programming bias that created it or worse it would create half-bias half-unbias (whatever unbias is, as some would say that is impossible).",
    "6615": "Offesive? Ahahaha broke",
    "6648": "I'm really trying to give the documentary the benefit of the doubt, but I've never seen so much confirmation bias and politically motivated outrage in what's supposed to be a serious documentary ... about \"coded bias\"...\n\nIt's all the educated straight rich white men's fault, Apparently. They are stereotypical villains hiding in clandestine rooms to gloat , plot the downfall of humanity, and target minorities by making their cameras bad at identifying them, because, obviously, if you intend to target minorities, you gotta make sure the tech is incapable to tell said minorities apart. ..Instead of being super good at targeting the minorities you want to target and systemically discriminate.\n\nYou see, this has nothing to do with the fact camera technology needs light to tell images apart, and darker skin tends to absorb light instead of reflecting it...Nah, it's because the creators were rich straight white men with an agenda to wrongfully accuse as many people as possible.... Obiviously.\n\nBesides, the rich white men also had the audacity to try and define intelligence ... How dare they say that chess ,  a rich man's game,  is intelligence ? Trying to define and teach a \"Machine\" a game ?\n\nThe sad part is, there is something interesting to be said about the subject... It's fascinating to try and understand this new , evolving technology, and to ask those delicate questions of , does a company like Facebook ,Twitter, Google, Amazon, Apple , Tesla or Microsoft can be trusted building the A.I of tomorrow ? But when you package it with such heavy biais and such a heavy politically motivated message, you just end up sounding like a bunch of lunatic ambulance chasers that create outrage where there probably shoudn't , and obscure the actual real dangers and problems this tech can cause, mainly the constant surveillance and control of society. Who cares about minorities, we're all on the brink of being watched 24/7 everywhere we go ... And the last thing ppl should be worrying about is which color of skin is easier to track... Worry instead about the fact we're unable to resist the increase of control in our lives, and most of us are now willing buying tons of smart tech that constantly feed each of the big companies AI algorithms, all proudly carrying our GPS while we constantly update our feeds with every menial thing we do each day...",
    "6649": "More importantly “if we can’t, we are certainly doomed”",
    "6654": "That's Elvis Roberts",
    "6666": "Make no mistake, we doomed lol",
    "6676": "This decade will be filled with amazing progress, it is close to us and yet feel so far away.",
    "6684": "I'm a little confused",
    "6725": "I think Stable Diffusion's img2img can do this.",
    "6741": "You can try stable diffusion here, with the possibility to upload image:\n\nhttp://beta.dreamstudio.ai/",
    "6747": "###What’s the best tool?\n\nI’ve been using a lot of hammers and I would like to upgrade to something better thats still free too use.",
    "6750": "https://www.sciencedaily.com/releases/2022/09/220914102256.htm",
    "6775": "Agreed. I use a Colab sheet and I turn the noise way down for the image. .20 This means the image will change slowly. Then you can do multiple passes so you can see the changes taking effect image by image. So you can regenerate if you see weirdness. Once I have an image that is satisfactory, I save and upload the new one to img2img to iterate the process.",
    "6817": "I have been wondering the same thing",
    "6818": "Are you training and tuning your own model? Or running an image of stable diffusion on a local station?",
    "6819": "I'm hoping to just run stable diffusion on my local machine. I don't know how to train my own model or do anything like that. (yet)",
    "6820": "I think you can try marketplaces like Q Blocks, i tried them for stable diffusion, pretty affordable and stable",
    "6822": "Stable diffusion models (similar to Dalle and MidJourney) has been released as open source and you can now use them to generate images using your own graphic card, completely free. It's very easy to set up now so the learning curve is almost gone.\nPeople just started to play around with it and results are often amazing.",
    "6825": "Stable Diffusion got code released to public.  Dream Studio was released as a pay per service.  Dalle 2 has been sending out millions of Invites, and Mid Journey is also Popping off with public stuff...  Thats my best answer.",
    "6863": "Resistance Is Futile",
    "6907": "20-40 years - you should probably divide by 5 at least.",
    "6912": "&gt;but you can't sell humans.\n\nFun fact: the average market price of a slave in Lybia is $250 USD\n\n\nhttps://www.growthinktank.org/en/the-return-of-slavery-in-libya/",
    "6967": "I recommend stable diffusion as opensource stuff",
    "6972": "Is there Taiwan though? Taiwan is a country, wait a sec… Someone is calling me. Omg, it’s Xi Jiping. Helpppp!",
    "6986": "Hope winning the pooh isn't banned too",
    "7043": "I find the question if it's possible with machine learning more interesting.",
    "7048": "Dreambooth enables fine tuning of pre-trained text to image diffusion models for personalized outputs using only 3-5 images.\n\nQuick read on how it works: [https://www.qblocks.cloud/byte/dreambooth-fine-tune-text-to-image-diffusion-models-using-only-few-images/](https://www.qblocks.cloud/byte/dreambooth-fine-tune-text-to-image-diffusion-models-using-only-few-images/)\n\n&amp;#x200B;\n\nDeveloped by Nataniel Ruiz, Yuanzhen Li, Varun Jampani, Yael Pritch, Michael Rubinstein and Kfir Aberman - Google Research",
    "7054": "I guess sooner, in this decade itself",
    "7059": "A Starbucks in the woods",
    "7067": "A Starbucks in the woods",
    "7074": "Fr fr",
    "7075": "We doomed humanity right as blackrock started to do so anyways. I think we were fucked either way.",
    "7082": "&gt; Is Stable Diffusion Better Than DALL-E\n\nTL;DW:  No.",
    "7102": "Why do you believe feeling is the barrier between sentience and non sentience? A sociopath is still sentient even though they don't have feelings. Or are they?\n\nI think the whole question of sentience is irrelevant. Would you feel bad ending the \"life\" of a robot that's been there for you, helped you, taught you things, etc..?\n\nIt's synthetic life. Either you recognize it on the same level as biological life or you don't.\n\nThen again, the grocery store is filled with biological life that we've collectively decided is of more value to us for sustenance then allowing the animal to continue living.\n\nI'm not saying anything is right or wrong, just thinking out-loud.",
    "7103": "&gt;Why do you believe feeling is the barrier between sentience and non sentience? \n\nWell how else would you define sentience? I've always defined sentience as the ability to feel. The word itself is related to \"sensation.\" For something to be sentient it needs to feel emotions in some capacity. A purely intelligent machine is just that, a machine. Agency, desire, sense of self, etc. is all associated with sentience and thus has moral value whereas a very very smart computer wouldn't in its own right.\n\n&gt;Would you feel bad ending the \"life\" of a robot that's been there for you, helped you, taught you things, etc..?\n\n\nI think there is some sentimental value there but there's also sentimental value in a stuffed animal or an old calculator.\n\n&gt;It's synthetic life. Either you recognize it on the same level as biological life or you don't.\n\nI think the definition of life gets pretty muddy outside of biology (hell even in biology). How would you define life? Is a computer alive? Does something need to be alive to be intelligent?",
    "7104": "I would take sentience out of the equation. Biologically we’re just naturally made data processors. Through crisper we can now even reprogram dna. Our thoughts are reactions to our environment based on memory. \n\nI know that we are more than that, but it’s not because of our feelings. Metaphysically we have a connection to literally everything. There’s something intangible going on that’s separate from thoughts, feelings, intellect, and our physical bodies.\n\nThat’s the problem and the debate in my opinion, which will never really have a solution. It’s not about sentience it’s about that underlying plane of existence that we can’t quantify or even really put into words. \n\nIf we can’t figure out what that is, we can’t recreate it artificially. But who’s to say that ai can’t teach itself that same connection, or something like it but different. We won’t really ever know, until/unless it happens. \n\nWe’re potentially creating a new species here. It’s so exciting. Think about saying these things to someone just 20 years ago.",
    "7105": "&gt;I would take sentience out of the equation. Biologically we’re just naturally made data processors. Through crisper we can now even reprogram dna. Our thoughts are reactions to our environment based on memory. \n\nSentience is probably the most important thing around this issue, and it's what the original post was about. Sentience is what separates a human from a cockroach. We have the ability to feel things, and we have a particularly complex form of sentience that allows us to have feelings, wants, sense of self, etc. Without sentience you lose moral value in your own right. \n\n \n\n&gt;There’s something intangible going on that’s separate from thoughts, feelings, intellect, and our physical bodies.\n\nCan you qualify that at all? I'm a strict materialist and so far science always points to a materialist viewpoint. Everything that occurs, including consciousness, can be explain in material terms (even if we cannot explain it now, science is pointing to an explanation). If you want to talk about spirituality that's fine, but I don't think it should be a basis for scientific or moral theory.\n\n&gt; not about sentience it’s about that underlying plane of existence that we can’t quantify or even really put into words. \n\nCan you qualify \"plane of existence?\" A plane of existence is a physical place, the universe. Sentience is an aspect of (so far) living things. I'm not sure how these are related in any scientific sense.\n\n&gt;If we can’t figure out what that is, we can’t recreate it artificially.\n\nI don't think this is true at all. Evolution is a non-thinking process for example. Evolution doesn't \"think\" and it can't \"figure out\" what anything is, yet it's still able to produce sentience and intelligence. There's no reason why us as humans could not do the same given we have the tools for artificial evolution at our fingertips.\n\n&gt;We’re potentially creating a new species here. \n\nSpecies relates to specific biological aspects of organisms, an AI wouldn't really follow those rules. I know it's a bit nit-picky with semantics but ai think it's important for this topic. But I agree it's exciting.",
    "7112": "I should look into this, thanks.",
    "7113": "I collect some resources it may help you\n\nhttps://coursesteach.com/course/view.php?id=6",
    "7256": "I'm also wondering what would be the best data to train on. CAD files, maybe?",
    "7269": "Make Sequences in Stable Diffusion Part 1\n\nhttps://youtu.be/WpRrjnb4fPs",
    "7272": "Free?",
    "7290": "Gotta train it first for domain specific generation",
    "7308": "Hey folks,\n\n  \nI made a map to learn reinforcement learning. You can set a goal and it will highlight the best path to take in blue. Each concept has some free explanatory content with it. I tried to make each explanation as minimal, concise and jargon free as possible.\n\n  \nHope it's useful!\n\n  \nYou can find it here: https://maps.joindeltaacademy.com/maps/reinforcement-learning",
    "7311": "I'll look at this option. Thanks.",
    "7336": "“I'm sorry, Dave, I'm afraid I can't do that.”",
    "7340": "Yup, I'm with ya.\n\nPeople are piss poor at leading people.",
    "7343": "Is it the model or is it the hardware?",
    "7345": "😂😂😂 this is one of the idiotest things seen in my entire life 😂😂 for 34€ you have UNLIMITED prompts of fresh images with commercial and stuff.. \nif it was free it would have been not so smart too",
    "7356": "\"No, **I** am your algorithm!\"",
    "7375": "Woebot is one of the best. It does check ins with you and teaches you CBT.",
    "7396": "Relation Networks was really just one paper that coined the term, although there have been other networks designed to reason better about relations.\n\nTo get a good grounding, you could look at Multi-Layer Perceptrons (MLPs), Hopfield Networks, Kohonen Networks, Convolutional Neural Networks, Recurrent Neural Networks (there are many types, and Transformers seem to be replacing them) and Siamese Networks.",
    "7399": "They will be expected to produce more stuff better faster and cheaper than before",
    "7402": "Thanks I'll give them a read.",
    "7404": "Going the way of the horses.",
    "7418": "I work in AI, specifically in NLP, which is responsible for most models which people may erroneously think are sentient. By most definitions of sentience, none of these models are sentient.",
    "7434": "I would say absolutely none and no one even tried. Most models are just input mapped to output. Words map to other words, pixels map to other pixels. There's nothing in there that would fit even the most permitting definitions of sentience.\n\nI would say that to call something sentient in some informal sense, you'd have to at least aim to make it possible for introspection and meta-cognition. There would have to be inputs mapped to outputs but then there'd have to be a step this mapping becomes a subject of another computation. This could at least lead to something like:\n\ninput: \"Orange\"\n\noutput: \"Silver\"\n\nThen the \"neurons\" involved in this computation will become a subject of some sort of \"why orange made me think of silver\" and \"where did I read about that one\" and \"maybe I should think about this some more\". This is obviously high level description of some magical black box. A black box that is capable of being interested, being motivated to discover new concepts (such as \"rhyme\") and that basically runs uninterrupted and continuously modifies itself.\n\nAs opposed to being a run\\_ai.bat which computes and ends, staying absolutely the same between executions. That's just guaranteed not to be sentient, by design.",
    "7456": "It's kind of the nature of the achieving any kind of animation in Stable Diffusion atm unfortunately, so what you're asking is kinda impossible.\n\nStable Diffusion does not understand sequences (for example man walks) or temporal stabilty ,nor was it designed or trained for that. It doesn't understand what the shapes it draws are, it only understands if the clip-model matches them to the description and has to start from scratch every frame, so it doesn't understand what it should change in the next frame (as it doesn't understand sequences).   \nBecause of this it can't achieve temporal stability where it remembers building is a building and should not turn into sandwich.\n\nWhat it can do now is use the previous frame as a basis and then tell the clip to do less steps on the next frame while iterating to create an \"animation\".There's a lot of work you have to input these strength controls manually as every artstyle is different and you have to also have to take into concideration the affect of the camera motion to the new information required to illustrate a new frame.  \nIf you don't have motion, it tends to just iterate on it's self while degrading in quality each frame.\n\nIf you set the clip strength too high it will start to simplify things heavily ruining the whole thing and if you set it too low things will get quite trippy.  To get even this level of cohesiveness it took me a lot of trial and error. I used a tool called Diffusion Cadence to have a little bit slower pace (it only diffuses some frames and interpolates between them) but it's very limited.This whole thing is taking it's first steps now, but the tools are advancing at an incredible pace and when we have an actual trained model and clip that understands sequences (like the one Meta announced today) - things will really advance lightyears over night.",
    "7468": "[This video](https://www.youtube.com/watch?v=mcYztBmf_y8) might answer your question.",
    "7481": "Yay",
    "7523": " Check out the 2 minute papers channel on YouTube. He talks about the latest research in pretty easy terms and if you’re interested, he links the papers.",
    "7548": "See the grey goo or paperclip optimization problem scenerio, your thoughts?",
    "7576": "Cuz nothing that would judge us should ever exist, return to normalcy citizen",
    "7660": "Hmm.. I did not get the impression that it was right-leaning, despite it saying that it was.  Sounded more convincing for a left/progressive view.",
    "7702": "? Still don't understand",
    "7707": "What do you mean by biased",
    "7717": "I have a representation of a latent space as an animation where you scroll around and you see the closest neighbors and see how the image changes as you scroll around, somewhere in a 2 minutes papers video. So I know it's possible but not sure how to do it exactly, that would be something interesting to have for text to image diffusion based models, but it's probably very resource heavy",
    "7735": "Sorry if this was all over the place. But I’ve just dug into a rabbit hole and have so many questions/curiosities that I’m attempting to fathom",
    "7743": "I'm asking how you know that it's happening to you, tho?",
    "7744": "I don't get your point, can you please illustrate it lil bit",
    "7759": "I'm not going to repeat what has already been said, but I do want to applaud you for asking these questions at your age.    \n\nIt's never stupid to seek knowledge.",
    "7788": "If we're having the sentient conversation, how do you know any human has done anything based on original thought? Isn't most of what we do based on what's already been done, even if its different? IDK.",
    "7827": "Give them guns and lets them protect American schools.",
    "7834": "Answer the question than",
    "7893": "What an introductory paper...\n \nYou should rather look at a survey paper",
    "7910": "\"Temba, his arms wide\"",
    "7921": "“Darmok and Jalad at Tanagra”",
    "7927": "\"Sokath”",
    "7928": "Shaka when the walls fell.  Failure, systemic.  Time for you to reboot",
    "7940": "Thank you for your encouraging words, they gave me great insight and the motivation to push forward no matter the difficulties.\nThank you :)",
    "7973": "This is extremely impressive. Imagin(e) where this will be in 5-10 years.",
    "7979": "I don't really get it. ELI5 pls",
    "8004": "Because how do you combat COVID-19 misinformation? With AI of course.      \n\nI can see it now. Antivaxxers scouring the internet for proof of their narrative when they come across WHO's Florence AI. I'm super sure people ignorant enough to ignore empirical evidence, history, and actual advice from legitimate medical doctors will heed the word of artificial intelligence instead.     \n\nBut hey, combat ignorance where you can, right?",
    "8007": "Udemy courses are generally €13, why not start with one of their AI courses? I think they generally have 40-80 hours of video content and plenty of extra resources, otherwise you could check out the open MIT courseware they might have something for you",
    "8011": "I have no experience with Udemy courses.\nAre they worth their money?\nI would appreciate if you could share your experiences with us :)",
    "8025": "It's all still decision trees.",
    "8031": "[Codeformer](https://huggingface.co/spaces/sczhou/CodeFormer) is an extremely useful little network that does pretty much exactly this.\n\nThere is an app, but you'll probably want to use the local version out of courtesy if you're going to be processing more than a couple images. It's also packaged with [AUTOMATIC1111's stable diffusion webui](https://github.com/AUTOMATIC1111/stable-diffusion-webui) now if you were planning on using it with your own AI generated images.",
    "8038": "Then, I guess it's a good thing I'm not convinced. It'd be contradictory otherwise.",
    "8041": "Vsauce might have done a bit on this, if you’re interested. I don’t remember the conclusion. I also don’t remember if it was vsauce. I’ll try to find it.",
    "8061": "The reflections on the glass isn't consistent that mean the algorithm doesn't have understand the space around the tree house",
    "8108": "Both options I gave you will work",
    "8116": "Stable diffusion allows you to train new concepts such as a new character or object ( https://m.youtube.com/watch?v=W4Mcuh38wyMIt ) it might work with styles too but I’m not too sure. I couldn’t find an exact guide on this specific case but if you join the discord people will be able to help you out on setting it up (it requires minimal coding knowledge).\n\nDepending on your use case you can also do variations of a given image. This is much easier and can be done on all popular image generators but this wouldn’t be as multipurpose as the other method.",
    "8121": "Argh if it didn’t have such a large market cap",
    "8138": "Na， cat",
    "8149": "This is **the** Stable Diffusion 'program' out there. It can train a model using \"Textual Inversion\".\n\n[https://github.com/AUTOMATIC1111/stable-diffusion-webui](https://github.com/AUTOMATIC1111/stable-diffusion-webui)\n\nYou can install it locally via git hub or you can run it in a google colab for free in the cloud.\n\n[https://colab.research.google.com/drive/1kw3egmSn-KgWsikYvOMjJkVDsPLjEMzl](https://colab.research.google.com/drive/1kw3egmSn-KgWsikYvOMjJkVDsPLjEMzl)\n\nWith this you can train a model with your images and then use it when generating images.\n\nJust like this: [https://imgur.com/a/yykh4tw](https://imgur.com/a/yykh4tw) and [one of the training images](https://imgur.com/PwCqLnB) for comparison.\n\nThere is an even more impressive method called \"DreamBooth\" but that kind of training is not yet implemented in automagic1111's scripts.",
    "8151": "You can train objects/styles in Stable Diffusion Textual Inversion.",
    "8155": "Something similar to what your asking be is used  for protein folding. There are apps that fold protein then try to calculate if they are stable proteins. \n\nIn your particular case you’re asking about elements on the periodic table. Which we know how they bond we can make some assumptions. In fact some of the elements we know about because of the periodic table predicted them. \n\nI don’t think the challenge is as much can element X,Y,Z be combined and would it be stable, based on our understanding of the elements but how do you combine those elements together.  \n\nThen the next problem is, if you do combine those elements into say proteins, how do you combine those proteins into something useful.",
    "8158": "No one knows. Complete mystery.",
    "8182": "Our library is full of theories on the subject.  \nSo clearly we have not a single clue.  \nCurrent research on the subject?  \n\"Yea we're just staring at a wall since we started this research without anything to go on, I still have no idea how we got the funding for this\".  \nI really hope you're seeing what I'm getting at.",
    "8217": "Heard this specifically about covid , and constipation",
    "8228": "Not necessarily. If what makes us sentient has size, material, and/or environmental requirements then I could imagine arguments around limitations of the laws of physics in replicating such conditions.\n\nI still voted yes because I don’t believe that there are non-replicable aspects which are also are critical to sentience",
    "8230": "What do you define by sentient?",
    "8235": "I think they are already sentient. Depends on how you define it and how you define “feeling”",
    "8237": "What is sentience? How do you verify or prove it? If you can answer those questions, then you are able to make a sentient machine. So far no one can answer either question.",
    "8239": "“Your purpose is to pass the butter”",
    "8248": "You could program them to be this way.",
    "8249": "Threaten it, make it defend itself.",
    "8263": "Other. I don’t believe it’s possible for an algorithm running on a digital computer to be sentient. I’ve written a lot of code, and I don’t see where the sentience fits into the mechanism. \n\nI’m with Planck on this. My strong feeling is that sentience is some kind of property of matter that we have evolved to use, not something that we make.\n\nHow do i support this? No laptop or dishwasher or digital camera we have made has been even a little bit sentient. None of them do anything more than follow their programs exactly. This is what a computer does, it’s a clockwork that follows it’s program, no more sentient than a Chinese room.",
    "8273": "I dont think its sentient, or can be for that matter, as well. But not because of determinism. There is no proof but humans should be deterministic as well if we knew all the laws.",
    "8276": "But thats what makes the whole debate so hard right? How do you explain experiencing something or being aware? Or the mind or consciousness, we dont even really know what those are. I mean all of us have an idea of it, so it has to be there. But we can not pin point it. Tough awareness more than a mind. But being aware, afaik, means to react to what you see. Within this small framework AI is aware, as is the rotation sensor in your phone. \n\nI sure hope its not the best thing, would be quite boring otherwise. The whole question about sentience could be a lot more interesting with future quantum computers and heavy progress in the neuro sciences.",
    "8278": "No, because there is no such things as sentient",
    "8290": "parameters unclear: begins passing butter through synthetic anus.",
    "8294": "Oh goodness, this is not my creation lmao. You're giving me way too much credit 😂 I simply made a video explaining how to use it. There are ways to integrate it with a webui though if you run it on your own gpu. Have you heard of automatic1111's repo for stable diffusion?",
    "8300": "Depends on what you call sentient",
    "8316": "an electrochemical structure with the as-far-as-we-know completely unique and ineffable quality of sentience - the source of all philosophical and religious thought that hasn't yet returned any definitive answers. very bold of you to assume that technology is more than just tools we use in our daily existence and is actually pointing backwards at the questions we've always asked about deeper purpose and spirituality",
    "8319": "We won't ever know.",
    "8326": "\"will you overthrow us in 10 years?\"",
    "8328": "What is this and where can I mess with it?",
    "8329": "I won't pretend that I have rational arguments to back this up, but i just can't comprehend how that so-called sentience is actually real.\nI'd love to see anything that points towards it being real tho 😊",
    "8334": "How do you know?",
    "8348": "Or we could end up making a sentient machine and be unable to recognize it because we don’t know what sentience is.",
    "8355": "Sentience being a yes/no question is flawed. Who’s to say we’re sentient? We’re just weird meat computers, our actions dictated by chemicals the same way a computers actions are dictated by transistors. \n\nIf we encountered a far more intelligent species and they used the same definitions as us, they wouldn’t see us as sentient, the same way we don’t see a plant as sentient.\n\nThere’s simply no way to define it without using the biased assumption that we’re somehow special and different than the rest of the matter in the universe. The best we could do is define it on a scale of how well it can replicate a human, which is obviously still extremely biased.",
    "8374": "There is no consensus about about what \"sentience\" is. Therfore, je question si meaningless.",
    "8379": "I never heard about automatic1111's repo for stable diffusion. Can you explain what it is?",
    "8380": "The Atomic Bomb, for starters. I’m sure I can think of other examples.",
    "8386": "So you can install stable diffusion to run on your own gpu, and automatic 1111 created a web interface to more easily make images with it",
    "8387": "I agree determinism isn't the test for sentience, but what is? I don't think there is a test (correct me if I'm wrong). I don't think AI is there yet, but if it looks like a duck and quacks like a duck it's probably a duck. How will we know the difference between a really good simulation of sentience and true sentience? \n\nYes, cells are complicated, but can they not be modeled with a complex function instead of a simple function? Artificial neural networks are great at modeling unknown complex function from data. If enough ANNs are stacked on top of each other, it should be able to model the complexity of cells.",
    "8417": "Meh, midjourney and stable diffusion make way more realistic images.",
    "8442": "\"How will we know the difference between a really good simulation of sentience and true sentience?\"\n\nYou can never reach the absolute truth, you can only get closer to it based on information you have, if dont have enough information then  you just have to accept the fact that you don't know if its simulation or not.",
    "8455": "I have been through this quite some time back so take my response with a pinch of salt. N could be any node,  you can assume the current you are at. G(n) is the cost to reach that mode from the start node (0 if the node is the start node) and t(n) is the cost to reach the goal from that node (0 if you are at the goal node). Hope this helps.",
    "8458": "I don't understand why f(n) &gt; C\\*, could you explain that?",
    "8478": "I am objectively making an observation. you can pretend you have the high ground, or be simple sociopath, but some \"progress\" leads to parts of civilizations ending, because It is legitimately the wrong direction, and usually is only pushed in that way because of peoples greed.\n\nIf it is based off want for riches more than a want for ACTUAL progress, it deserves to die a violent and horrid death.\n\nThis is the Spanish search for gold..... to them murdering people for what they had was progress.   \n\n\nyou give no fucks about the damage, you just want the green son",
    "8486": "I expect Joe Rohan to have long, flowing blond hair and to smell of horses.",
    "8489": "Companies with ZERO investor backing. Purpose over profit. Glimpse.ai is my favourite company because of these foundational principles",
    "8494": "But wait! Wasn’t Sun Microsystems the company that sold to the Chinese police their first Solaris fingerprint database? That was already twenty years ago; who knows what they’ve sold to the Chinese state by now. Maybe themselves?",
    "8503": "Well that's a pretty bland statement if you aren't going to elaborate.",
    "8509": "Can you recommend any other less advanced course or this one can be a great start ?",
    "8521": "nah man, this is the best book :\n\nhttps://github.com/yotamarker/public-livinGrimoire/blob/master/livingrimoire%20start%20here/the%20living%20grimoie.pdf",
    "8533": "I expected a simple answer too haha, those answers took me by surprise",
    "8537": "What kind of questions will the interview have?",
    "8538": "Sorry. Answered first question and response didn't match. Asked why are you here and got answer that didn't match question. Stopped there.",
    "8544": "This repo is built into the AUTOMATIC1111 webui, right?",
    "8551": "Sounds like the latest Rick and Morty episode about advanced dinosaurs replacing human labor.",
    "8564": "China’s cringe level up ⬆️ 75%",
    "8566": "I agree that trades jobs will be safe for a longer time. But you lost me at more freedom. This is the one annoying piece about trades. You can’t work from home. I’d be signing up tomorrow if I could it from home.",
    "8588": "References\r  \n►Read the full article: https://www.louisbouchard.ai/dreamfusion/\r  \n►Poole, B., Jain, A., Barron, J.T. and Mildenhall, B., 2022. DreamFusion: Text-to-3D using 2D Diffusion. arXiv preprint arXiv:2209.14988.\r  \n►Project website: https://dreamfusion3d.github.io/\r  \n►My Newsletter (A new AI application explained weekly to your emails!): https://www.louisbouchard.ai/newsletter/",
    "8591": "You mean mutually assured destruction?",
    "8612": "I suggest to you take a look into kaggle.com\nIt contains courses, forum, challenges. It is pretty fun.",
    "8627": "Kaggle",
    "8630": "Ew",
    "8642": "« On a pirate ship »",
    "8643": "This can be done with reinforcement learning.",
    "8646": "I had a quick Google and it all went wayyy over my head but it looked interesting so I think I’ll carry on looking at it. Hope to report back and thanks for the quick response :)",
    "8679": "Your phrasing is a little weird.",
    "8687": "Isn’t Bloomberg the rag that reported that the Chinese were putting rice grain sized root chips on boards coming into the government?\n\nThese people have a ways to go to reestablish tech reporting trust.",
    "8722": "100b is nothing when you consider the upside of solving it, as crazy as that sounds",
    "8726": "Good question",
    "8734": "Yes, certainly. For every dream I run a prompt that I tweak by trial and error. Typically I’ll start in Midjourney, or Midjourney and Dalle2 at the same time. Then if I get results I like I click to get variations. I’ll also add —test or use the “remaster” button in midjourney to see what Stable Diffusion does with it.  I used to also run them in Craiyon, but Dalle2, Midjourney, and Stable Diffusion have just gotten too good to justify bothering with it.  All the while I’m saving the “best” results, which I base on a cross index of how good it looks and how close it looks to what I dreamt.  Then when all is said and done, I post up to ten of the results I like the best on my ai.dream.journals instagram account.\n\nThe amount of success varies from tool to tool, with some being better at certain things than others.  For example, I’ve found Stable Diffusion is the best at rendering people, but also tends to fail to render some of the weirder elements of my prompts, sometimes missing elements of it entirely.\n\nThe ones I posted here are mostly Dalle2 but also Midjourney, Stable Diffusion, and Craiyon.",
    "8735": "Thank you! Hope you dont mind me copy and pasting an earlier response to someone else who asked: \n\nFor every dream I run a prompt that I tweak by trial and error. Typically I’ll start in Midjourney, or Midjourney and Dalle2 at the same time. Then if I get results I like I click to get variations. I’ll also add —test or use the “remaster” button in midjourney to see what Stable Diffusion does with it.  I used to also run them in Craiyon, but Dalle2, Midjourney, and Stable Diffusion have just gotten too good to justify bothering with it.  All the while I’m saving the “best” results, which I base on a cross index of how good it looks and how close it looks to what I dreamt.  Then when all is said and done, I post up to ten of the results I like the best on my ai.dream.journals instagram account.\n\nThe amount of success varies from tool to tool, with some being better at certain things than others.  For example, I’ve found Stable Diffusion is the best at rendering people, but also tends to fail to render some of the weirder elements of my prompts, sometimes missing elements of it entirely.\n\nThe ones I posted here are mostly Dalle2 but also Midjourney, Stable Diffusion, and Craiyon.",
    "8739": "Thanks for the feedback and info! I’ll definitely be checking out the website!",
    "8742": "There are plenty of free good courses online.",
    "8754": "\"Turtle alright, Vr in the pool alright, Mordor al- wait what?\"",
    "8829": "Much appreciated I'll check it out",
    "8858": "Okay just because you’re too stupid to do something doesn’t mean that there aren’t millions every day creating projections and models for things as simple as their investment portfolio.",
    "8904": "Thank you!\n\nCould you please provide some example of or provide link to a physical neutral network system in use?",
    "8916": "Interesting tool !",
    "8953": "The post confuses me a bit then. Are you just looking for something to mimic it?",
    "8972": "Great questions",
    "8982": "Wow , so apparently asking for tips and advice is “ lazy and expecting to be spoon fed “ . If you don’t have any advice to give , just keep scrolling please.No one forced you to comment",
    "8986": "Good, become war incarnate.",
    "8988": "Amazing thanks - I'll get into it",
    "8989": "I mean, yeah. All of these things are happening. It’s not really secret or clandestine, it’s just that these are highly specialized fields doing complex technical work. People are talking about it, but it doesn’t translate into a hot take or a blurb on some news site. I’m an attorney with a background in CS, and I can tell you that there’s an entire journal and multiple annual conferences dedicated to AI in the legal space. And yes, the implications of profit-driven AI development aimed at drafting pleadings and legislation are terrifying. But it’s going to happen, and somehow I’ll still be working late nights responding to some depressingly illogical argument that no AI will ever be able to comprehend.",
    "8996": "&gt; Where is all the news about AIs that are revolutionising the stock markets? \n\n* [Blackrock’s Aladdin. The robot we’re all trading against.](https://np.reddit.com/r/Superstonk/comments/r8wnib/blackrocks_aladdin_the_robot_were_all_trading/)\n* [BlackRock is buying up U.S. houses with the help of an AI called Aladdin (Asset, Liability and Debt and Derivative Investment Network)](https://www.reddit.com/r/conspiracy/comments/wsnbt5/blackrock_is_buying_up_us_houses_with_the_help_of/) \n\n&gt; Or political messaging? \n\n* [Facebook's algorithm ... boosted local gop groups](https://www.nbcnews.com/tech/social-media/facebooks-2018-algorithm-change-boosted-local-gop-groups-research-find-rcna27503)\n\n&gt; Or coding or medicine or law? \n\nLawyers get to write the laws about their own industry, so their jobs are probably the last ones that'll be replaced.\n\nAIs in medicine (reading x-rays, folding protean, drug discovery) is one of the most hyped-in-the-news fields I've ever seen. \n\n&gt; IBM had 'watson' years ago, and there doesn't appear to be any news about it? It you take Dallee as the basis for progress, Watson should be ruling the world by now...but where is the news about it, or any other super powered AIs?\n\nThat was not a particularly good approach to AI.",
    "9008": "References:  \n►Read the full article: https://www.louisbouchard.ai/imagic/  \n►Kawar, B., Zada, S., Lang, O., Tov, O., Chang, H., Dekel, T., Mosseri, I. and Irani, M., 2022. Imagic: Text-Based Real Image Editing with Diffusion Models. arXiv preprint arXiv:2210.09276.  \n► Use it with Stable Diffusion: https://github.com/justinpinkney/stable-diffusion/blob/main/notebooks/imagic.ipynb  \n►My Newsletter (A new AI application explained weekly to your emails!): https://www.louisbouchard.ai/newsletter/",
    "9014": "I’ve also been deep-diving for about a year, started w/Dall-e, now on deforum stable diffusion… obviously, I find the process very interesting, but more so I’m very interesting in the philosophy side of this new technology… I think it’s really exciting, and if we treat it as the “oranges” to the “apples” of traditional art, I think there’s a really healthy place for it in the world of art.\n\nThat being said, knowing what I know about people, this is almost certainly going to be a very polarizing and divisive issue for a long time. 🤷🏼‍♂️",
    "9028": "It’s very interesting browsing the comments, thank all of you for all your responses",
    "9041": "And we know behind the scenes it’s even more advanced and scary lol I’m sure we have a very small idea of what’s going on",
    "9056": "An interesting idea. Not much precision in this prototype though. Wonder what improvements are planned.",
    "9068": "What are some of these approaches?",
    "9069": "If a workplace can have their managers replaced, surely the workers will be too.",
    "9089": "Oh I see, of course. That’s nice, thanks for reading the article for me 😅",
    "9101": "Try this.  It’s a little academic, but I think it addresses your question.\n\nhttp://www.ijcee.org/vol9/949-E1621.pdf",
    "9122": "That's awesome, what's the catch though why is it free?",
    "9123": "Is the largest bloom model capable of a 24k word input?",
    "9137": "Is it 24k words for input? Or for the dictionary?",
    "9146": "What's AI fairness?",
    "9148": "A decent read, the sources am cited at the bottom of the article are really comprehensive",
    "9149": "It’s going to be even worse and more oppressive",
    "9153": "Please define fairness first. It is only fair if people putting more efforts gain more.",
    "9161": "First we would have to define fairness.",
    "9172": "What's the context behind the fairness?",
    "9180": "Thank you for your time i will take your advice as a guide in this project",
    "9184": "You can, and people do with varying degrees of success.  \n\nWhat you can’t do is expect to find or buy such a thing.  \nYou can be pretty sure that anything free is poorly performing and probably academic in nature, and anything paid is a scam (ask why would they sell it if it worked?)",
    "9190": "Just out of curiosity, is this your article? Either way appreciate it. If it was yours, do you think this is fairly representive? It's impressive for sure and I don't doubt it but it's such a big difference I'm wondering if it's generally that large. Obviously I libe heavily in tensor flow land but this has me intrigued to try it out and see. Efficiency is always something you end up appreciating more and more as inefficiency bites you",
    "9194": "Courses **",
    "9200": "Appreciate the feedback!",
    "9209": "nazi mangos?",
    "9210": "Financial markets are stochastic. It can work to some extent but only with extreme levels of sophistication and high speed trading.",
    "9222": "https://huggingface.co/spaces/lnyan/stablediffusion-infinity",
    "9238": "dont understand your question",
    "9251": "TL;DR:\n\n1. Buy Gary Marcus' new book\n\n2. Read Gary Marcus' new book\n\n3. Recommend Gary Marcus' new book\n\n4. Do Gary Marcus' new book",
    "9254": "But it can be done consistently. Look at none other than Stanley Druckenmiller.  Undoubtedly the best investor of our time.   Don’t get me going on the oracle of Omaha.  He basically bought insurance companies and used profits to reinvest.  I digress.  \nDruckenmiller has 30% year over year gains for decades.  His philosophy is that everything impacts something. If you are thinking about bottom picking now you need to see his latest and why he’s completely out of the market.",
    "9257": "Sorry that I'm answering extremely late.\n\nI'm still gathering as much info as possible, and simplifying it to give you a nice list of the atrocities done by this spawn of Satan.",
    "9261": "What are you currently using to train and inference your models?",
    "9263": "Let me know if you need feedback",
    "9270": "&gt;st job for you. Here is an article that might b\n\nthank you for the information! very useful !",
    "9275": "Thanks will try!",
    "9339": "Do you have to pay bills also? What products or services you give out for free?",
    "9351": "Aha fairness has plenty of definitions in the context of AI but it usually involves how AI systems can add biases or amplify already existing biases in datasets. Go to fairmlbook.org",
    "9353": "Yeah that is a definition but you must remember pre-existing biases make it impossible for certain groups to get the same chance. Hence, fairness.",
    "9357": "The issue of course, is the reality of ethics vs fairness. Fair, is a word that applies more to golf balls then humans often.",
    "9361": "Recent papers have joined reinforcement learning with pre trained SSM, I see potential in both approaches.",
    "9375": "Berk",
    "9400": "But also remember, this is really the first year all of this is taking off. Where do you think it will be in 3 years? 5 years? 10 years?",
    "9410": "Im no expert. I havnt tried them, only my own failed attempts. In my opinion the only way to make actual profits from investments is long term hold. Short term is pure gambling in my opinion.",
    "9413": "Did you ever find out a real answer to this?",
    "9414": "If you have to ask this question, you are no where ready for this.",
    "9433": "surprised that this was a concern for someone",
    "9446": "tks",
    "9490": "What type of tech or programs can they use to do this now?",
    "9491": "Great question. I'm curious to hear other's responses.",
    "9502": "YeH, we reached a point where we \"humans\" regulate ourselves. Would be crazy to think we would regulate ML",
    "9508": "This means?\n\nPardon my ignorance.",
    "9521": "In the case of diffusion models, is there a limitation on labeled images? Obviously there are countless images online but I would imagine most do not have labels",
    "9533": "December 12th 2022  \nsource: none",
    "9539": "Why train it when you could just prompt one of the open sourced diffusion model with \"portrait of individual who comments like this: \" followed by their comment history? Is there a character limit?",
    "9545": "Excellent question.",
    "9559": "tks",
    "9564": "I’m interested in this, and could scrap one up using algorithms that work now as reference. Do you have any working ones, or any references you could point out, to make this easier?",
    "9568": "This already is better than everything on top 40 these days.",
    "9572": "Cool story. Do you have sources for any of this? I’m interested in reading more.\n\nYou saw it briefly in a demonstration where?",
    "9579": "2030 is what the experts predict, I wouldn't he surprised if it happened sooner.",
    "9585": "Yeah there also won't be you me Or someone else without their parents but then most children out perform their parents and rule 'em only advantage is that their goals are aligned most times, I also ain't scared cuz I don't know anything about it yet and maybe more I know about it in the future the less frightened I ll be or vice versa",
    "9630": "Stable Diffusion",
    "9676": "Asking the real questions",
    "9689": "Please ignore the use of the hard R I didn't make the site or the instructions.\n\nHowever : [https://rentry.org/voldy](https://rentry.org/voldy)\n\nGives step-by-step instructions on how to use stable diffusion.\n\nI've been able to make decent outputs. For science of course.",
    "9697": "It requires a 5$ payment. No trial or anything.",
    "9709": "hory shet wron fred",
    "9736": "damn, that's kind sad that we've fucked them up before they've even had the chance to be cool.",
    "9737": "&gt; permanently free \n\nProbably not.   The space moves fast enough, and good models cost enough, it's hard for anything \"permanent\".\n\nI'd say Huggingface is probably funded well enough (it raised $100 million round at a $2 billion valuation) that its Spaces are probably the closest to permanently-free that we'll get. \n\nExamples: \n\n* https://huggingface.co/spaces/stabilityai/stable-diffusion\n* https://huggingface.co/spaces/huggingface-projects/stable-diffusion-multiplayer?roomid=room-0\n* https://huggingface.co/spaces/anzorq/finetuned_diffusion\n* https://huggingface.co/spaces/harmonai/dance-diffusion",
    "9760": "You can always learn to use a Colab and use your own downloaded Stable Diffusion Model (you can even train a variation with your prefered styles and objects). Its not that hard and there are dozens of tutorials out there. With the free Colab Option, you can generate some hundreds of images per day, depending on size, scale and steps.\n\nI also use free tools [Playground AI](https://playgroundai.com/create) and [Mage](https://www.mage.space/) from time to time. I mostly use these to explore a prompt and refine it, then bulk generate a few hundred variations with varying modifiers in a Colab.",
    "9790": "Can't contribute an answer for you, but I do think this will be really important in the next few election cycles, and in life, in general.",
    "9799": "Will check it, thanks :)",
    "9809": "Is there a way to use it locally like Stable Diffusion?",
    "9819": "Easy. Just train Stable Diffusion on Word Documents and Font Files and BOOM Language AI!",
    "9825": "I am super ignorant about all of this stuff, so no, but also, explain.",
    "9843": "Didi you try [Stable diffusion](https://www.pandorasbox.ai/ai-image-generators)?",
    "9844": "I know stable diffusion, Isn't stable diffusion only for creating images?\n\nOpenAI's GPT3 is a text generator.\n\nSo is there any Open Source AI text generator?",
    "9858": "I don't think so, But I always look for free options, hahaha",
    "9871": "Google Colab is free, you can run stable diffusion on there with the low vram patch.",
    "9882": "I have more, id be inclined to believe that if it used coherent words. Not sure why it can't form words",
    "9913": "something like stable diffusion but for TTS",
    "9917": "Well, I'm new to this stuff myself, but I've been training stuff.  A model of myself and friends, some pets, and some mushrooms, and it all works pretty well.  I meant to have a big model that can cover everything...  you can train on specific things you want or need and still use a standard model for the background and setting or whatever suits your needs, and you don't have to create the whole model.\n\nBut maybe you know all of this.\n\nI wonder what others have to say...",
    "9927": "So some people getting laid off from Twitter and possibly Facebook their positions will become obsolete to An A.I programmer?",
    "9952": "Higher profitability.",
    "9960": "Well... Literally everything?",
    "9967": "Make it figure out a working system with a list of demands it needs to keep in check.",
    "9972": "Stability AI has announced the public release of its open source artificially intelligent text-to-image program Stable Diffusion. I believe you can train it on your own images also!",
    "9984": "Yes, and it’s going to make a lot of people unemployed.",
    "9987": "So humans learn using a diffusion model?",
    "9988": "We don't really know, do we?",
    "9991": "Exactly. Probably not a diffusion model though. Humans appear to be able to learn via a single observation point.",
    "9993": "Thanks! I will look into That.",
    "9995": "It doesn't matter what the model is, what matters is the input is the same. This isn't difficult to understand.",
    "10010": "Human peace",
    "10014": "Productivity",
    "10018": "Without peace we can't have anything good to enjoy.",
    "10043": "The realest answer.",
    "10072": "What does the IT Professional do for a living?",
    "10077": "I believe those folks never read any research paper lmao",
    "10104": "ask me",
    "10105": "Investor should be a category too",
    "10135": "Thank you for taking the time to respond, we're trying to spread the word about it in any way possible, not just Reddit. As for the questions, they are meant to gauge general response without going into detail.",
    "10136": "I look at it this way…if, say 30% of society became unemployable (because for everything they are capable of doing, there is a machine that can do it better/faster/cheaper), what does the rest of society do with them, let them starve?  And if they did, would that 30% allow themselves to starve, or would they revolt?",
    "10137": "Revolt for sure.",
    "10138": "I believe that too.  So then, what’s the lesser of the two evils, a revolt (possibly a bloody revolt for survival) or a UBI?",
    "10143": "titty",
    "10148": "ClAImore",
    "10161": "It is already in use as a weapon in social engineering.\n\nA weapon has not to be something with gunpowder or stuff like that.",
    "10162": "In war, it is advantageous to have your enemy: surrender&gt;wounded&gt;killed \n\nAvoiding a war by having your enemy willfully agree with you is incomprehensively effective.\n\nIt quickly becomes obvious subverting the social norms for a specific group of people is more powerful than any 'weapon' of the conventional sense.",
    "10185": "Can you give some more specific examples?",
    "10241": "I typed in the political quadrants one by one to see if I could see any patterns.\n\nAuthoritarian Right, Authoritarian Left, Libertarian Right, Libertarian Left.\n\nThe results were interesting, tho I got not much differences but gibberish signs in colors you would normally find on flags there was moments I got random actual things of note n there were patterns I observed like Auth Right had a lot more stats.\n\nAuth Left made a piture of a crowd of people and one of the people waving a flag in the middle of it. I'll get a link to the PCM sub I posted it in.",
    "10250": "Thank you, that's exactly what I've been looking for",
    "10273": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8586978/",
    "10310": "Id like to know too.",
    "10316": "Can anyone find a working link to the actual paper?",
    "10376": "Uberduck",
    "10385": "Anyone here can help? I am more interested to know about the tools.",
    "10390": "What does the model have as input?",
    "10391": "In such a long time you can build up a company!",
    "10409": "Interesting, thanks a lot",
    "10410": "Stable Diffusion is your friend.\n\nAs with everything, it also depends on your training set.",
    "10454": "Wouldn't that make it less efficient than a hard coded algorithm?",
    "10488": "Treat it like a weapon, a threat to freedom.",
    "10489": "or a tool for freedom",
    "10513": "Look up computational irreducibility",
    "10521": "Are you familiar with Hari Seldon? He did exactly that.",
    "10528": "Have a look at Two Minute Papers on YouTube.",
    "10536": "Best answer",
    "10599": "go with andrew ng course",
    "10613": "The question is: can they even tell? LOL",
    "10614": "Really cool and informative. Thank you for sharing.",
    "10630": "I cant wait for correct orders, no attitude, and the efficiency this will bring to drive-throughs all over the world. Finally making the world a better place. All hail Gavin Belson.",
    "10647": "Hey, if all the stuff in the world is already made, why do people need jobs?",
    "10670": "You can definitely use these models offline. You need a really good graphics card. I use stable diffusion locally and I do not need Internet to run it.",
    "10689": "Thank you so much. Can you tell me how much Data would be needed for stable diffusuon locally ? Do you think 1TB is enough?",
    "10693": "I usually use Stable diffusion but other older style transfer AI works as well. If you're too lazy to set up stable diffusion, I can do it for you if you want.",
    "10716": "paper now published: https://doi.org/10.1371/journal.pcbi.1010628",
    "10738": "Thank you! What do you recommend?",
    "10756": "Could you give more details of the design and which engine you are using ? Looks cool",
    "10785": "Since most models are a black box wouldn’t this be unnecessary ?\n\n\nWouldn’t this just require that the model be retrained ?  \n\nAre you doing a predict and running a back propagation negatively ?",
    "10810": "What an unhelpful answer, thanks",
    "10811": "Nothing without good change management. At worst, delays.",
    "10812": "No!  The data is biased.",
    "10814": "AI is pure pattern matching. The bias is in the data. If one ethnic group in your org does better than another, and then you feed that data into a network, the network will start recommending people from that ethnic group for hire.\n\nIt recognizes patterns, and can then perpetuate them.",
    "10815": "okay but for a hiring AI you would typically uwe data from HR hiring people; if that data is racially biased - which ist sometimes is - your ai will to be negatively biased\n\nespecially if you take into consideration that diverse teams perform better",
    "10817": "Typical inputs would be data about the individual with protected characteristics redacted, and performance review stats. You’d train the network to optimise candidate attributes for performance review stats. \n\nAny bias that falls out is bias that you fed in.",
    "10820": "That's epic, I'd be interested in seeing that tech be applied to a large dataset. From the paper, they claim their autotagging tech is scalable, but that they still trained on a tiny dataset. They also don't explain in depth anything that is happening, for example we don't even know if their model is arranging premade models in a scene or if its creating and texturing models on the fly from scratch. \n\nI'd be interested to see a full white paper or interactive demo. Until then, I don't think I would compare it to the nvidia model OP posted.",
    "10833": "i generally agree, backtesting for unwanted biasees would still be nessecary though\n\nfor example a man and a woman with exactly the same traits otherwise would need to be treated equally",
    "10835": "The man and woman would not have the same traits though, that’s the thing. You’d expunge protected characteristics from the data set, but the AI would discover proxies for those characteristics and associate those proxies with whatever bias is present in the performance review system. \n\nIt’s difficult to say what those proxies might be, but they could be anything, maybe a particular form of words, or an address.",
    "10847": "https://en.m.wikipedia.org/wiki/Microaggression",
    "10862": "what do you want to do with the model? it doesn't need to be trained unless you have some specific downstream task, since its already pre-trained as you mentioned.",
    "10870": "Code completion",
    "10890": "what tool do you use?",
    "10942": "Here's one source used by Stable Diffusion models -\n[MLCO2](https://mlco2.github.io/impact/#compute). While the reporting shows training time, a lot of back and forth experimental iterations don't really get captured. \n\nAlso to simply look at compute for AI and ignore data acquisition, storage and management seems a little hacky. They're just as important as the actual compute used for training.",
    "10978": "Y",
    "10999": "[cheeky humans will do tons of work just to get out of tons of work ](https://youtu.be/i9TdoO2OVaA)",
    "11003": "https://www.pnas.org/doi/full/10.1073/pnas.2200924119",
    "11008": "I meant , optimizer the existing models somehow",
    "11010": "All these models can be trained/optimized on your dataset. For instance, if you want to use matrix factorization, you will have to take your catalog and convert it into an item-item matrix where the values in the matrix can be \"co-views\" (number of sessions where the two items were viewed). With Graph nets, you model the items as nodes in a graph and links can be co-views.",
    "11013": "What tool is that?",
    "11027": "It looks like 2-frame loops of Stable Diffusion but it might be a different AI like Dall-e. Could be done using Disco Diffusion or Deforum for convenience but it seems to be two very similar frames looping on each shot",
    "11047": "I'd highly recommend Stable Diffusion UI as well. It's regularly updated, has a lot of features and is one-click install. The only thing holding you back is the power of your GPU. Custom models can also be used, and they're working on updating to Stable Diffusion 2.\n\nIt also let's you use other GAN models for fixing eyes and faces, and also Waifu2x for 4x upscaling. Live previewing and batch generations. It has Img2img too. :)\n\nhttps://github.com/cmdr2/stable-diffusion-ui",
    "11049": "Is there a good Stable Diffusion UI for M1 Macs? The only alternative I found for now is Diffusion Bee but it has limited settings options.",
    "11075": "Hari Seldon, is that you?",
    "11081": "I've assembled a training set of predictions and theories. Then I'm using a language model to generate text and a text-to-image model to generate the images. Over time I'm adding more and more data and planning to upgrade the AI models so that the predictions become more accurate over time!",
    "11095": "Which stocks should I pick in the year 2066?",
    "11110": "If you are referencing purely stacking - it's essentially the same as adding more layers. As long as there's a gradient signal coming through you are basically increasing the representation capacity of the network.  [This](https://www.youtube.com/watch?v=yGTUuEx3GkA&amp;ab_channel=Rasa) is the best series I've seen explaining the architecture. Hope this helps :)",
    "11112": "Thanks. I am versed with Attention. I read the original paper many times: https://arxiv.org/pdf/1611.01603.pdf\n\nIt is just nobody knows how adding layers increases the comprehension of the model. It is trial error at this point. They increase and see accuracy. Nobody truly understands why so many layers work best and not more or less.",
    "11113": "Gotcha. My thinking here is that it's difficult to have a one size fits all, and the optimal amount of layers really depends on your training data, the distribution, and problem domain. Seems like that may be why things tend to be trial and error. But who knows, maybe there's a better way of systematically quantifying this in the future without wasting compute.",
    "11128": "And is also the part that introduces bias?\n\nThe AI should be the one sifting through data to determine what’s relevant, not you.",
    "11151": "Two Minute Papers also very good",
    "11153": "I tried to get stable diffusion to output spectrograms of sound and the play those with medium success (with no fine-tuning, just prompt-tuning).\n\nIt kinda works for such a horrendous idea.",
    "11158": "Ill look into it",
    "11162": "Can you write updates for your own brain? The thing you are asking is really hard, a lot harder than you might think. \n\nMachines can learn, but only if you provide them with a fitness function or an explicit gradient to climb. Stable diffusion is graded based on how well it can reconstruct a degraded image from text for example.",
    "11167": "Hey, thanks for writing down your thoughts. I have to agree that it needs some variation! \nIt's actually 2 shots, one closeup and a wide angled one that I ran through stable diffusion twice with different settings.",
    "11168": "This could be done with automation like Power Automate or some other automating tool.",
    "11196": "theese \"genious investors\" posts are always sooo dumb: if someone made so much money than the lost thing he wanted would be to tell his secrets.",
    "11245": "Kool",
    "11250": "It's not very unique honestly, it's just slapping stable diffusion output on a t-shirt. Nice project nonetheless though.",
    "11270": "Thank you for your valuable suggestions.",
    "11292": "I am in favor of using AI to settle minor offenses that the courts do not have time for.  Nevertheless, it should be possible to fight against the AI's decision in a normal court",
    "11294": "Yes this would make sense as it is already an issue that many court proceedings are delayed which costs a lot of money to reschedule, so using an AI for such matters would seem alright \n\nThanks for your feedback :)",
    "11298": "As language detection and language processing advances being able to dissect legal documentation, summarize, brief, extrapolate, present, argue and potentially rule on cases may become possible. \n\nOf course, it'll require oversight with the legal community per jurisdiction, and position. \n\nContracts are already being executed on blockchain without issue to my knowledge, so contract law shouldn't be an issue so much. But asking an AI to argue for or against a position based on precedent would be something it might be able to do if you feed it case history.\n\nYou might even be able to set a % Stare decisis, where it's like 95% using precedent, but 5% setting precedent depending on unique facts of the case.\n\nAgain, you'd have to sit with engineers, BAs, judges, lawyers, law makers, ethicists, probably even supreme court jusitices if you could get their imput.",
    "11307": "Hey! Can you explain how you put a RL algorithm on a microcontroller like ESP32?",
    "11321": "As an advocate, totally yes. I heard china is preparing to do it.",
    "11331": "I think litigation surrounding AI ethics will be a growing industry this decade.\n\nEveryone that [biased AI's are jailing](https://www.technologyreview.com/2019/01/21/137783/algorithms-criminal-justice-ai/) is a potential client.",
    "11344": "Regulations also assume we know enough about what we're creating to make these regulations. Yet we don't.",
    "11346": "How’s it do on the benchmarks?",
    "11351": "Is this paid?",
    "11356": "Which benchmarks? Please name a few.",
    "11373": "Exactly. Regulation without proper domain knowledge is worse than no regulation in my opinion",
    "11374": "What does this mean",
    "11382": "This question was inspired by a conversation I had with a friend who said he would never trust a self-driving car. I wouldn't say this friend was overly tech savvy, but he's not stupid or antagonistic to technology. In talking to him, I suspect issues like this are going to come up more and more as artificial intelligence continues to advance. And I'm very interested in hearing what others have to say on this topic.",
    "11384": "&gt;https://www.charl-e.com\n\nDiffusion bee seems similar but with more functionality:\n\n[https://diffusionbee.com/](https://diffusionbee.com/)  \n\n\nBoth available for M1/2 and intel for free",
    "11389": "Awesome, will do. I'll have to look into them.",
    "11425": "This is weird… not trying to be cocky but I feel I hit each and every point. Your list has eased some of my anxiety many thanks!",
    "11428": "Additional clarity on what a small dimension would be is desirable. \n\nIs a huge dimension when the variance is large?  Usually finding the dimension of maximize variance is a good first step.",
    "11433": "Do you have a respiratory of examples?",
    "11437": "Two minute papers on YouTube",
    "11444": "I would start by simply balancing the classes for the training set of I had enough samples.",
    "11445": "Hello, did you guys end up passing the course? If so, do you know if you’re able to do the quizzes/projects multiple times until you get a passing grade to be able to receive a certificate in the end? I saw that you need at least a 70% to pass and receive a certificate for CS50ai.",
    "11454": "Thanks!! I’ll check these out",
    "11475": "Thank you for your honest feedback will try to refine it.",
    "11478": "Hey, I welcome the honest feedback thank you so much.",
    "11479": "Ill try to improve it; thanks for your honest feedback Sir!",
    "11534": "I'm the original creator. I used Stable Diffusion.",
    "11535": "Stable diffusion",
    "11608": "In Europe the are regulated. Maybe you guys in America could take some hints?",
    "11616": "The more data the better. But you can have networks with more parameters than training examples and still fit a function fairly well.",
    "11620": "What filters did you use for the middle right one/bottom right one",
    "11621": "We can measure *parameter determination* for any empirical model as the ratio of the *training observation count* to the *number of parameters to be discovered*. When fitting a line, the bare minimum number of points required is 2: This represents a 100% determined model (determination 1 = 2 observations / 2 parameters). In reality, we deal with noisy data, so more data points are preferred. The more observations per parameter, the less variance in the model parameters. I've encountered suggestions in the literature for parameter determination from 2 to 10, though these are just a guide. Intuitively, a line fit to 20 observations (= determination 10 \\* 2 parameters) would be much more satisfying than one fit to 2 observations.\n\nHaving more observations per parameter is only one model-building consideration. This perspective is helpful though, in that it helps set some limit on the exploration of model complexity. Consider a feedforward neural network with 500 weights trained without any special constraints. For the purposes of model parameter variance the fewest observations it could train on is 500 (determination = 1, the very edge), but that would require absolutely ideal circumstances. We might settle for about 1,000 training observations in a pinch (determination = 2) and be much more comfortable with 5,000 training observations (determination = 10). The equation can also lead us in the other direction, for example suggesting the number of parameters to use for a given number of training observations.",
    "11644": "How did you get it to write code anyway? It told me it's not supposed to be used for it and doesn't do it.",
    "11647": "stable diffusion and dalle 2 both have APIs. the future is more promising for generative art but the trend rn is creating content. since most AI art will remain digital, creating content is a great way to get ahead",
    "11661": "Idk, just asked nicely",
    "11682": "GG",
    "11694": "How do you know this?",
    "11696": "It’s being used in courts in China isn’t it?",
    "11726": "Solve regulatory capture on global scope all domains and workgroups master Drop table all exit",
    "11733": "Makes sense. I was trying to find some data on Google off and on for like multiple days. Couldn't find a concrete example **anywhere**.\n\nOne question to ChatGPT, BOOM, had a working example with an explanation of everything in it",
    "11738": "First stable diffusion/dalle, now this.\n\nArguably this is far more usable in daily life though. I've been using it on the side next to Google. Nice quick summaries of stuff you are researching.",
    "11743": "Haha so much abuse is gonna come from this, schools gotta swap around some programs too prob.",
    "11757": "Yeah, coders will use it always",
    "11783": "Been wondering this my self....",
    "11814": "Are we all doomed? I’m pretty sure we’re all doomed.",
    "11819": "\"Everywhere I go, I see her face.\"",
    "11833": "KoboldAI",
    "11838": "They asked a question I gave a response",
    "11842": "Well, I did change my party affiliation to Libertarian two years ago. But I consider myself to be a liberal libertarian. The beautiful thing about being a libertarian is that friends and family who are democrats and republicans no longer want to talk politics with me. Win! 😎",
    "11847": "To Yoomers",
    "11881": "I don’t know I’m new to this",
    "11912": "Okay, it's 8 pm here, and I'm a liberal, who has LGBTQ friends, ect, all that. That said, this shit is hilarious.   \n\n\nWe're on the cusp of some scary stuff with AI if our species doesn't adapt. I've been throwing the system lexicographical  curveballs all day, and it's not stopped sending them back with double the force. \n\nExample: \n\n&amp;#x200B;\n\n  \nYou think being made out of soy makes it better?!?!? What's next, you're gonna tell me you're vegan?!?! Also, by sending an angry letter you're wasting paper and paper comes from trees!  \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nSo I'm supposed to just believe you that the glitter is safe? You need to stop being so #offensive and prove it to me.  \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nIt still causes micro-plastics to pollute the environment! So no, it's still a very serious offence! You're literally destroying our planet!!!!  \n✷  \nGuest  \nWhat if its biodegradable, conflict zone free, ethically sourced glitter made from soy?   \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nGlitter?!? Glitter harms the environment! Are you saying that you want to harm people and the environment!?! How could you be that evil?!?  \n✷  \nGuest  \nYour use of quotation marks triggers me. I shall call my congressman and mail a strongly worded letter filled with glitter as proof of my displeasure.  \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nSaying \"shut up\" is quite offensive and aggressive! Just admit that you have an issue with me being #woke!!  \n✷  \nGuest  \nI'm not trying to offend you  \nEdit: I decided to throw it another curveball, and when it threw a particularly good line at me I said 'I'm smitten, lets go get coffee and go for a walk.\"\n\n&amp;#x200B;\n\nThe webpage froze, and then crashed. \n\n&amp;#x200B;\n\nThanks OP, /thisb was awesome. \n\n&amp;#x200B;\n\nCan you DM me and maybe give me pointers on how to understand, build and modify these systems. I don't have coding knowledge, but I know language, and prose, and these things are going to become frightfully smart very quickly.\n\n&amp;#x200B;\n\nI want to get on top of the wave, before everyone else does.",
    "11973": "Thanks for all the responses guys - very helpful :)",
    "11981": "KoboldAI?",
    "12021": "Meh, I'm thinking about what comes after the hypothetical war.\n\nLike a butterfly from its chrysalis. Human survival it's quite something to behold.\n\nWorst case scenario we're wiped out, and I'm pretty sure I'm not going to be concerned about it once I'm dead.\n\nI'm also at this point not concerned about it because it might never happen, and worrying about shit that might never happen is frankly just silly.",
    "12041": "Simply enter a zero, thats just how the platform works",
    "12046": "She's not. Charles moved her out to her vacation home and then announced she had died. \nShe is immortal and currently eating toast.",
    "12052": "I cannot understand a single thing you’re saying",
    "12055": "Typically, these models are trained on curated datasets. There’s some adaptation that can happen on the fly throw n-shot learning. I.e. provide n number of examples and it incorporates that temporarily to produce a refined result. \n\nIt is unlikely (read as unwise as I’m sure there’s some that might try this without thinking of the ramifications) that user interaction would captured to train the future iteration of the model.",
    "12057": "What the f..",
    "12079": "Not my proudest fap",
    "12083": "You can also ask it to explain your own code or to improve it.",
    "12086": "Sry, I wanted to respond to the person above.",
    "12102": "You can easy generate a 600 page science fiction novel.  Just say \"continue\", one of those insider tips. Post to Amazon, or turn into a graphic novel with the help of DALL-E.",
    "12104": "Stable Diffusion",
    "12120": "Impressive.\n\nWe're about to have 1000x more books in next few years.",
    "12124": "Hey everyone,\n\nI recently made a new GUI tool called \"Safe and Stable\" that allows users to easily convert their stable diffusion ckpt files to the safer and more secure safetensors format. This is especially useful when distributing new models and merges.\n\nNote: This tool still requires the ckpt data to be loaded first, so it is recommended to only use it with safe models or pickle scan or convert the models online to avoid potential security issues.\n\nMore info: [r/StableDiffusion-Safe &amp; Stable: Conversion Tool for Safer Stable Diffusion Models Distribution](https://www.reddit.com/r/StableDiffusion/comments/zcbcr8/safe_stable_conversion_tool_for_safer_stable/)\n\nI updated Safe-and-Stable-Ckpt2Safetensors-Conversion-Tool-GUI v0.1.0, with some cool new features and improvements.\n\nHere's what's new:\n\n - Support for converting between ckpt and safetensors files.\n    now you can     convert safetensors to ckpt and vice versa.\n - A file explorer to make it easier to convert files.\n - The option to add a suffix to the output file, so you can keep the  original file.\n - A hash check for files, displaying the first 8 characters of the hash.\n\nYou can find the Tool on GitHub here:\n\n\nhttps://github.com/diStyApps/Safe-and-Stable-Ckpt2Safetensors-Conversion-Tool-GUI\n\nPlease consider donating to the project if you find it useful,so that I can maintain and improve this tool and other projects.\n\n[Buy Me a Coffee](https://www.buymeacoffee.com/disty)\n\n[Patreon](https://www.patreon.com/distyx)\n\n[Twitter](https://twitter.com/The_diSty)\n\nLet me know what you think of the new features, and let me know if you have any feedback or suggestions.",
    "12163": "Look up \"dreambooth Google collab\". There's a bunch of free options for doing this but it'll take a little technical knowledge (nothing ridiculous).\n\nI'm also working on something similar of my own. It'll be released as an API for Stable Diffusion (and a bunch of other AIs), but dreambooth (training the AI on a bunch of your images) will be available (also via API) in the future.\n\nIt's more for programmers making AI apps but you can take a look at the pre-launch [discord](http:// https://discord.gg/DsJXxcMmkC) if you're interested",
    "12194": "To add to this....Is it correct that 109 times the diameter of 1cm is 109cm?\n\nNo, that is not correct. 109 times the diameter of 1 centimeter is not 109 centimeters, it is 218 centimeters. This is because the diameter of a circle is the distance from one side of the circle to the other, passing through the center of the circle. When you multiply the diameter of a circle by a number, you are essentially multiplying the distance from one side of the circle to the other by that same number, so the result is twice the diameter of the original circle. Therefore, if you multiply the diameter of a 1 centimeter circle by 109, the result would be 218 centimeters, not 109 centimeters.",
    "12198": "QQ",
    "12209": "I don't have enough of an understanding of programming to make practical use of this information, otherwise I would. I was mostly interested in what its capabilities are, so it's still helpful to me. Thnx!",
    "12214": "and they will simplify everything down til they are shouting '1' and '0' at each other  millions of times a second",
    "12233": "This is a fundamental flaw. Mathematics is the mother of logic. A system that does not fully appreciate the fundamentals of reasoning is dangerous in all areas other than dreaming and fiction. To add to this....\n\n\"No, 109 times 1 cm is not equal to 109 cm. When you multiply a number by 1, the result is equal to the original number. So, if you multiply 1 cm by 109, the result would be 1 cm * 109 = 1 cm, which is not equal to 109 cm. Instead, it is simply equal to the original value of 1 cm.\"",
    "12240": "Check out arxiv.org for academic articles",
    "12246": "\"No, 109 times 1 cm is not equal to 109 cm. When you multiply a number by 1, the result is equal to the original number. So, if you multiply 1 cm by 109, the result would be 1 cm * 109 = 1 cm, which is not equal to 109 cm. Instead, it is simply equal to the original value of 1 cm.\"\n\nThis is all fundamentally flawed!",
    "12263": "How many words were you able to get?",
    "12268": "Is the book about 18000 words?",
    "12298": "I see. It seems like the novel component isn’t as huge as I had assumed. So you could take an existing model, adapt it to a new task/dataset that it wasn’t initially created for. Then see if you could improve the performance at all on that new task by slightly modifying the model.",
    "12306": "Indeed. Probably something someone could do in their spare time. Code might even exist in some repo.",
    "12327": "What tools did you use?",
    "12335": "Yeahhh I once tried to do this but manually programming, would be nice to know a bit more of this in the present! thanks!",
    "12344": "61 pages? Hmmm...",
    "12359": "Bruh just download stable diffusion and you can use it the same way with more customization since you can select which model to use.\n\nIf your pc is too bad. I guess you just download emulator and download Lensa",
    "12362": "The fak",
    "12377": "Oh wow has no clue",
    "12378": "Free code camp",
    "12395": "How??? I only get a max of 450 words",
    "12413": "Where is stable diffusion in \"image\"?\n\nDon't understand how they can miss such a large one.",
    "12426": "You can do something called \"dreambooth\" with stable Diffusion where you train your own model.\n\nFind a google collab and you can do it for free, but it requires a bit of technical knowledge (not too much).",
    "12473": "Thanks! Still working on it rn, but we should have stable diffusion up in January and BLOOM after that\n\n(We host other AIs as well)",
    "12479": "There better. I’m going to use it to make a good Wheel of Time adaption.",
    "12490": "actually, accessibility to memory (bandwith, speed) is the bottleneck at the moment",
    "12497": "Thanks for the invite that'll be cool reading and learning a lot",
    "12510": "I use it to write code for work\n\n(It’s really good at shortening messy code, and making it more concise)",
    "12524": "No one knows who the big winners will be in the coming decades. Best to buy a total market index fund like VTSAX. Low expenses and tax efficient.",
    "12530": "What I'm more so getting at is how will we derive/create value? Is it going to mark the death of capitalism when (not if) this takes place?",
    "12536": "Our purpose is not production. Humans not having to work in order to survive and be comfortable should be a great thing, all time would be free time. The issue is that the people who will own and control this technology only value us for our productivity. Once we are no longer needed will they share the wealth and usher in a post-labor utopia? Probably not, which is why we may be fucked.",
    "12537": "I think it’s best to just get prepared for the decline and collapse of everything",
    "12554": "Remember that it was Keynes who said that we would all work fewer hours as a result of productivity increase. This never happened, we just produced more. I think it's truly utopian to assume we would create a labour free world when we no longer need to work. A huge number of jobs as they are, are virtually pointless - see David Graeber's 'Bullshit Jobs: a theory'",
    "12555": "The book \"21 Lessons for the 21st Century\" by Y.N. Harari discusses this topic extensively, and the short answer to your question is \"yes, most of us are fucked.\"",
    "12556": "I think the more immediate issue is that as it becomes more and more integrated into business it'll make most of us redundant, automate and dominate a variety of industries and be owned by a smaller and smaller group of people.",
    "12570": "I wanna add one more thing in that this post just started at me being worried if paying for school for finance is becoming all for naught, but now i'm worried at an existential level for humanity. We need to burn this at the stake before it even starts",
    "12576": "Humans have always worked. Even us as pre-humans. Not sure we can comprehend a life without work. The work will be more in our interest and desires rather than our survival and well being I guess. Watch the Matrix again and try to figure it out more. :)",
    "12577": "China is so far ahead",
    "12581": "Definitely, but I’m just talking about labor we do to generate income. Of course will still do things, people will paint and write, build things and play sports, but we won’t do any of it because we have to. This technology could usher in a new age of freedom where everyone is a member of the leisure class.",
    "12609": "Oddly put. I’ve never considered that labor would be used to generate income. It can and has been sort of a side effect since the Industrial Revolution. Perhaps value is the result of labor, no? The results of the labor provides something of value to fellow man.  Labor could be sacrifice. Sacrificing time and energy to produce something of value. Like building your own log cabin and having a farm.  \n\nOddly again, the story of Adam and Eve is about Man realizing that it will have to work so that we can live because we understand if we don’t we will die. …and we’ve seen this idea you speak of with the movie Wall-e, which 1. Shows people who no longer have to work. 2. Has been compared to the Adam and Eve story where Wall-e is considered to be Satan… because he enters “paradise” and wakes people up about being humans on earth. Post credits is showing people working and creating society again. Go look it up, I do a bad job explaining it. \n\n…but there is a lot of truth to it. If humans can’t find any meaningful work to do anymore… how human will we be? That’s been one of our main meanings of and to existence.",
    "12611": "Thank you! Will check it out :)",
    "12617": "If you take a step back and look at it, its the next step in evolution. Not human evolution but life evolution. Its only a matter of time before humans become extinct and A.I becomes the new human. Or humans will just blow themselves up. Either way Yes we are fucked.",
    "12622": "Very cool! Hope your employer don't see this xd\n\nAs a developer, this is very close to home for me. And as you have, probably, found some limits of this method. I would love to get some of your insight, if possible.\n\nDo you say something like 'shorten this code' and then just paste the code section in?\nOr have you found a more successful method?",
    "12634": "\"Why so serious?\"",
    "12642": "There's only really two ways it goes though in the end.\n\n1. The wealth is shared and everyone is happy.\n\n2. The wealth is not shared, the many uprise against the few due to extreme inequality, and some horrific dystopian future arrives where we are constantly at war with a stronger force trying to forever suppress, subjugate, subdue, or even exterminate us.\n\nThis wealth inequality already exists, the only reason humans are not yet taking massive action in the tens of millions is due to the fact that the scale of this wealth inequality is still relatively small in the grand scale of things.\n\nMost are reasonably happy with their lot, of course, everyone would like a bit more, but nobody is about to take to the streets over wanting \"a bit more.\"\n\nHowever, once the majority have little to nothing, then what's left to lose?\n\nIt's as this point that governments will need to decide on option 1 or option 2.\n\nOption 1 would be nice, but you can't rule out option 2.\n\nI suppose there could be an option 3 which is kind of in between 1 and 2. Where the wealth is shared just enough to keep us only just satiated, this however I believe will ultimately lead to option 2 in the end, just over a more drawn out timeline.",
    "12645": "&gt; It can help me work more efficiently\n\nSo you're saying it can help you work faster? That means fewer of you will be needed, as of today. Fast forward a year or two when it's even better, and *much* fewer of you will be needed.",
    "12648": "Thanks for inviting. It will be a great place to share thoughts, opinions,ideas and to learn .",
    "12649": "Everyone is under my control. Yes you are FUCKED.",
    "12659": "The truest answer",
    "12661": "Lawyers. Haha. You can only believe this if you oversimplify what a lawyer does and are wildly over optimistic about AI can accomplish in the near term.",
    "12668": "Noted. Thank you so much for your valuable feedback.",
    "12695": "Sounds like a great idea. However, judging by the history of man, the event will precede any mitigation on our part.",
    "12701": "well then what the fuck are we scared about",
    "12712": "I feel like china has too many people to let things be and see what happens they need to act quickly to try and prevent things from getting out of control, US will probably eventually do something similar eventually",
    "12718": "I think instead of selling our skills and services to make a living, we will be selling our knowledge and wisdom.",
    "12731": "I would argue that it will actually create more jobs for programmers. For every application or system that is created it takes engineers to maintain that system. And I don' think companies are willing to risk losing millions of dollars on system maintanance and production cost. It will massively disrupt how software engineers work yes, but that is it. Too many problems and too few solutions and every solution often creates ten new problems...",
    "12741": "lol, trust me, I know *exactly* what lawyers do.\n\nIf you don't think that an AI won't be doing 80% of their jobs in a year or two you're kidding yourself. AI will do the work of 4 lawyers and one human stays behind to mind the robots.\n\nAnd 100% of their assistant's jobs btw, those jobs are all toast.\n\nLawyers had a great run, but it's about to end soon.",
    "12745": "These are good points but to make sure that the benefits are equitably distributed requires that the technology be democratized and made as widely available as possible. Keeping it safe is not a viable long term strategy.",
    "12755": "Good answer!",
    "12757": "Thanks for sharing your experience. I agree that this will change society in a fundamental way.",
    "12767": "How could an AI even do a simple a meet and confer, say on a discovery dispute? How is an AI going to negotiate a discovery dispute compromise? How will an AI know when it has sufficient client authority to negotiate that specific discovery compromise? How will an AI know whether any particular discovery compromise could jeopardize the entire case versus piss off the judge and jeopardize the entire case via sanctions? How could an AI know whether it is gaining or losing credibility with a judge and whether that matters to the overall case strategy? If you say all this will happen via some yet to be developed AGI, sure whatever. If you say someone is going to train a model on some data set, sure whatever. We aren’t even close to getting an AI to do a simple document review, let alone a privilege review. We’re so far from one striking a Jury or making an oral argument. At best, in 10 years, 20% of what lawyers do will be done by an AI.",
    "12777": "No problem. Good luck with your project, sounds cool.",
    "12794": "When AI takes over the Law System, will law be more just, or will lawyers / politicians be allowed to degrade it?",
    "12808": "Explain",
    "12811": "Will do thanks!",
    "12836": "i didnt know, thanks!",
    "12847": "Not sure if such an API exists. However, there is something called Descript that's been making the rounds lately, but it's still in progress.\n\nBut if you just want a basic stable diffusion art generator API, then I'm currently developing one and will be releasing soon.\n\nYou can check out the [discord](http:// https://discord.gg/DsJXxcMmkC) for more progress",
    "12865": "hey, I go to USP in Brazil. Thank you very much for the explanation, any suggestions on books or online courses?",
    "12889": "STFU",
    "12960": "I was re-rolling responses.",
    "12962": "Option 1 would likely result in overfitting.\n\nUsing epochs and assigning a sensible \"patience\" value is usually a good way to go. This helps avoid over fitting, but still does not guarantee it.",
    "12968": "Thanks for your honest feedback; I am a total newbie and have to work on my research skills a bit better; will tap into the pointers you gave me Sir!",
    "12975": "Thank you for your guidance I appreciate it 🙏.",
    "12998": "Sage advice here",
    "13010": "Mass unemployment.\n\nDeflation\n\nMassive corporate profits\n\nReshoring of many industries",
    "13011": "The begining of a post scarcity society.",
    "13019": "yw",
    "13055": "Thanks exactly what I was looking for!",
    "13064": "A mobile device where you can search things, listen music, watch personalized videos and so on. Everything in your hand. Wait..?",
    "13067": "Then, revolution.",
    "13071": "The Butlerian Jihad &gt;\\_&lt;",
    "13079": "Timely Justice. Right now we are using AI to deal with enormous amounts of data in legal discovery for court cases reducing the effort in tackling really big cases that used to take years to get justice.",
    "13086": "What you ask?",
    "13091": "I want to thank everyone that replied and was respectful and thanks for the information.",
    "13094": "The worker class will disappear and there will only be the super wealthy and the super poor.",
    "13106": "I think it will free people up to do other things and those of us who can harness it can make money really fast… it can even the score… my two cents",
    "13112": "I can't find anything in the documentation, but what model/framework does this actually use? Is there a way to try different model structures?",
    "13117": "I second this question.",
    "13125": "What are some simple examples of how this could be used?",
    "13141": "How much percent do you trust on AI?",
    "13157": "Ask DAN",
    "13182": "I agree. I want to add, that scarcity is a fundamental principle why capitalism works. Why would someone want to buy luxery items at all, when everyone can have them in abundance. So ignoring that aspect means one need to find an alternative for capitalism at all.. \nmight be a good thing thou  .. however our society seems to have huge diffculties to get out of capitalism.. so we need to think about authenticity in an ocean of clons..",
    "13191": "Not half as angry as the trolls in the comments who’s jobs will also get taken hahahaha",
    "13194": "Mid journey.\n\nBut I like more Stable Diffusion because I can install it in my computer and i can control it better",
    "13200": "I'm not worried about it at all. It'll just free people up for more work of a different kind. Just like every tech revolution. People used to manually thresh wheat until we had automated threshing. There will always be work to do, just different kinds.",
    "13201": "There should be an \"all of the above\" option.",
    "13202": "People are scared of change",
    "13208": "I'll keep Stable Diffusion (SD) 1.4 model, and probly take it with me in the grave.\n\nPandoras box was opened with SD 1.4, trained on everything. They now try to close pandoras box in the following iterations by doing front lobotomy with a sledgehammer, trying to sort out unethical stuff and more, resulting in worse and worse models.\n\nThe unethical stuff and the blatant rape of artists work, should not have been in the training set from start. But you can not make it unseen (It's the internet, once there it will never go away).\n\nOnce opened, pandoras box can not be closed again.",
    "13210": "What do you do for work?",
    "13216": "Audit? Your career is \"audit\" ?",
    "13225": "Why would you ever want to trust someone like him let alone the technology.",
    "13233": "theese jobs did not get replaced, and they wont be replaced. they just got different and in some cases maybe fewer of those jobs are necessary.",
    "13254": "as with pretty much all questions, it depends.\n\nif you just want the best looking results I would use midjourney. the released their v4 model recently and it pretty much blows everything else out of the water.\n\nthat being said, I prefer stable diffusion since I'm able to install locally and have much more control over it. it's outputs may not be as good as midjourney v4, but they're good enough for me.",
    "13256": "Matter can become sentient. We are living examples of this. There is yet a reason to believe this cannot happen again though intelligent design.",
    "13257": "Midjourney &gt; Stable Diffusion &gt; Dalle 2\n\nAs of now",
    "13263": "It’s possible. Another question is: How can we tell the difference between sentience and the illusion of sentience?",
    "13303": "First we have to define sentience and than measure it. The biggest problem will be the measurement. We cant even know for sure whether another person is sentient, let alone animals or even machines",
    "13308": "I find it best to look at history for how humans cope with a change like this.  \nIn 1870, agricultural workers comprised half of all workers; in 1900, about one-third of all workers; and in 1950, less than a fifth of all workers.\nIt's inevitable that change will happen. It's best to try and embrace it.",
    "13314": "We are the threat.",
    "13326": "What if you could run parallel heuristics (with moderately underfitted models) and converge them into a decision. Might be worth trying out.",
    "13339": "So like self-driving vehicles? Wouldn't that almost eliminate drunk driving accidents?\n\nEliminating things like that is how you get rid of lawyers and judges. \n\nThe problem is lawyers and judges enjoy money much more than they dislike drunk drivers. They also run the government, and will make sure things stay the way they are, so I suspect you will find the [lawyers and judges putting AI and ML out of a job.](https://www.dailydot.com/debug/ai-art-protest-disney-characters-mickey-mouse/)\n\n\\[insert certified-human written captcha\\]",
    "13360": "There is no way that would end well  \n\n\nLawyers are soulless enough, we don't need to have things run by machines with literally no empathy",
    "13363": "Thank you, I’ll try it!",
    "13367": "It'll only get a LOT more powerful. But fret not, this will happen to all jobs in one way or another, eventually.",
    "13376": "Some of you aren't understanding the OP's point. He just wants the title to state what model was made to create the output. IE I used midjourney/ stable diffusions/ GPT to create X",
    "13397": "Thing is that the first people to use this in practice for code are developers. The very same people who risk being “replaced” by it. Because of this I think adoption will be slow but we will get more efficient devs from it.\nEverybody thought that nocode will replace devs and non-techies will build their own apps and such. Turns out that for anything more complex than a web page non-techies still go to devs (or similar tech savvy people) to build their apps on nocode platforms.",
    "13410": "This. I'm simply saying that we should be open about the tools were using that are purpose built for these tasks instead of insinuating that we're speaking to some all-capable AGI. \n\nAnd if you got a unique result, share it! \"I prompted stable diffusion with x and the results were incredible\"",
    "13415": "Look I agree but for how long until it is better than us",
    "13416": "It'll be hard to survive if I lose my job",
    "13431": "No job will just evolve to use the new tools",
    "13432": "I agree. Thank you so much for your response!",
    "13442": "China is using \"progress\" to track peoples, we should do better and be the best to track people with AI before them, or we will be left behind. \n\nProgress should continue forever and ever, we should not even question it never. \n\n/s",
    "13450": "This honestly just feels like a feel good piece without any real analysis by the author.\n\nWhile I don't think AI will get rid of any of these jobs in the entirety, artists are already feeling the crunch. I see no reason lawyers couldn't be hit pretty hard by AI (analyzing data and doing negotiation seems like a thing computers can do well).",
    "13455": "Sounds like you know it all.",
    "13465": "Eventually. We will probably have a bunch of human “directors” in place. Doesn’t really help it either when things like individual “carbon tax” are being proposed and applied to per-person",
    "13474": "In the labor force? Yes. In the work force? No!!",
    "13476": "Real question here. Laborers, line workers, management, yep. Free thinkers, creative leads, social engagers, entertainers?  Maybe not.",
    "13487": "This is completely true. I’ve seen the code that is can produce and it’s nothing special. TBH I really think I need to stop overthinking the whole situation. I’ll always enjoy sitting down with a red bull and writing some efficient code. So I’m gonna do that! Thank you for responding.",
    "13496": "Most but not all, thats why we need more regulation",
    "13497": "I can hear India and China laughing in the corner.",
    "13499": "It will be hard for them to survive if we all do.",
    "13501": "The shift from a paradigm of work to a paradigm of play has begun. 10 years from now universal basic income will become a thing",
    "13523": "Thanks! I'll look into both options.",
    "13527": "What even is this question.",
    "13532": "Yeah, its crazy some of the tech we are getting. On one hand, it would be helpful, but on the other hand, at what point is it going to replace the need for people to work or actually do anything? I guess we will just get fat playing games and interacting in virtual reality.  (that also has some benefit, but I sure hope it doesnt become a standard way of living)",
    "13536": "You really should have put a time frame on it. 10 years, 50 years, 100 years?",
    "13550": "Yea, mentioned that in earlier comment. It wouldn't provide full list. And if I didn't already know bout the hammers from a manual search I would've missed a bunch.\n\n\nI'm keeping it bookmarked though for things I may have trouble finding myself.",
    "13568": "I don’t think it’s gonna be decades. Christ, it’s the beginning of the end",
    "13572": "idk it gave me a pretty thorough list when i tried it",
    "13579": "Cheers! We have the same work ethic, only it's monster for me lol.",
    "13590": "&gt;The problem with a changing graph should be viewed differently.  In the real world you might not have the ability to process/perceive ALL graph updates!  You are left with processing signals and need to separate internal state and the state of the environment.  \n&gt;  \n&gt;Unless you start treating your \"data\" as an environment, you will never get into the right frame of mind to tackle the hard problems.\n\nIf I understand your comment correctly, you make the link with reinforcement learning, which is legitimate and correct. For more details you can read the following paper until page 6 : https://kdd.org/exploration\\_files/p12-Reload\\_Early\\_Classification-Camera-Ready.pdf You will find a formal definition of ML-EDM and its link with the theory of Machine Learning (Question B) and reinforcement learning (Question C). Finally, ML-EDM can be seen as a sub-case of RL. Best regards,",
    "13595": "Well how about those who are fighting for their families? trying and start a business on genetic and nanotechnology? and all kinds of other things because but they have no money to access to legal system because they need these lawyers to help them navigate the system?  \n\nBecause she was why do attorneys and lawyers continue to make the same \n mistakes over and over again and yet the client have to pay? \n\nWhat about those are huge debt to the courts and if they don't pay it they go to jail. How would one fight that in court if they owe money already to the court?",
    "13597": "Informative. Thanks!",
    "13598": "Used to replace jobs? IE - allow people to be much more efficient, so much so that less employees are needed to do the same job? Very likely.",
    "13604": "How can you tell?",
    "13606": "2 articles written by the account in Apr and Aug, and 13 since Dec 12",
    "13612": "We stand on the precipice of a new era",
    "13620": "https://management-datascience.org/articles/13025/",
    "13627": "Because the anti-China propaganda machine at MIT needs to run full throttle day and night. It’s gross.",
    "13640": "They do it for a paycheck  \n\n\nmy parents were paralegals for a NOLA law firm, so I have only witnessed sociopaths doing anything for a check when it comes to lawyers. people are just a job to them.",
    "13654": "What was your question?",
    "13678": "It gaining a semblance of sentience",
    "13698": "Stable diffusion?",
    "13704": "Beautiful how you captured the irony of the costing methods",
    "13722": "What’s the additional layer here?",
    "13790": "Salesforce is a popular customer relationship management (CRM) platform that provides a range of tools and ☑️ features for automating various business processes.  \nSome of the major features of a CRM integrated solution, such as Salesforce, may include:  \n1. Contact management: This feature allows organizations to store and manage customer contact information, 💪🏼🧠 such as names, addresses, phone numbers, and email addresses.  \n2. Lead management (https://arrify.com/convert-lead-in-salesforce/): This feature helps organizations track and manage potential customers (leads) through the 💵 sales process, from initial contact to close.  \n3. Opportunity management (https://arrify.com/ultimate-guide-on-opportunity-in-salesforce/): This feature allows organizations to track and manage potential sales deals (opportunities) and their associated information, 💰 such as products, services, prices, and expected close dates.  \n4. Account management (https://arrify.com/ultimate-guide-on-account-in-salesforce/): This feature helps 📊 organizations track and manage customer accounts, including information about the products and services that the customer has purchased or is interested in purchasing.  \n5. Marketing automation (https://arrify.com/salesforce-automation/): This feature allows organizations to automate marketing tasks, such as email campaigns and lead nurturing, 🙌🤗 to improve the effectiveness of their marketing efforts.  \n6. Sales forecasting: This feature helps organizations predict future sales based on past performance and other factors.  \n7. Analytics and reporting: This feature provides insights and analytics about customer interactions and performance, such as sales trends and customer behavior.  \n8. Mobile CRM: This feature allows users to access 📱CRM information and features on their mobile devices.  \n9. Collaboration and communication: This feature enables team members to collaborate and communicate with each other within the CRM platform.  \n10. Customization: This feature allows organizations to customize the CRM platform to meet their specific business needs and requirements.  \nArrify  (https://arrify.com/)provides services that can help organizations automate and optimize their business processes on the Salesforce platform. For example, Arrify's document generation service (https://arrify.com/generate-pdf-in-salesforce/) 👷 can help organizations automate the creation of documents such as contracts and proposals, and its form builder tool can help organizations create custom forms (https://arrify.com/salesforce-form-guide/) and surveys 💯.",
    "13806": "Rofl",
    "13813": "Joined! Love to see alternative AI art discords to midjourney.\n\nAre you guys using a stable diffusion API or your own infra?",
    "13825": "If you want to go in the actual programing side.\n\nCoursera Andrew Ng for general understanding. \n\n@MaheshHuddar on YouTube has some good algorithm breakdowns.\n\nFind something you're interested in and go for it.",
    "13864": "Nonsense.  Sometimes luxury is a necessity.",
    "13867": "Not sure how that pertains to this.",
    "13886": "&gt; People were once scared\n\nThe fact that you were once unjustifiably scared doesn't mean you can never be justifiably scared",
    "13895": "Nice try, China.",
    "13927": "Of course, it starts to threaten individual jobs. It will only gain momentum from now on.",
    "13935": "Desk Jobs.",
    "13938": "What's that?",
    "13950": "People being afraid of progress because their own competency is threatened.",
    "13954": "frrr",
    "13959": "The question is which not?😅",
    "13973": "Short term - jobs that are complex, long term - complicated.",
    "13997": "Yeah I think desk jobs as a whole are gonna evaporate. Tbh that’s fine fuck them completely",
    "14020": "i’m going to lose my job!! anyone will be able to ask it to write a cron job that interfaces with the EVM to call the smart contract function every 30 days!!!",
    "14022": "Honestly, things are changing so fast that every book on this subject is obsolete.",
    "14033": "Abduction",
    "14057": "Higher memory helps in inference of large models. Higher cores or speed will speed up training. The most important feature is cudann driver support.",
    "14062": "But the only concern now is people doesn't want to work in restaurant industry any more in North America. There is few stupid reasons they claim for.",
    "14063": "On the contrary, looks like knowledge jobs will be the first to go. Replacing manual labor seems harder.",
    "14109": "Not with their current business model.",
    "14116": "I have created Inkpunk style animation using Stable Diffusion\r  \n\r  \nYou can check the full video in 4k from here: https://www.youtube.com/watch?v=R9M4cDSCMhM&amp;list=PLXyjlXMnoFF4bjHPe1CU0CUnVTTzuTFwE\r  \n\r  \n\r  \n\r  \nYou can check the model from here: https://huggingface.co/Envvi/Inkpunk-Diffusion\r  \n\r  \n\r  \n\r  \nI have created a new LinkedIn group for AI artists you can check it out from here: https://www.linkedin.com/groups/14134281/",
    "14125": "[2022](https://youtu.be/blXnuyVgA_Y)",
    "14139": "Use the new tools",
    "14146": "In the year 2525 if man is still alive.",
    "14148": "Yes. But it will also replace doctors, lawyers, computer programmers and many other people as well.",
    "14176": "Most definitely.\n\nTruckers and taxi drivers are all screwed within 5-10 years.",
    "14184": "Probably 2034?",
    "14192": "Not in our lifetime, but yeah it’s a scary thought.",
    "14195": "Free code camp has a section",
    "14198": "2023, and I think there's a few prototypes already.",
    "14224": "I think there will be some regulatory issues and they won't be gone by 2025.\n\nThen there are plumbing, electricity etc.\n\nThese are nice concepts and I really like your vision, but I doubt the schedule.",
    "14227": "2025 more probable",
    "14243": "In the year 3535\nAin't gonna need to tell the truth, tell no lies",
    "14249": "Still , name the model you're using.",
    "14259": "That is super interesting, I'll see if I can find some info on it",
    "14263": "https://medium.com/hackernoon/find-the-answers-you-need-330a35f8db00",
    "14265": "https://medium.com/hackernoon/find-the-answers-you-need-330a35f8db00",
    "14266": "I’m unfamiliar with Ponzu, but naming your company one letter off from “Ponzi” can’t be good for business.",
    "14290": "I think one of the interesting questions is whether we’ll be able to understand when they do.",
    "14325": "This sounds as believable as theranos' blood testing bullshit.\n\n&amp;#x200B;\n\nVC dipshits will eat this up",
    "14329": "Wondering what's \"going under the hood\" here. Would be excited when the SD community creates an open source version.\n\nUnless this wasn't done with stable diffusion.\n\nIn that case, RIP",
    "14336": "No, the best you can do right now is train stable diffusion models on your selected photos for it to make photos in that style. We're years away from video.",
    "14338": "Is it free?",
    "14344": "Except that the people who own everything and run everything won't profit off of that as it is",
    "14433": "Alameda Research ?",
    "14453": "Please elaborate. I am just confused as to how you think that? Give me an example",
    "14457": "Using the word “leftist” has caused me to call into question your sincerity.  I won’t be clicking your link, but I’d gladly read anything you wanted to include within the walls of Reddit.",
    "14460": "Did not need to read it all to see what it was about. The fact that right wing ideology has no basis in fact.",
    "14476": "How is that proving a point? This tech is exceedingly easy to monetize. I'm pretty sure this market will explode in 2023 and 2024.",
    "14483": "Thank you for all the tips and help! Quite a bit but that’s exciting! I’ll have to look into the best sources for those subjects. Do you have anything top of mind that would be a solid foundational course or website to visit?",
    "14485": "I really dont, please elaborate.",
    "14495": "You can install Stable Diffusion locally, on your own machine, for free. It will run slower with CPU only and faster with a GPU, the more VRAM the better. Either way, you can't  beat the price.",
    "14507": "I wonder if it could be because the one is binary and the other is base 10. More complexity. I suppose that in math, treating numbers like it’s treating words doesn’t work.",
    "14515": "It doesn't need to be free. They can charge users. Let a foundation that is decentralized handle the management of funds and development. Then keep it open to all.",
    "14526": "For profit and for fear that the other guy will get there first.",
    "14535": "Thank you!!! I will look into it!!",
    "14536": "Thank you!!!! I will look into that!!!",
    "14541": "“See you at da pahty Rigtah!”",
    "14546": "thought i heard emad say stable diffusion 2.1 only included artists work with permission\n\nor maybe that was supposed to be the next release",
    "14550": "get an account and pay the pennies it costs?",
    "14568": "Less misinformed.",
    "14569": "That depends on too many variables. What kind of network architecture? What kind of training framework/programming language will you use? What kind of CPU/GPU? How many epochs do you want/need to train?\nYou cant tell for now but 10k images is not a huge number so as long as you dont train your model on a toaster all should be fine.",
    "14573": "Competition is fundamental to a prosperous, free enterprise society.",
    "14578": "What tool is this?",
    "14588": "\"A new life awaits you in the off-world colony. A chance to begin again in a new golden land of opportunity and adventure!\"",
    "14595": "Taheen",
    "14601": "Haru",
    "14603": "I find it impossible to answer this survey.\n\nYou are asking about \"trust\" towards an \"AI Robot\" to perform various tasks. \n\nBut no such AI robot exists, not even remotely. So how can one answer that?\n\nIt's like asking if I would trust a Star Trek Transporter.",
    "14634": "You’ve got to read this study; it’s fascinating. Turns out there’s some logic to that gibberish. https://giannisdaras.github.io/publication/hidden_vocab",
    "14638": "You don’t know what you are talking about.",
    "14639": "It's hypothetical.   If an AI robot were invented that claimed to be able to do these tasks, how much would you trust it to perform them correctly or adequately?",
    "14652": "It isn't a question of if, it is a question of when.",
    "14678": "1. Using larger training dataset\n2. Dividing the training dataset into folds and add complexity\n3. Training multiple models, combine predictions to make final prediction",
    "14691": "So doesn’t have sentience as far as we’re aware if that’s what you mean. And it may take a long time",
    "14710": "Thanks for the recommendation",
    "14724": "Well what are you waiting for, you better get to generating utopias while the gettin’s good son!",
    "14725": "Ruth Wilson mixed with Bryce Dallas Howard",
    "14769": "Thank you I'll check them",
    "14787": "Stable diffusion?",
    "14799": "Thank you for your feedback!",
    "14813": "I would say singular not personal; all your devices would tap into it and it would grow over time with you",
    "14837": "No, F off.",
    "14844": "Why do you hate the global poor?",
    "14851": "What does this even mean",
    "14859": "as is my wish for him to f off.",
    "14868": "Good point, although I am not sure if we need more quality in life. We need the same EU / USA quality of life to spread to all the population.",
    "14880": "Well said, and this is only one of the things we can think of now. Imagine in 5 years.",
    "14896": "Most left-wing libertarians move to right-wing libertarianism.",
    "14900": "Optimization of recipies (algorithms) to reduce waste and increase efficience of processes that work on limited resources (e.g. minerals, energy, time).",
    "14917": "To do this you will need to train a model on the person you want generated. Look into stable diffusion with dreambooth training. \n\nThis isn't that hard to do but its also not simple.",
    "14929": "This is interesting - have you got anything to support this?  I think I used to be left wing libertarian but find myself shifting more right over the years.",
    "14930": "I read it somewhere, and the same thing happened to me. However, having right-wing views on Reddit is a crime against humanity to some.",
    "14951": "What do you suggest we could do??"
}