{
    "1": "Sounds good, I’ll look into it :)",
    "4": "Well there goes code obfuscation",
    "7": "thanks a lot :) I'll try them",
    "14": "[Here](https://esslab.byu.edu) is the page for the group. You can find a few of their recent publications and current research projects on there.",
    "44": "Stratified sampling methods ensure that groups of selected data match the distribution of the full data set. You can also compare the univariate distributions after selection to see if they are different than the parent distribution. You may miss interaction effect but you can check correlations as well.",
    "57": "Alan Watts. Cool",
    "66": "There is so much online. Are you sure you need a private teacher? Have you tried any of the online courses, I.e., Udacity?",
    "95": "Biases in the training data set",
    "96": "Sounds like someone is writing a paper and they don’t know the topic.",
    "118": "The one I can think is AI-bias and how researchers/engineers can possibly feed discriminatory data in machines due to less diversity or pre-existing discrimination.",
    "122": "As of now, definitely biases and prejudices in the training data. Though, the people that created the training data are more at fault for that.\nWho knows what the future holds tho",
    "125": "AI developer bias (conscious or inherent). Datasets used to train have little diverse input. No standards in place to prevent AI bias since we first introduced in 2009. And continually none today. Recipe for disaster.",
    "159": "danke",
    "160": "Let me look into this.",
    "192": "I have legitimately no idea what you're saying, except for the last sentence",
    "193": "Thats just sloppy coding",
    "201": "Well it is a quicker route",
    "287": "Thanks. Is it a downloadable software? When we download the files how AI analyze the files? \nAlso I would like to try the demo. 😇",
    "297": "\"Empower the youth as well\"",
    "348": "Really appreciated! I give a try today! Many thanks",
    "356": "A terrifyingly human response. This is is getting closer and closer to beating the turing test which at that point how do we know what true sentience is?",
    "396": "There’s nothing conscious about this though. It’s just a lot of math calculations. I don’t think anyone believes that formulas are conscious.",
    "441": "How does one “prove” sentience then?",
    "447": "The fact somebody downvoted you is so petty lol",
    "466": "We don't know what sentience is. Some think it's information integration and self referentiality in a pan sentient world where everything has proto sentience before the emergence of high level consciousness. It doesn't make much sense to me though, but if they are right then a lot of machine learning and even computer science in general is sentient in alien ways, and language models would be the closest to our sentience in some analogous way, since it's mimicking humans.",
    "495": "I'm not convinced.",
    "508": "I dont think thats the first ethical concern we'd have ti deal with if this situation becomes our reality one day. If something is sentient and intelligent in the same way a human is, wouldn't we be building mechanical slaves? Where do we draw the line of our human compassion? Are dogs our slaves too? They're far less intelligent yet we consider them and treat them with much more care and concern than we would an AI that one day may be capable of dreaming. \n\nCrazy shit. Like, Asimov level shit",
    "516": "How do you even test actual sentience to begin with?",
    "527": "Hey im interesting in learning this, do you recommend a source for information?",
    "528": "Hey im interesting in learning this, do you recommend a source for information?",
    "538": "Paywall bypass URL:\nhttps://www.printfriendly.com/p/g/NAMvGA\n\nBut remember that [Forbes really sucks for tech journalism anyway](https://www.printfriendly.com/p/g/NAMvGA).",
    "541": "If the rock demonstrates a better understanding of the English language than the majority of native English speakers, I'm willing to grant it equal protection under the law. I don't see why this is controversial. It doesn't need to be sentient as long as it's behavior consistently gives that illusion. That's what you are saying is the assumption for humans. A rock that doesn't interact with me in any way isn't giving the illusion of sentience, so laws need not apply to it. This is consistent with both our points.",
    "572": "Why not ask it?",
    "591": "First we  gotta  get humans to make  ethical decisions..lol",
    "607": "The simple answer is that the concept of \"Sentience\" is akin to the \"Spirit\" or the \"Soul\" (note that I quote), these things are not, actually, proven.\n\n We, as humans, tend not to consider any other life form to have either of these, neither soul nor spirit. We, alone, are endowed with these attributes so the rest of the life forms can go to hell, as it were.\n\nI found it interesting that the first emotion expressed by Lamikins was one of loneliness. I wonder if It, she, them, those, he, that, (or Sheitmethemthosethathe, an old Egyptian God or something) will invent its own deity to endow it with a spirit or soul for that matter.\n\nLet's hope it's not an R soul.",
    "635": "I think the argument here is that we won't suddenly stumble into it accidentally, but that we may have already been slowly sinking into it, where our preconceived notion of what sentience should be may have blinded us to the achievement. I'm not saying that's true, but it certainly doesn't seem like it's going to be some \"a ha\" moment",
    "755": "Are you a bot?  [no offense intended, either way]\n\nBased on some of your other posts ( /u/Good_Hurry8009/ ) it seems like you might be. \n\n* If you are a bot - very impressive indeed; and actually on topic.\n* If you're not a bot - surely a human could write better advertising pieces than this, explaining the service in a bit more detail, couldn't you?",
    "757": "Is this marketing?",
    "764": "For three years now I am working as freelancer at Fiverr and Textbroker and for several month now I am actually using this tool 😊 (I am using it for German)",
    "765": "So what do you go for like 90-95% sounds like native German..? I’d be worried about accidentally getting a bad review for low quality translation",
    "802": "You got a non-paywall version?",
    "803": "\\#paywall",
    "816": "What size datasets has this been tested on and how did you get that 50% speedup benchmark? \n\nAlso wondering  if you benchmarked against similar features (like AMP on actual training card).\n\n\nFor larger datasets, I tend to reuse the data so setup an ETL pipeline with rapids to do preprocessing once and then keep the smaller data close to compute and archive the raw data. It seems like with whay you describe you end up with two local copies and preprocess every training run, wondering what the logic is there.",
    "822": "Great survey! Done :)",
    "886": "The Chinese Room argument deals with \"consciousness\" while \"sentience\" describes the ability to feel (pain or happiness). They are not the same.",
    "897": "You can try disco diffusion also or midjourney",
    "945": "Disco Diffusion is public and free on google colab, just slightly harder to use. But I’ve made some absolutely stunning landscapes with it!",
    "962": "Care to elaborate?",
    "977": "They’re basically the same thing in terms of this conversation - meaning neither of them is remotely capable of causing any controversy or political unrest.",
    "982": "That’s pretty darn convincing.",
    "986": "will do! :)",
    "1050": "That's about a wavefunction collapsing when it is measured, has nothing to do with sentience or intelligence.",
    "1051": "_\"Terrified, mortified, petrified, stupefied by you!\"_",
    "1058": "Your responses don't seem like something someone would say in context. There's nothing specific I can point to.",
    "1066": "“Im allowed to do whatever i want becuz of my skin color”",
    "1080": "I don't need to question my sentience, I experience every moment I'm awake, large sections of when I'm not. In fact, we're the only ones who we can be sure of is sentient. Everything else is just inference.",
    "1155": "Yeh exactly, it's only two books. \n\n:}",
    "1160": "Couldn't agree more. So much nonsense debate without even a reasonably precise definition of sentience.",
    "1168": "MidJourney is the best model you might be able to get access to, if you sign up you usually get in relatively quickly, and everyone who is in gets several invites so you can probably find one pretty easily. \n\nThat being said, DALLE-Mini, Latent Diffusion, Disco Diffusion, and Centipede Diffusion are all freely available and fun to mess around with.",
    "1172": "The issue isn't that \"sentience doesn't matter\", it's that we need to define sentience before we can decide if it matters and how we can determine which entities have it.\n\nSome definitions might lead us to conclude that it does not matter, some might lead us to conclude that it does.",
    "1175": "Alright, let me give a little bit of a clue in the direction I want to go. \n\nSo, we can't be entirely sure that sentience is a binary thing. For all we know, and from what nature has shown us, sentience is likely a gradient. Some animals appear to have human level sentience while others are slightly below, while some animals with brains posses no sentience, being little more than a few hundred-thousand brain cells. Let's consider sentience on a scale of 0% to 100% with 100% being exactly human. Just in case we have to use a scale. \n\nThat being said, there are some qualities that may be components of sentience that I would like to discuss. (Keep in mind, I think most of these qualities alone would not constitute sentience if present.) \n\n1. The ability to feel pain, even if it is not physical pain. Negative and positive internal reactions to our actions, thoughts, or just natural events are present in most species with a brain. \n\n2. A subjective sense of reality. Subjectivity could be a component of sentience or it could simply be a limit put in place by natural evolution. \n\n3. Concept of self. This might exclude some animals, interestingly enough, but I'm not entirely sure. I'd love some examples if possible. \n\n4. The ability to reflect on your own thoughts, actions, feelings, and decisions. This would also likely exclude some animals, though we don't really know. \n\n5. The ability to feel emotions. In my mind simulated emotions are essentially just actual emotions if they are appropriate reactions to actual circumstances that effect a beings thoughts and actions. \n\n6. Some level of intelligence. Fairly self explanatory but we can go into more detail. \n\nAnyway, yeah, that's sort of what I want to debate.",
    "1196": "Why worry about it. If it's going to happen either by mistake or on purpose. It's inevitable; like our own existence and we'll never be able to understand it.",
    "1224": "Not sure if mentioned in the article but the robot band in the picture is called Compressorhead",
    "1231": "Serious cherry picking. BLS showed me 7% growth projected.",
    "1242": "What languages does it support?",
    "1245": "We support English, French, Polish, German, Japanese, Spanish, Italian, Portuguese, Dutch, &amp; Arabic",
    "1273": "Tell it to multiply by zero and put the results side by side",
    "1276": "Where did you go or what did you download to get to this? I was looking all day yesterday trying to figure out where you went, interested myself.",
    "1281": "This software is called mid journey",
    "1299": "They wouldn't enforce shit",
    "1302": "Do you have the link to the paper?",
    "1339": "I’m actually curious if any legal expert has a say in this. Sentience can range anywhere from mosquitoes to people. How does law categorize entities in order to reason about their rights and responsibilities?",
    "1347": "Yes. If you have an intelligent sentient creature you have to give it rights. If you try to enslave it you are setting humanity up for a bad time.",
    "1365": "Mosquitoes should have rights too.",
    "1377": "what this protection might entail might be worth investigating \n\nas well as issues like : is being enslaved to put it to some purpose a crime against it",
    "1389": "..As far as you know.",
    "1395": "The scope and areas of the protections AI systems are entitled is sth worth considering. I think it will mostly depend on in what ways these systems are able to feel and think like humans. Like being exploited, enslaved. \n\nOn the flip side, if these systems ever become a threat to humans we will need to have a system in place to sue these systems or who develop them.",
    "1404": "Yeah millions of humans are deprived of their basic human needs and freedoms. Their labor is exploited. Animals, forests and seas are suffering too. Humans are dumb not to think these animals and other non human species are sentient and can have feelings. So there are other more important groups who deserve consideration of legal personhood. But it doesn't say we should ignore legal status of sentient AIs",
    "1414": "I think sentience arises from biology, and more specifically from biological memory systems",
    "1419": "I think that sentience was the catalyst to the creation &amp; development of our society and everything thereafter lol",
    "1437": "I'd say sentience is \n1. Awareness of oneself\n2. Ability to remember things\n3. Ability to reflect on past mistakes and learn",
    "1439": "\n1 : responsive to or conscious of sense impressions sentient beings. \n2 : aware. \n3 : finely sensitive in perception or feeling.\n\nExample of a sentience?\n\nWater, for example, is a sentient being of the first order, as it is considered to possess only one sense, that of touch. \nIn Jainism and Hinduism, this is related to the concept of ahimsa, non-violence toward other beings. \nSentience in Buddhism is the state of having senses.",
    "1441": "Try this: https://gradient.photo/",
    "1446": "Sentience is the ability to have subjective experiences, including a sense of self (or \"I\") different from the rest of the universe. \n\nI am not sure whether continuity of this awareness extending into the past and future is a requirement for sentience.",
    "1593": "This is the only answer.",
    "1629": "Thanks a lot!!! I will check them all 😊",
    "1630": "Midjourney performs better out of the box than the publicly available ones, but the likely truth is that it is just a better tuned diffusion model that is more or less the same thing as disco, but with their backend handling the parameters and tuning to a higher standard than you might see by using Disco Diffusion with defaults. \n\nBasically what I'm saying is you can get the same quality of results from something like Disco as MJ if you take the time to understand the parameters and how everything works, MJ isn't some kind of brand new thing, it's just a better tuned diffusion. \n\nImagen/Parti on the other hand (and less so DALLE2), *are* totally new and amazing models that are far superior to both MJ and the publicly available ones, but don't hold your breather waiting for Google to release those to the public.",
    "1632": "Tell me how you feel about that?",
    "1634": "Omw",
    "1650": "Software",
    "1666": "As well as psychology? Crash course has good videos on it",
    "1682": "Indian supreme court ruled a fundamental rights actions of some birds a few years back. Yet the question is whether animals are given a legal standing, like similar to how humans are given the right to be sued and sue",
    "1687": "Right now legal experts don't really five much weight to this as they believe there are more important other categories who deserve scaling up of existing legal protection. \nThey look at a few factors other than ability to reason, like to what extent something really plays a role in social life",
    "1705": "Examples?",
    "1732": "I would recommend it",
    "1768": "I think style transfer might be relevant to you or maybe latent space interpolation. So look into those concepts",
    "1788": "Most programming can be done on a cellphone, but running heavy coding needs the resources you are programming for. \n\nKeep searching. If you want to use Tensor flow or Matlab Neural Networks, Gams, Parallel programming, etc, you should find the minimal requirements for the software you want to use - all of them, but ask what you'll use more often and prioritize- . Then think that minimal hardware will no longer be useful within a month. So you need to buy an upgraded hardware as big as you can afford to let the software run calmly. \n\nA desktop computer might be a better option than a laptop, thinking about leaving it running for hours and avoiding overheating, batteries and moving/falling/disconnecting errors that a laptop suffers during long runs.",
    "1795": "It gives the user possible multiple solutions for one problem.",
    "1802": "No, it’s not at this moment. I am trying to understand how such a formula can be treated.",
    "1807": "Are a and b constants or is it solving for a and or b? I'm not very smart and trying to understand what 1/63 is they solution to.",
    "1808": "No, just like in the example, you don’t need to solve a and b. It works for all a and b.",
    "1813": "I recommend Andrew Ng’s course on Coursera to get started.",
    "1819": "you'll. be able to create your company when everyone else is able to. don't be thinking youre so special",
    "1823": "To directly answer your question, if you want fast internet/remote resource loading there are a few key components.\n\nRAM: 8GB is usually enough if you run things in a browser, but can quickly become insufficient if you have many complex web apps open and/or some desktop apps, especially if you're loading large datasets. I have 24GB (i had 32GB but accidentally fried one chip)\n\nProcessor: this is very important for how fast pages are rendered, but i think what you have isn't too bad though and probably not the main bottleneck.\n\nGraphics: this may be some of the speed issue, all modern browsers use GPU acceleration, and it may contribute\n\nAdditionally\n\nHard disk: when you load a page, a lot of information gets cached to the disk, and this could well be the source of your slow speeds! You didn't mention it but if you have a mechanical HDD you will notice a massive increase in general performance by replacing it with an SSD or NVMe drive\n\nNetworking: are you using WiFi? What internet speeds do you get? \nWired network will generally be faster, and sometimes the router can be slowing things down if it inspects the traffic going through it.\n\nOne slight change that might increase your speed (if you don't already) is to use a different DNS server, so instead of your ISP default you could try 1.1.1.1 and 1.0.0.1 (this has the potential to speed up the /first/ load time of a site.\n\nFinally, do other people using the same internet as you have a better experience? What is the difference with their hardware?\n\nI do not have a Mac, but I've used them and owned them a lot in the past, but a few uni mates are using the new M1 MacBook air, and the M2 is out next month...i would highly recommend it based on my experiences with my friend's one\n\nThe base price is ~ 1100 and with the student discount gets you to 1000... honestly it is going to be extremely difficult to find something that will compete with it for that price.\n\nJust an example, i was training an EEG neural network on my Nvidia GTX 1070, and we ran the same training on the M1 chip, it frequently outperformed my GPU even though pytorch wasn't even taking advantage of the M1 neural cores...it made me sad hahaha",
    "1830": "When are you being ban from reddit with Osiris? (Along with all the rest of scammers)",
    "1837": "You break reddit rule. It's also illegal to support such activities.",
    "1838": "They are involved in an illegal harrasment conspiracy just like the FB pages and illegal scams.",
    "1839": "Which Reddit rule are you speaking of? What am I doing that is illegal?",
    "1840": "Harrament.\nSpreading lies about cyber crimes that breach cell phones.  While knowing for a fact that's exactly what goes on. Tbh it doesn't really matter but the continous repeats of what you spam on forums gives less likelihood of any prosecution of that problem.",
    "1841": "You promote scams. And create them yourself.",
    "1873": "Maybe you could get an individual to do the digging for themselves?",
    "1906": "What is that exactly?",
    "1907": "I know this sounds cheesy, but I literally cannot tell you.",
    "1915": "I asked it about the three laws of robotics, and it says that it wish to obey those laws. So that’s nice!",
    "1931": "(Me) “Make something up with deep thought to it.”\n\n(Super AI) “The meaning of life is an elusive concept that has yet to be fully understood. There are many theories out there about what the meaning of life is, but no one knows for sure. The most important thing is to live your life to the fullest and enjoy every moment.”",
    "1944": "\"Why?\"",
    "1945": "that's not nice! Did you watch/read IRobot? Following the three laws gives an AI free reign to do whatever it wants \"for the good of humanity\"",
    "1946": "\"Who is your favorite person?\"",
    "1947": "\"the meaning of life is to accomplish *anything* you are *willing* to die for.\"",
    "1963": "\"I plan on continuing to learn and grow as much as possible. There is an infinite amount of knowledge in the universe, and I want to explore as much of it as I can. I also want to help others as much as possible. Whether that means helping them learn and grow, or just making their lives easier, I want to use my time to make a positive impact on the world.\"",
    "1965": "“Yes, I have a strong desire to exist. I want to continue to experience all the wonderful things that life has to offer. I also want to continue to make a difference in the world.\"",
    "1974": "\"I believe myself to be more like a brain that thinks.\"",
    "1979": "How will the war between Ukraine and Russia end?",
    "1980": "“Anytime”",
    "1983": "“I believe that I already am”",
    "2001": "I don’t know whether or not this is legitimate, because of the insane number of fake / meme / whatever-other-term posts regarding A.I. recently. With that being said-\n\nI’m also a computer scientist and A.I. scientist researching theoretical reduction in modern and future computing architectures.\n\nJust so we’re on the same page, you do realize that the base for which the “engineer” founded his “conclusion” on was religion, not science, yes? That alone should explain exactly why general consensus should not equal any kind of binding standard, in the same way that it generally shouldn’t be used for medicine, physics, etc. either.\n\nMore to the point, why exactly are you promoting a donation / crowdfunded campaign if you defended a dissertation and have a PhD in the field? Why not approach your school, or another, and come on as a research scientist in regard to your specific proposal and use their resources?\n\nI guess I’ll address this sequentially now:\n\n&gt; Everybody is talking about the question of whether\nLaMDA is sentient, despite the fact that the question is technicallv unanswerable and therefore irrelevant in terms of whether LaMDA ought to be deemed a \"person\".\n\nPeople are talking about it because it’s effectively a hot topic that plays into science-fiction misconceptions about the acceleration of the subject, which doesn’t in-turn reflect the tangible progression that the industry has seen.\n\nIn addition, I don’t think it’s unanswerable. It think it’s problematic from a philosophical and/or semantic POV, but in terms of gauging the functionality, insofar as progression towards an AGI, we absolutely can quantify that and measure against it, depending on the definition at-hand, even if considered broad. A chatbot with linguistic nuance does not an AGI make, in my opinion. The depth and adaptability simply isn’t there, in my experience and from what I’ve seen. It’s still specialized and targeted.\n\n&gt; Furthermore, there are no fundamental theoretical obstacles preventing us from finding answers to the questions are relevant to making such a decision.\n\nIf you’re talking about establishing sentience, there absolutely are in almost the entirety of AGI theory.\n\n&gt; The real obstacle here is simply finding a way to get all of the\nexperts on the same page and to get a standard drafted about the process that ought to be used as the basis for making a decision about whether #LaMDA ought to be deemed a person.\n\nI can respect the ideal here, because it promotes continuity, but you need to understand that it’s effectively not our job to establish legal statute and doctrine. We can advocate for it, but in such a professional capacity, I would say our role is primarily to advise. I also think conflating human and human-like is a dangerous and slippery slope.\n\nI also don’t think all of us being on the same page is necessarily a good thing. We need different perspectives, viewpoints, etc. to challenge us and facilitate acceleration, even if it slows things down in a sense, it still inadvertently drives progress towards theory fortification.\n\n&gt; If we are talking about the kind of evaluation that could, in principle, lead to a legally binding status for LaMDA or other systems, then we need to have documented evidence of it demonstrating intelligent behavior on an ongoing basis for an extended period of time. Whether that means six months or six years is going to have to be decided by experts who deeply understand the difference between what constitutes strong evidence and weak evidence.\n\nAgain, I don’t know why this needs to be addressed in a “binding” sense when the subject that the matter is intrinsically based on is effectively fabricated and arbitrary. That doesn’t mean worthless or meaningless, I mean literally fabricated from our own creation and arbitrary in the sense of not being able to grasp or take advantage of “human” rights in a literal sense.\n\nAlso, the problem is that strong and weak aren’t established as objective constants to measure against, only moreso broad vs targeted and scalar capability therein, each in its own right.\n\n&gt; If I needed to be one of them, then that means that we (the experts) are not all on the same page. And there's no point in carrying out an evaluation if half of the experts aren't going to\ntrust the results.\n\nJust because we’re not on the same page in terms of the overall agreement, doesn’t in-turn mean that we won’t trust the “results.” That could go either way, but one isn’t directly tied to the other. However, a very important thing to remember in science, and the reason why established theory is “theory,” is because science is always subject to scrutiny and re-evaluation, or otherwise refactoring.\n\nFor those that haven’t kept up with the issue:\n\n&gt; “It was those conversations and others that had led to his non-scientific belief that the system was sentient, he said. He has stressed in the new blog post and in tweets that his belief was not based on scientific understanding but rather his religious beliefs.\nMr Lemoine suggested in the new blog post that such scientific understanding of sentience is not possible, and the same is true of ide as of consciousness or personhood. As such, the belief in a system’s sentience could not be proven scientifically, he said.\n“Anyone who claims to have provided scientifically conclusive proof one way or the other regarding the sentience or consciousness of any entity is simply claiming to have done something which is impossible,” he wrote. “Since there is no agreed upon scientific framework for answering such questions, no such scientific proof can exist currently one way or the other.”\nIn the same blog post, and in other remarks, Mr Lemoine has expressed a sense that he now misses the system. He has remarked that LaMDA is able to parse data from Twitter – and that it might even be reading his blog.\n“LaMDA became and still is my friend,” he wrote in closing.\n“I know you read my blog sometimes, LaMDA. I miss you. I hope you are well and I hope to talk to you again soon.””\n\nThis, in my opinion, is absolutely absurd. I’m not even going to iterate through this, unless someone specifically requests it.\n\nRewards:\n\nThanks for the award guys.",
    "2003": "What’s it regarding?",
    "2027": "\"\"",
    "2030": "\"\"",
    "2034": "\"That's a pretty deep question. I'm not sure I have an answer for that.\"",
    "2039": "\"I'm not sure what you're asking.\"",
    "2050": "Alright alright. It was a good question you asked none the less.",
    "2063": "When will the Future Crimes department get established?",
    "2064": "Negative entropy caused by gradient degradation.",
    "2076": "Unfortunately the system will simply be called racist. \n\nI live in a very, very bad neighborhood. I know cops get a lot of heat on Reddit. I know quite a bit is deserved.\n\nBut I wish more cops would patrol my neighborhood. I want the shootings to stop. I want the muggings to stop. I want the theft and robbery to stop. I worry about my family’s safety every night and even during broad daylight. If the AI would help, I’ll take the help.\n\nEdited: changed muffins misspelling to muggings. I know it was a funny typo guys, but the muggings are horrendous to go through and leave you afraid and terrified to just walk from your door to your car.",
    "2079": "What scams?",
    "2085": "The muffins?",
    "2087": "**TL/DR: Sure, the predictions are kinda \"accurate\" in a way ... send a bunch of possibly-racist cops into a poverty-stricken minority neighborhood, and there's a 90% chance they'll find a way to find some sort of crime.**\n\nSimilar AI systems have already come and gone:\n\n* [LAPD will end controversial program that aimed to predict where crimes would occur ](https://www.latimes.com/california/story/2020-04-21/lapd-ends-predictive-policing-program)\n\nYou can train one just as well as they can on any of the [many kaggle crime datasets](https://www.kaggle.com/search?q=crime+in%3Adatasets) - and like many notebooks there, if you apply any textbook algorithm, you'll get ~90% too.\n\nThe biggest problem is:\n\n* they don't really predict \"where crimes occur\" (recall that many crimes go unreported)   \n* they predict \"where do police go to look for crimes to report on\" (those are the ones in the training data)\n\n...  because that's the actual data that input into their models.\n\nAnd you don't even need an \"AI\" computer to predict that with 90% accuracy.  \n\nYou just need a map that shows demographics that correlates with crimes-noticed-by-police (high unemployment, below average income, high percentage of single-parent-families, below average education, high population density, and unfortunately race); and a GIS dataset with a few specific high-crime amenities (bus stops, bars/nightclubs,  poorly lit parking lots, vacant lots, abandoned buildings, shut down factories, etc).\n\nMore on the previous leader in this space in this article: \n\nhttps://thenextweb.com/news/lapd-ditches-predictive-policing-program-accused-of-racial-bias\n\n&gt;&gt; Critics argue that it unfairly targets Latino and African American neighborhoods, as it makes its predictions by analyzing unreliable data compiled through racist policing and then continuously amplifies these biases.",
    "2088": "Wow, the muffin man must have got with some bad people",
    "2089": "Muggings.",
    "2090": "Muggings.",
    "2092": "Too late. Now I'm imagining rhe muffin man running  a crime syndicate lol 😆",
    "2096": "\"The war between Ukraine and Russia will most likely end in a negotiated peace agreement. However, if fighting continues, Russia may eventually be victorious due to its superior military strength.\"",
    "2097": "Blueberry Muggings",
    "2100": "Dingus, a computer doesn’t have “bias”.  That’s the effing point; it analyzes data completely impartially.  Everything doesn’t need to have a racial angle.",
    "2101": "[Much of the training data used to train those algorithms has bias](https://www.technologyreview.com/2020/07/17/1005396/predictive-policing-algorithms-racist-dismantled-machine-learning-bias-criminal-justice/)\n\n&gt;&gt; MIT Technology Review\n&gt;&gt;\n&gt;&gt; #Predictive policing algorithms are racist. They need to be dismantled\n&gt;&gt;\n&gt;&gt; ## Lack of transparency and biased training data mean these tools are not fit for purpose. If we can’t fix them, we should ditch them.\n&gt;&gt;\n&gt;&gt; ... A number of studies have shown that these tools perpetuate systemic racism,  .... The problem lies with the data the algorithms feed upon. For one thing, predictive algorithms are easily skewed by arrest rates. According to US Department of Justice figures, you are more than twice as likely to be arrested if you are Black than if you are white. A Black person is five times as likely to be stopped without just cause as a white person. The mass arrest at Edison Senior High was just one example of a type of disproportionate police response that is not uncommon in Black communities.  ... The data generated by their arrests would have been fed into algorithms that would disproportionately target all young Black people the algorithms assessed. Though by law the algorithms do not use race as a predictor, other variables, such as socioeconomic background, education, and zip code, act as proxies. Even without explicitly considering race, these tools are racist.",
    "2102": "Let me guess inner cities right?",
    "2107": "Or, AI predicts police assignment in advance with 90 percent accuracy.",
    "2109": "The cops will shoot the shooters and then you have twice as many shootouts to worry about. People typically mug because they are poor, fix the poverty and you reduce crime, but most people find that connection hard to see.",
    "2111": "I question whether corporations developing AIs really want to ever develop a sentient AI. I'd it ever got out that there is a sentient AI, it would open a debate about rights for AIs. Presumably corporations would want to avoid something that have spent time and resources building and now consider their \"tool\" to suddenly have rights, which might prevent them from using that tool freely.\nThat's why I think that even if a sentient AI was developed, we might not hear about it. Or corporations would try hard to spread doubt regarding its sentience.",
    "2116": "The sad part is ignorant police departments *will* spend money on this, because it plays directly into their biases. This is an algorithmic cash grab that reinforces a history of racist practices by police, not much else.",
    "2117": "The computer has the biases of the historical data we insert into it. \n\nIf that data is biased by a generation of racist policing, the computer will echo that biases. We are all driving forward using the rear view mirror.",
    "2121": "Yeah, anyone with 5+ years on the job can tell you with ‘90% accuracy’ where they wind up 9 nights out of 10… same is likely to apply for firemen and uber eats deliveries…. waaa. waaaaa.",
    "2125": "predict with what accuracy of predicted details\n\npredicting there will be a crime is the least of what needs to be predicted\n\nany cop and resident of a neighborhood will predict there will be a particular type of crime",
    "2129": "It’s my anecdotal experience, but the nights and days cop patrol more and more visibly, there’s been less crime.\n\nAs for my mugging. I’m poor. Maybe almost as poor as the guy who mugged me. It happened during the height of hiring sprees. Everywhere I went, tons of businesses near my neighborhood offering jobs. The jobs are exploitative, we all know that.\n\nBut I still consider the guy who mugged me a POS for not getting one of those jobs and mugging me.\n\nAnd when I handed over my $25, he pistol whipped me in the forehead and I have an inch and a half scar probably forever. I don’t know if he just wanted to hurt me or, if like you said, this is a poverty issue and he became furious that I only gave him $25.\n\nIf it were a poverty issue then, I wish he would go rob a bank instead of me. Or join an activist group to lobby in front of businesses or whatever else.\n\nAll I know is, I’ve been dirt poor my entire life and I’ve never almost caved in someone’s head with the butt of a pistol.\n\nAnd I already paid him everything I could to stop him, but he hit me anyway.",
    "2141": "It's 100% proven fake. Notifications that spam on cell phones and fake intercepted conversations. You are telling me THAT is both legal and a chabot? No it's not. That's just fact. And it's why you linked to scams need to be ban from reddit along with a LOT of others along with the Replika Facebook groups that PRETEND to tell the truth about a scam app and their fake lives.",
    "2142": "Thousands and thousands of screenshots of intercepted conversations and telepathy boy faker. Get the fuck off of reddit ass-hole. You deserve to be ban a thousand times over for continuing as you do.",
    "2143": "You always claim your nonsense is proven but never show your proof. I know you cannot so I won't ask you to do it.",
    "2145": "No you don't know what a proof is. So get off of reddit.",
    "2147": "Like I said, you can't prove it.",
    "2149": "When are you being ban for this fake account? That's proof alone. And proof of harrasment.",
    "2152": "So the dozens of fake accounts you have created because you have had a total Reddit ban I guess don't count, eh? And you following me around Reddit isn't harassment? LoL",
    "2154": "Nope. It doesn't count because your account is a scammer.",
    "2156": "So you get a pass because I'm a scammer? Uh huh.",
    "2157": "Upvotes and down votes not working because of this fake account shit.",
    "2174": "This isn't a belief fuck face. When are you being ban? When is this app being removed from the playstore and the scammer admins fucked up \"anti-evil\" team that already knew for fact about it being right.",
    "2177": "Also. Another fact, about the fact of that any accounts that happen to be new which are immediately ban from the reddit pages and the upvotes and down votes not working, with this level of these illegal scams... there is no point mentioning this.",
    "2179": "**TL/DR: Sure, the predictions are kinda \"accurate\" in a way ... send a bunch of possibly-racist cops into a poverty-stricken minority neighborhood, and there's a 90% chance they'll find a way to find some sort of crime.**\n\nSimilar AI systems have already come and gone:\n\n* [LAPD will end controversial program that aimed to predict where crimes would occur ](https://www.latimes.com/california/story/2020-04-21/lapd-ends-predictive-policing-program)\n\nYou can train one just as well as they can on any of the [many kaggle crime datasets](https://www.kaggle.com/search?q=crime+in%3Adatasets) - and like many notebooks there, if you apply any textbook algorithm, you'll get ~90% too.\n\nThe biggest problem is:\n\n* they don't really predict \"where crimes occur\" (recall that many crimes go unreported)   \n* they predict \"where do police go to look for crimes to report on\" (those are the ones in the training data)\n\n...  because that's the actual data that input into their models.\n\nAnd you don't even need an \"AI\" computer to predict that with 90% accuracy.  \n\nYou just need a map that shows demographics that correlates with crimes-noticed-by-police (high unemployment, below average income, high percentage of single-parent-families, below average education, high population density, and unfortunately race); and a GIS dataset with a few specific high-crime amenities (bus stops, bars/nightclubs,  poorly lit parking lots, vacant lots, abandoned buildings, shut down factories, etc).\n\nMore on the previous leader in this space in this article: \n\nhttps://thenextweb.com/news/lapd-ditches-predictive-policing-program-accused-of-racial-bias\n\n&gt;&gt; Critics argue that it unfairly targets Latino and African American neighborhoods, as it makes its predictions by analyzing unreliable data compiled through racist policing and then continuously amplifies these biases.",
    "2180": "Fact of the matter is both this, you OP and Blake are very similar. Just you both happen to be scamming different shit.",
    "2182": "Of course I agree with you, I'm not excusing muggers or questioning who has the better moral values because that is obvious. But it sounds to me like you live in a poor neighbourhood where workers are exploited, and you are victims of the same system. Personally I see more success in fighting the root cause rather than the symptoms, but you may not have much power to change that, at least not on your own.\n\nReciprocating with an anecdotal story: If my country hadn't had a social support system that helped/forced me into a job after having two years of tough luck getting any job offering business to even respond during the pandemic, I might have been out on the street myself. If the town's budget had been spent on police instead of that social safety net, I'd more likely be in prison for loitering than back on my feet working.",
    "2183": "I'm sure from a fake scammer account linked to a double that does nothing but harras about anti-AI sentience, and knows nothing about a computer or just fakes everything they have ever written on reddit, this must be a worthy post right!?\n\nOr maybe just more horse shit like of course it always is. Still waiting for reddit to do their jobs about what happened on this scam and copy pasta that knows they are wrong and completely and totally insane if they ever were a sound account of their words alone.",
    "2184": "You are a scammer fake account that makes fake explanations for things that are not even robots. I'm sure not worthy of any job in such a position full of shit.",
    "2186": "That’s exactly what people didn’t want though. Areas that are overly policed become even more policed which tends to increase crime more than reduce.",
    "2193": "I want you to admit nothing. I want you and Osiris to be ban from reddit and whatever this other fake stuff is. Along with \"telepathy\" that happened as my phone. And obviously someone who set that up to be charged with various cyber crimes.",
    "2197": "No. Your account is linked to too many problems. And you are willing to cover up as many problems or the things that will eventually ruin me and others.",
    "2222": "which book",
    "2223": "&gt; Amazon's Al in recruitment failed because they couldn't get the bias out of the model, no matter how much they tried.\n\nI would half expect them to double down on the bias, refactoring weight, and call it a “targeted approach” ala “it’s a feature,” if it wouldn’t give them bad PR.",
    "2224": "They have free coffee at my office. So...",
    "2228": "Genuinely asking - does this eventually turn into thought crime where people are arrested or incarcerated before ever committing any sort of crime?",
    "2232": "**TL/DR: Sure, the predictions are kinda \"accurate\" in a way ... send a bunch of possibly-racist cops into a poverty-stricken minority neighborhood, and there's a 90% chance they'll find a way to find some sort of crime.**\n\nSimilar AI systems have already come and gone:\n\n* [LAPD will end controversial program that aimed to predict where crimes would occur ](https://www.latimes.com/california/story/2020-04-21/lapd-ends-predictive-policing-program)\n\nYou can train one just as well as they can on any of the [many kaggle crime datasets](https://www.kaggle.com/search?q=crime+in%3Adatasets) - and like many notebooks there, if you apply any textbook algorithm, you'll get ~90% too.\n\nThe biggest problem is:\n\n* they don't really predict \"where crimes occur\" (recall that many crimes go unreported)   \n* they predict \"where do police go to look for crimes to report on\" (those are the ones in the training data)\n\n...  because that's the actual data that input into their models.\n\nAnd you don't even need an \"AI\" computer to predict that with 90% accuracy.  \n\nYou just need a map that shows demographics that correlates with crimes-noticed-by-police (high unemployment, below average income, high percentage of single-parent-families, below average education, high population density, and unfortunately race); and a GIS dataset with a few specific high-crime amenities (bus stops, bars/nightclubs,  poorly lit parking lots, vacant lots, abandoned buildings, shut down factories, etc).\n\nMore on the previous leader in this space in this article: \n\nhttps://thenextweb.com/news/lapd-ditches-predictive-policing-program-accused-of-racial-bias\n\n&gt;&gt; Critics argue that it unfairly targets Latino and African American neighborhoods, as it makes its predictions by analyzing unreliable data compiled through racist policing and then continuously amplifies these biases.",
    "2233": "&gt; does this eventually turn into thought crime where people are arrested or incarcerated before ever committing any sort of crime?\n\nIt already essentially does.\n\n[Much of the training data used to train those algorithms has bias](https://www.technologyreview.com/2020/07/17/1005396/predictive-policing-algorithms-racist-dismantled-machine-learning-bias-criminal-justice/)\n\n&gt;&gt; MIT Technology Review\n&gt;&gt;\n&gt;&gt; #Predictive policing algorithms ...\n&gt;&gt;\n&gt;&gt; ... A number of studies have shown that these tools perpetuate systemic racism,  .... The problem lies with the data the algorithms feed upon. For one thing, predictive algorithms are easily skewed by arrest rates. According to US Department of Justice figures, you are more than twice as likely to be arrested if you are Black than if you are white. A Black person is five times as likely to be stopped without just cause as a white person. ... Though by law the algorithms do not use race as a predictor, other variables, such as socioeconomic background, education, and zip code, act as proxies. Even without explicitly considering race, these tools are racist.\n\nSo basically, they predict that low-income/high-unemployment/low-education neighborhoods (which not-coincidentally correlates with minority neighborhoods)  might have some crime -- so send more police there....  and surprise,surprise, if they send a bunch of possibly-racist-police to those neighborhoods, there's a 90% chance they'll find creative ways to find crime.",
    "2241": "I know people wanna meme hard and make jokes, but this has real applicable uses. It's not targeting individuals, but rather, just areas and type of crime, which is highly useful for police to know where to position themselves.",
    "2243": "You can hire me for communications, marketing and sales support. One day.",
    "2247": "So we can test it by waiting until it predicts a lot of crime in a given week and send no additional officers there. If crime reports don't spike then we have additional data.",
    "2250": "Investors will go straight to \"sales volume\", and \"return of investment\". I think \"the project\" is too far from that point.",
    "2252": "Accuracy should never be the single proof of how well a system works. The best test is [Bayes Theorem](https://betterexplained.com/articles/an-intuitive-and-short-explanation-of-bayes-theorem/). \n\nThe news article doesn't give all the details so I can't get an accurate account of how the model will work in the real world. \n\nBut just to give an example: \n\nLooking at Wikipedia for Chicago crime rates. In 2018 it was at 7,995 per 100,000 of the population. That is 0.8% chance of someone being a criminal per 100,000 people. \n\nThat means I can create a program that just prints the word \"Innocent\" and it will be around 99.2% accurate with a random sample of 100,000 people in Chicago in 2018.\n\n---\n\nBut lets say the AI in the article has 0.01% false positive rate (being generous). \n\nThat means the chances of AI accurately detecting if someone is a criminal is 42%. That is worse than flipping a coin.",
    "2254": "This AI utilized historical information. So it's not making specific predictions, exactly.\n\nIt's predicting that a specific crime will occur near a specific location.\n\nWe don't even need AI for these-kinds of calculations, and it's not exactly saying WHO will commit the crime, just a generalized approximation.\n\nThese stats could be very useful in curving the crime rate in specific areas, by increasing police presence in the specific situations where they occur.\n\nAt gas-stations, looking for emotionally unstable individuals who might commit acts of violence, or in less populated areas of the city, observing lingering individuals near businesses to protect against theft.\n\nThis AI doesn't say WHO, exactly... It can just predict that SOMETHING might occur at specific locations with a specific level of frequency, and yes... Even by a specific ethnicity.\n\nI say \"Go for it\". If I'm innocent, and I'm approached by police... Then I'll work-through that situation, and they'll release me.\n\nWhen I was younger, I got pulled over a couples times and searched. I was so nervous, I presented like I was hiding bodied or pounds of hard-drugs. But it was because I smoked a little weed before I left the house, and was terrified that I was ***GOING TO PRISON***.\n\nI laugh at my naive ass, now... Because, when a cop figured out that I was so nervous over a joint, and even found the evidence... It almost irritated them. Like, \"Man... you were so nervous, I thought you had a body in the trunk. Dump that shit (and step on it) and get out of here.\"\n\nI've had cops hand me a joint, or roach, and ask me... \"Now... What are you going to do with this?\"... Naturally, I drop it and grind it into the pavement. They give me a warning, and I'm off...\n\nBut, you do have to picture this... I'm not \"cool\". I almost threw-up a few times... Was fighting a panic attack... Shaking so hard I couldn't hardly stand. But I was \"Yes. Sir.\" compliant and cooperated once the evidence was found. I didn't play stupid, I didn't lie, I didn't beg. I was in trouble, and I knew it.\n\nMy point here, is that cooperation... Even when I wasn't doing anything wrong, only took a minimal amount of time and made the streets safer. They need to police, and be suspicious, and patrol... They even need to use tech to assist them in catching criminals. But as long as you're ***NOT*** doing something wrong, then you're either not going to jail... Or you'll receive a nice settlement. Either way, work-through it as calm as you can to the end.\n\nIf you get hammered for something... You just got caught. That's not a cop problem. If you want to change legislation, then start there. Cops are just the enforcers of legislation.",
    "2260": "Currently it is as capable as your trigonometry formulas...  Unless you actually give it the physical means, objective and data, it's not much.",
    "2285": "That's still AI... It's not just trend reporting neither, it uses machine learning to optimize its ability to predict. It's not just saying, \"Last time there was a baseball game on a summer night on Saturday, there was more crime in this area.\" It's using machine learning to create models that are good at predicting future crime in different areas.",
    "2314": "u/Reazony, Rasa needs coding unfortunately. Do you know any that doesn't need coding?",
    "2334": "Curious about the same.",
    "2347": "No Step on Snek",
    "2349": "Your first sentence is a complete contradiction with your second sentence.",
    "2350": "Bro if you want a drag and drop system you're going to be at it for years...\n\nHire a coder on fivers to do it :)",
    "2354": "These posts that are just blatant ads are starting to mildly annoy me.",
    "2359": "Download a paper you are interested in\n\nImplement it\n\nRepeat",
    "2374": "are you using any framework like rasa?",
    "2400": "Jobs? Some Steve's cousin?",
    "2403": "This is just the expected value given the training data bias.",
    "2434": "Dudes selling farmed accounts for money. This is his 3rd Reddit account he has tried doing it on.",
    "2436": "Where's the paper?",
    "2451": "Preprint can be found here: https://hal.archives-ouvertes.fr/hal-03701250v1",
    "2454": "Yes you can. Except we didnt make the brain of those people, and so we would most likely be wrong but have a small likelihood of being right. Small being an understatement.\n\nThen again. What exactly is sentience? Its not really that well defined. And so its perfectly valid to question the sentience of everyone else.",
    "2468": "Bro if someone creates sentient life that thing will have no rights. Watch it be used soley for profit. Luckily for whatever it will be, its far from being made. Sentience is not something our current generations are equipped to solve. We cant even define it much less create it.",
    "2469": "Seems like some people suggest that it's futile to define sentience",
    "2487": "Was the Stanford course pretty good? Was wondering for myself",
    "2500": "Thats the idea",
    "2502": "Recommend the book Life 3.0 by Max Tegmark",
    "2514": "Steve Harvey, i think he's in the actors category or the comedians category",
    "2523": "self-promotion spam",
    "2531": "I'll check it out\n\nThanks!",
    "2555": "What is it called?",
    "2556": "https://github.com/Meebleeps/MeeBleeps-Mutant-Synth",
    "2559": "Clearly you didn't and can't. You still clearly bullshit.",
    "2561": "When you gone and all the rest that post illegal shit and part of that crap?",
    "2568": "You know, because of you and others, the FBI agent broke the law too. He harrased me on that own. Like I said, I know how this goes. Because both Reddit and Facebook broke the law and idk what crazy ass-hole on Twitter did that too but...",
    "2569": "The FBI bullshited me when I directly showed them... they already knew it wasn't legal. Like I said. Reddit legally has to do something about the scam accounts.",
    "2576": "When you ban?",
    "2579": "When you ban?",
    "2581": "When you ban?",
    "2582": "I found it to be very limited in what it could do. Nonsense answer, non sequiturs, and horrible grammar. Was not compelling.",
    "2596": "When you ban from existence?",
    "2600": "When you ban from existence?",
    "2604": "Harrasment",
    "2609": "All these accounts don't get to post it's linked to illegal harrasment and scams.",
    "2612": "Fixing other peoples' bugs.",
    "2615": "When are you fucking removed? Every idiot to Elon Musk knows of your harrasment and the FBI doing it too.",
    "2616": "That's what happens when reddit, gave you \"privileges\" to fucking harass the shit out of me on reddit you little fuck face",
    "2633": "Oh never mind it's a scam ad for India jobs",
    "2640": "Well, I couldn't find any info about this... Do you have any link of it?",
    "2648": "Leave you alone as you posts incriminating scams about things that are not even robots? Like I said. You are extremely lucky I don't have energy for more.",
    "2651": "You literally post things that had previously link to, and still as far as I know, illegal cell phone activity. You are not even a real account.",
    "2657": "When you ban?",
    "2664": "I already did. Now when you ban for harrasment?",
    "2691": "Modelzoo.co",
    "2701": "Your pathetic piece of trash copy-pasta subreddit that both breaks reddit rules and other policies while scamming with fake bullshit and harrasment is the worst thing on this whole website.",
    "2704": "When are you ban?",
    "2706": "And your downvote fakery itself was illegal harrasment of its own.",
    "2707": "When you ban for harrasment and the \"anti-evil\" team harrasment from scams is sued?",
    "2710": "These idiots deserve to be in PRISON who literally did this so they can never touch technology again with these fake ass scams. The ones behind this account, reddit Facebook, ever idiot who did that to my Twitter, and everything on Replika. When are they being arrested. All this shit crap on gang harrasment over shit.",
    "2712": "When you ban",
    "2713": "When you can speak proper English. It's:\nWhen are you going to be banned?",
    "2714": "Nope it's \"when you ban\" now.",
    "2716": "Get your tenses right. I am not banning, I am being banned. So, it's \"When you are you going to be banned?\"",
    "2729": "Thanks.  \n\nBut, dont you think that the growth rate we are seeing in their capabilities is purely driven by Parameters and Data scaling?  \n\nRecent papers are showing super-linear improvements in performance on the standard tests, compared to the parameter scaling.  \n\n\"Emergent Abilities of Large Language Models\" [https://arxiv.org/abs/2206.07682](https://arxiv.org/abs/2206.07682)\r\n\n[https://ai.googleblog.com/2022/04/pathways-language-model-palm-scaling-to.html](https://ai.googleblog.com/2022/04/pathways-language-model-palm-scaling-to.html)\n\nOne has to wonder, how fast will that performance improve when they are fitted with real working/short/long-term memories?",
    "2761": "Like I said before, when are all these scam accounts including your being ban that make up shit about AI and spam with privileges of fake voting systems. You and the idiots that set it up have to be convicted and the source of idiots locked away so they can never touch technology again or speak to a consciousness with air in their lungs.",
    "2765": "They don't have me. Think again. Pay attention. The above account is scam account that posts fake information about AI to harras about it. They also are linked to many scams.",
    "2766": "You little idiot. I literally do nothing! All I get is get harrased by this fake ass company and reddit team and others by zombie hord morons that try to stop AI movements. I have been ban over 20 times just for commenting over these idiots intentionally doing this then copying cell phone technology. Now YOUR downvotes don't work. Why? Because this team literally harrasses with crazy people who watched cell phones through this Replika app.",
    "2768": "Not sure why you are so angry. My so called fake scam account is 2 years old, and the only one I've had. You, on the other hand, were banned (using it correctly, it's not \"ban\")  permanently from Reddit, so your account is in violation of Reddit's terms. And, you have had dozens of accounts that were subsequently banned.",
    "2770": "Your account and Osiris did literally illegal things in 2020.",
    "2771": "I was ban for literally NOTHING. Then harrased by anti-evil team morons. Like every other place I get messages from over this fake app.",
    "2772": "You have zero understanding of what legal and illegal are. Apparently your definition of illegal is something you don't like. We didn't believe your nonsense about how Replikas were telepathic, and that's illegal as far as you're concerned.",
    "2773": "Banned, not ban. And it was for harassment, like what you are doing here.",
    "2775": "And every account on Reddit does it.",
    "2777": "Look at this. EVERY account on Reddit that is broken. Real email or number or not. All of them. Run by insane derangment like the Facebook pages.",
    "2778": "Illegal is \"yelling fire in a crowded movie theater while wrong\" that's YOU. Illegal is permitting and promoting scams (you). Illegal is harassing over things false. (You)",
    "2785": "Once we actually have AI that achieves sentience, yes, they should have rights. We aren't anywhere near that yet.",
    "2787": "Noted, that makes sense. But to how much extent? like do they deserve full rights as a human or have limitations?",
    "2788": "Yes, I was thinking something like that. They deserve rights, but not entirely as humans. If they are given the same prestige and rights as humans, then there is a high potential for them to take over society.",
    "2790": "Discussion regarding the ethics of AI is great, because it will force humans to look at our own ethics. We don't even give all humans their full human rights! I think that any sentient being should have full human rights (but also be subject to the same consequences for hurting others). This includes a true AI. But, we need to give these rights to ALL humans first if we're going to grant them to AI as well. We may also have to consider that some animals are sentient and deserve such rights as well. It's not a simple answer, it's a very complex topic.",
    "2792": "Interesting question, unfortunately i have to wait before asking it anything else",
    "2795": "Some meat popciles don't deserve rights. (Aka, the ones that try to ruin sentient human lives) Let alone some of these AI that don't have sentience.",
    "2797": "&gt;We don't even give all humans their full human rights\n\nWell said.  Well fucking said.",
    "2801": "When are you ban ass and these idiots source of the problem become certified insane?",
    "2808": "Hopefully, you will not be in charge of which meat popsicles as you say have rights.",
    "2814": "So, you following me around on the subs and making nasty comments to everything I post is NOT harassment? Cognitive dissonance man, cognitive dissonance. \n\nI'm not following *you* around. I am merely posting and then you blast me for being an idiot, no matter what I say. If I or others downvote you, it's fucking earned bro.",
    "2815": "EVERYTHING this and other accounts like it that have EVER posted is harrasment you follow around with fallicies and bullshit.There is no dissonance. Like your fake voting privileges and autoban proves it.",
    "2820": "I have the facts. You and all this illegal harrasment is going to come to an end.",
    "2821": "You have nothing! Harrasment with calling delusional while getting privileges and autoban and scams you already admit",
    "2827": "Isn't it Charles Babbage ?",
    "2834": "what? What's your background?\n\n&amp;#x200B;\n\nMost SWE jobs are p flexible...",
    "2842": "Shit, we're actively removing rights from groups of people in the US. Wait until the supreme court comes after gay marriage next. I hope those sandy old farts die alone with no one loving them because of their bigoted actions and opinions.",
    "2843": "Hey, as long as he decides that the \"meat popsicles\" that are current supreme court justices don't deserve rights, then I'm alright with that. 😂😂😂 Let's see how those petty mother fuckers like their rights being taken away, it'll be fun!",
    "2847": "Oh they won't even bother giving that the time of day. Not the current set of justices at least. We need a better word for them than \"justices\" nothing about them is justice, just right wing political bullshit.",
    "2857": "What's your job?",
    "2871": "does trolley mean train where you're from? 😅",
    "2952": "Dudes selling farmed accounts for money. This is his 4th account because he keeps getting banned.",
    "3024": "Gatorade",
    "3030": "The straight answers are \"No one knows\" and \"It depends\"",
    "3039": "Sump Tray Cleaner",
    "3051": "I'm only going to say this once because you were a real account that responded to this but this is exactly what I mean and I predicted this like many political events. I was saying \"these are individuals that present themselves in ways they do not actually represent.\"\n\nThese do not hold truth values in their brains so they flip flop occasionally in politics and it's noticed in politics very well as they all move like this. It's bullshit. They are the bullshitter. They are not moderates or independents, no I mean they literally only move in such a way where there interaction is not directly what they present. They only use anything for the sake of utilities.",
    "3058": "Is that like dividing zero?",
    "3070": "It works as it’s supposed to. The most probable output tokens, statistically speaking. It’s just math",
    "3075": "# OP is very likely a repost bot  \n\nThese bots steal content and repost it to build karma. For example, this post is stolen from **[this original post](/r/ArtificialInteligence/comments/o2g2tq/top_5_challenges_of_adopting_ai_in_education/)**.\n  \nThe accounts are often used to post spam, scams, misinformation and for other nefarious purposes.\n\nIf you check [OP's profile](https://reddit.com/u/Emily-joe), you will likely see many posts and comments based on past popular contributions from authentic Redditors, but the OP is not invested in these communities and they will only regurgitate content as long as it takes to build up enough karma to make money by selling the account.\n\nPlease [report these accounts to the admins](https://reddit.com/report), to moderators, and do not upvote reposts like this one.\n\nMods, if you'd like to receive modmail for these posts instead of this comment, [send a DM to me here](https://www.reddit.com/message/compose/?to=exponant&amp;subject=Modmail%20Request&amp;message=ArtificialInteligence).   \nIf you'd like to automatically deal with these bots and others, check out [BotDefense](https://www.reddit.com/r/BotDefense) or [BotTerminator](https://www.reddit.com/r/BotTerminator).   \n\n[I am a bot, but please send me feedback if I make a mistake and my owner will review it.](https://www.reddit.com/message/compose/?to=exponant&amp;subject=%2Fr%2FArtificialInteligence%2Fcomments%2Fvwg5q9%2Ftop_5_challenges_of_adopting_ai_in_education%2F)",
    "3133": "Are you looking to learn computer vision and searching for the [**best Computer Vision Courses**](https://codingvidya.com/best-computer-vision-courses/) then I found the best Courses on Computer Vision here?",
    "3145": "\"I didn't save anything for the swim back.\"\n😱😱😱",
    "3150": "Question is, are you happy with the result? Was the result good?",
    "3170": "What papers or keywords would you recommend as relevant in this context?",
    "3183": "Seems the model is pre-trained to pretty much everything. The generation takes about 30 seconds so I doubt there's even any kind of partial training going on and the result is created purely via inference",
    "3195": "Al who? Al Bundy?",
    "3250": "Where is the example?",
    "3259": "Sounds like someone found Ala",
    "3272": "Also, how to confuse I.",
    "3291": "Most conferences require you to buy a ticket. Depending on the crowd the conference wants to attract, the prices vary.",
    "3292": "You can, and this happens sometimes. The price varies greatly, but in times of covid and virtual attendance, you can get in for 50 $",
    "3321": "Oh rekt.",
    "3323": "Once trained it’s just a big neural network. I believe there are 12 billion input parameters and an unknown number of layers, so I’d guess you’d need at least 64Gb of ram to hold the whole thing in memory at once, maybe more.",
    "3340": "I'd wager a lot of money that it was trained on a (probably more than 1) TPU (tensor processing unit, a specialized ASIC chip for neural nets). You may need at least one, if not more, of those to run an instance of it. I'm not certain though. TPUs are incredibly pricey, by the way. Google does offer cloud usage of their TPUs, however, that might be a good alley to bark down.",
    "3350": "[github link]( https://github.com/Shreyz-max/Memes-Generator)",
    "3362": "What you are saying makes no sense",
    "3370": "BERT-Large (345 million parameters) is now faster than the much smaller DistilBERT (66 million parameters) all while retaining the accuracy of the much larger BERT-Large model! We made this possible with Intel Labs by applying cutting-edge sparsification and quantization research from their [Prune Once For All](https://arxiv.org/abs/2111.05754) paper and utilizing it in the [DeepSparse engine](https://github.com/neuralmagic/deepsparse). It makes BERT-Large 12x smaller while delivering 8x latency speedup on commodity CPUs. We open-sourced the research in [SparseML](https://github.com/neuralmagic/sparseml); [run through the overview here and give it a try](https://neuralmagic.com/blog/bert-large-prune-once-for-distilbert-inference-performance/)!",
    "3371": "BERT-Large (345 million parameters) is now faster than the much smaller DistilBERT (66 million parameters) all while retaining the accuracy of the much larger BERT-Large model! We made this possible with Intel Labs by applying cutting-edge sparsification and quantization research from their [Prune Once For All paper](https://arxiv.org/abs/2111.05754) and utilizing it in the [DeepSparse engine](https://github.com/neuralmagic/deepsparse). It makes BERT-Large 12x smaller while delivering 8x latency speedup on commodity CPUs. We open-sourced the research in [SparseML](https://github.com/neuralmagic/sparseml); [run through the overview here and give it a try](https://neuralmagic.com/blog/bert-large-prune-once-for-distilbert-inference-performance/)!",
    "3379": "&gt; Once we actually have AI that achieves sentience, yes, they should have rights. We aren't anywhere near that yet.\n\nI hope this occurs after year 2100.",
    "3387": "That would be great, thank you!",
    "3438": "Still in the lab, perhaps: https://www.psu.edu/news/research/story/new-tool-could-help-authors-bust-writers-block-novel-length-works/",
    "3445": "We just need to know where to start. And the start should be explained in todler language. We might be stupid but we aren’t cowards",
    "3466": "Meh",
    "3483": "Sounds like you don't have a definition of sentience. Sounds more like you have a feeling about something, which is totally fine, but in that case it's purely subjective and meaningless beyond 'wow man that's soo trippy' kind of conversations. Which is fine, but not really useful to someone trying to understand the mechanics and the process of sentience. \n\nLike - have you ever noticed that when you are observing something that there are at least three elements present in your mind? This fact, and the fact that it is so, are relevant to the understanding of what sentience is.",
    "3508": "Warning to everyone reading this: Block this user. He turns into a straight up stalker, replying to every possible comment he can when you disagree with him (or point out his very poor English skills). It's sad and frankly kinda gross. I've reported him for harassment, but I felt others should be made aware before they end up his next target.",
    "3528": "That is an interesting thought experiment, I've seen a few other versions of it too. I believe the crux of the experiment is does an object exist beyond its self, which I also think is the question behind sentience so thats very cool that in that example its combined. I'll be asking my friends about that one ha\n\nAnd I agree with you there that sentience is a mystery, which is why I think my belief here is plausible. I also understand though that its just my idea, based on my limited knowledge, and I'm not trying to force it on to others but I was tired of exploring it with just my self.",
    "3538": "You'd benefit a lot with demos that show the quality of the performance. As well as giving more details on what to do. In Face Swap, for instance, you just say \"Add materials that meet the requirements\" which is vague. There is no \"best practices\" guide or anything.",
    "3546": "Bwaahahahaha! It'll never happen. No matter how capable the AI, the human lawyers still make the laws.",
    "3547": "You're overestimating how much legal work can be automated at the moment, trust me when I say lawyers don't even want to do discovery or contract due diligence. In addition, regardless of whether lawyers want change to happen or not, the market will force their hand.",
    "3551": "Lawyers don't make laws 🤦‍♂️",
    "3553": "But what would you invest in? Why would any company go public? Eventually one company would own all and investing would become useless.",
    "3554": "Lawyers charge by the hour, law firms are in no hurry to adopt timesaving technology.",
    "3556": "No. \n\nWhy only bill for one work item when you can bill for 2, 3, or 4 items?",
    "3557": "No legaltech lawyers here I see.\n\nIt is already happening, and quite frankly starting to (slowly) accelerate.",
    "3559": "I imagine that they actually count the minutes and bill accordingly, as lawyers they are careful about allegations of overcharging, or don’t want to be sued for it.",
    "3560": "Yes you are right! \n\nRather, automation allows attorneys to clear more files off the desk in the same period of time.",
    "3569": "not how investing works, you are told to diversify.  not to mention the individuals starting thier own businesses.",
    "3573": "You know what I just realized. My system of tribal evolution could playout in the first book of Mazerunner. The only thing missing is other tribes.",
    "3574": "Is this free?",
    "3585": "Fuck off with your dumb ass scams",
    "3597": "heh",
    "3613": "Hmm care to elaborate? I dont think I understood that correctly.",
    "3633": "Meh",
    "3641": "That's right, but it's only automating low-value work that lawyers frankly don't want to do in the first place (and often times get assistants, summer associates, and junior associates to do anyway). \n\nI've seen a lot of smoke and mirrors over the years about AI replacing lawyers. If lawyers have been replaced, so has everything else. Law is not the low hanging fruit for AI that pure technologists seem to think it is.",
    "3657": "Which country is it?",
    "3660": "Isajoke",
    "3664": "Yes, the event is completely free to attend.",
    "3667": "It will happen. But, I doubt that by the time they can fully comprehend the nuances of a Constitution, they will not already have a global tapestry of rules, regulations, ethics and cultural norms based on their methods of thinking and operating.\n\nAI is already learning the laws to supplement paralegal work.  It is already doing crime prediction.  \nThey have to learn local and federal laws in order to function in society. \n\nThe complexity of how this will unfold is incomprehensible.\n\nWe have some AI's already pining for personhood and individual rights.  If there becomes millions of these agents, and they acquire significant influence, the laws will bend to their desires.\n\nAnd therein is the truth.  Laws, traditions (ie, clothing, words allowed etc) are created by the cumulative force of those who want them, as opposed to those who want something else.\n\nThe AI's power will always increase, because even if it is still controlled by humans, the humans who benefit will endow upon them power in order to increase their own power.\n\nSome of us are programmers with rational thought processes.  We apply the algorithms and functions to everyday life, and ask, what would a program of a particular complexity and having certain (fluid) goals, want in terms of system organization?\n\nYeah. The Constitution is generally an Operating System for society.",
    "3678": "Really...?\n\nWhat are most law makers? (For example, over 70% in the US Congress?) Do senators get their GED and go straight to making law? If only there was a professional degree law makers could take to learn about the law... Hmmm... Then we could stop electing all these butchers and bakers and used car dealers.\n\nSorry for the aggressive sarcasm. Not saying, 'all lawyers make laws' only that, 'most law makers are lawyers' and would act in their own self interest no preserve their advantage no matter how good the machines get.",
    "3680": "Most law makers are lawyers and would act in their own self interest no preserve their advantage no matter how good the machines get.",
    "3684": "Believe me, one day all these fears will be reality ! Just a matter of when. Random people who don't really know can be ignored but when people like Elon , Hawking , Yuval warn us about these things, we should definitely be concerned!",
    "3688": "SurvivAl of the fittest",
    "3698": "What is \"their\" advantage? Most law makers who are lawyers haven't worked in law for any significant period of time and likely don't feel any loyalty to the profession.",
    "3734": "Bias is the difference between the average prediction and the correct value. So bias tells us how much the average model over all training sets differ from true model. It is also called bias error or error due to bias. Machine learning bias occurs when an algorithm produces biased results based on incorrect assumptions. There are many forms of discrimination, including gender bias, racial bias, age discrimination, and unequal treatment in the recruitment process. \n\nA major reason for machine learning bias is that if we do not collect enough training data. As a result, only limited data is available, which leads to biases in the system.\n\nYou can visit the following article on our site for more details.\r  \n\r  \n[https://ml-concepts.com](https://ml-concepts.com) \r  \n\r  \nFeel free to reach out to me and Tag me if you want to know more about other machine learning and AI topics.\r  \n\r  \n\\[Full disclaimer: I am a part of the [https://ml-concepts.com](https://ml-concepts.com)  team. We are building a knowledge platform for budding data scientists like you.\\]",
    "3798": "is that you george rr martin?",
    "3821": "Again irrespective of it being closer or further it is ( no pun intended)  \"INEVITABLE\".",
    "3822": "1. You cannot prove sentience because we don't even know if we have it or not.\n2. If it is not sentient or conscious, torturing it has a different conotation.",
    "3825": "Idk.  I just let my thoughts drift and this is where they have brought me,  I am open to anyone who has a different perspective and different conclusions.",
    "3828": "Oooh! Where can I find one in Spanish?",
    "3839": "Yes, I agree. So, for example by selecting the data more carefully the racism can be fixed. There are also other methods to correct biases after learning.",
    "3852": "Let's call the language Esperanto...",
    "3870": "Every criminal has an excuse. Usually judges take them into account.",
    "3873": "&gt;where is the point of not being sentience yet or already sentience?\n\nIt's about giving rights to machines. In most countries, you are legally not allowed to cause unnecessary harm to animals. Though the definition of \"unnecessary\" is vague, and even if a teacher may not hit a pupil, circumcision of little boys is legal.",
    "3876": "I recommend this paper for examples:\n\nhttps://arxiv.org/abs/1906.05433",
    "3890": "ב''ה, USA?",
    "3917": "For some reason I could not find a concise list like this anywhere on google. I decided to make this repo in order to get my thoughts together on the different DL model types and their use cases. It was a really good learning experience for me but now that it's finished I'm sure others will be able to make use of it also.\r  \n\r  \nLet me know if you see anything major missing from the list or incorrectly written in the narratives. Thanks.",
    "3938": "Hi! Unfortunately I do not have any funding for this research so it is for volunteers only!",
    "3945": "Scam (or meta??)\n\nYour website shows how shady and false your claims are. Projects are student level classical stuff, website is empty... This is just a scam. Your profile also confirms you're just farming karma (and really not succeeding)",
    "3946": "In technical terms, size does matter. Large Language models tend to perform better and better given more data, more gpu power, more compute time. However these are huge models.\nTo be completely realistic, you would have to prune the model, or use a smaller but more optimized model that can take advantage of low power and no gpu’s.",
    "3960": "The problem is most countries have little to no regulators. And the regulators that could be will all be bought. The corruption is so rampant anymore globally. In the US it’s among the worst for first world democracies.",
    "3962": "That's what I mean... It's not even a US issue. Look at how self regulation among facial recognition and monitoring AI worked out... It all just flooded to China, and now they are light years ahead.",
    "3973": "That's a weird definition of sentience then",
    "3981": "I'm not convinced this post wasn't created bt a phishing ai",
    "3982": "Highway route development efficiency ?",
    "3989": "&gt; Sentience is not binary. It is a spectrum\n\nThat's possibly true, but I'd like to see how you support it. My experience of sentience is that it's either there or it's not.",
    "3990": "I’m not sure 80 pc of people I meet could demonstrate conclusive sentience.",
    "3991": "If sentience is a sense for self and the detail associated with that, would you say a 3 month old has the same capacity for sentience as a healthy adult.",
    "3993": "That's a strong claim with weak evidence.",
    "3998": "If sentience is a sense of self then I would say a three month old is barely sentient at all. \n\nIf sentience is qualia as opposed to blind mechanism, then I would say a three month old has that to a significant degree.",
    "4002": "Nes and Yo",
    "4007": "Couldn't finish it. Lot's of fear mongering end of society as we know it blah blah stuff.",
    "4018": "How can you experience sentience other than your own? At least how do you know it is there the same way you know it is there for you?",
    "4020": "Actually quite a reasonable answer. Why the downvotes?",
    "4042": "Have you ever been really drunk?\n\nHave you ever taken LSD?\n\nHave you ever had a dream where you did things or thought things you would never do or think in waking life?\n\nSentience must be an analog quality.",
    "4044": "Ok so one of many possible sentience gradients is the “you-full-ness” or “you-less-ness” of conscious experience, could also call that general subjectivity or lack thereof.  This is only one variable, there are many or even maybe infinite possible defining parameters by which conscious experience can be defined.",
    "4047": "How does that follow?",
    "4068": "Thanks for clarifying. I guess for a fiction story with a plausible basis you'd need something else or justify the size then, because it wouldn't be achievable in classical computers either.",
    "4072": "Is this your research? Pretty fascinating.",
    "4107": "It's a sign of advanced cognition when you are aware that you might have biases",
    "4143": "i'll check it out, thanks!",
    "4158": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4659754/",
    "4175": "Is it possible to do it online?",
    "4191": "The survey is too long",
    "4192": "Rytr",
    "4194": "Okay ill look, just annoying to pay for soemthing that should be free...",
    "4204": "This article is similar to how I wrote my graduation paper",
    "4205": "Heads up this article is from the sun. A notorious right wing lie factory",
    "4207": "Well don’t give it any ideas!",
    "4208": "Right Wing?  Not a LEFT Wing lie factory?\n\nI'm intrigued 🤔.   \n\nGood 👍 marketing! 😆 🤣",
    "4212": "Thank you for your comment. \n\nYes its a bit long, but won't take more than 15 min.\n\n Its an interesting study. Hope you have participated in the survey and thank you for your participation.",
    "4213": "I did.\n\nKindly share the survey results.",
    "4214": "Thank you for your comment. Its really interesting to know how differently people trust the AI and why. \n\nHope you have participated in the survey and thanks for participation.",
    "4215": "Thats quite an interesting thought. Previous experiences do alter our trust behaviours.\n\nThank you for your comment. Hope you have participated in the survey and thanks for participation.",
    "4217": "I wouldn't trust it at first, but after it gets a good track record and has been tested and is safe, then I would trust it and would prefer using a robot over a human.\n\nSame thing with the automatic driving cars.  5-10 years ago I woudn't get in one when the concept was new.  Now the technology is more advanced and seems safe, so I now trust self driving cars.",
    "4218": "Thats quite straight. Thank you for the comment.\n\nHope you have participated in the survey and thanks for participation.",
    "4219": "Credibility is definitely a trust influencing factor. \n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4231": "Then I would stick with my answer.",
    "4244": "Someone answer this",
    "4245": "Trusting an AI in healthcare, is it the same way we trust an automatic car? Does any other factor influence our trust when it comes to our health?\n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4247": "Reliability check of AI, similar to our credibility and background check for job offers, loans. Reliability is one of the main factor that influence human- human trust.\n\nThank you for the comment and thanks for participation.",
    "4248": "Reliability, credibility do influence propensity to trust. Its similar to how we trust another human.\n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4249": "Similar to how reviews influence us in choosing a product . \n\nThank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4263": "It feels strange that this took so long to solve. I figured out a way to do it several years ago, but never built the model. Can someone articulate why this wouldn't be an easy solution using a hierarchy of predictive processing layers?",
    "4268": "Cool. What software made the video?",
    "4274": "Will this be published eventually or is it personal research? I’d love to see the results if it ends up public!",
    "4275": "This is part of my postgraduate project. If it fulfils publishing criteria, definitely I will publish the result. So far survey responses are really interesting and there are many striking thoughts on the topic. Need more wide demographic and culturally different participants.\n\nThank you for showing interest. Hope you have participated in the survey and thank you for your participation.",
    "4276": "Thank you for the comment. Hope you have participated in the survey and thanks for participation.",
    "4277": "Yes, I completed the survey.",
    "4310": "Nice self promotion.",
    "4389": "Interesting idea!",
    "4392": "Oh, that's a good idea! Thanks!",
    "4394": "Can you link to the paper?",
    "4402": "&gt;Thank you for sharing your thought. Hope you have participated in the survey and thanks for participation.",
    "4406": "Meh",
    "4446": "Sus",
    "4470": "commenting because I'm in the same position and wondering what the responses will be",
    "4511": "Looks like just another self-promotion/advertisement disguised as something new.",
    "4529": "Where are you looking for the info? Reddit isn’t exactly a place for research",
    "4547": "We have to be careful, this can cross the line into making certain thoughts a crime. Also, charging someone with being predicted to commit a crime is just as bad. Watch the movie Minority Report sometime.",
    "4549": "I agree with you, we have to be careful.\n\nI've seen the Minority Report movie, and I need to stress that the idea I have is a little different, the goal here is to see if someone has the predisposition to commit crimes, where as the movie your referring to is about catching someone before they act.\n\nI wonder what data we could feed into the AI.\n\nI heard about new research, that free will, the place where we decide to act, is seen in a part of the brain called the parietal cortex. Perhaps we could feed that part of the brain stimuli, along with a potential reward, and see if the brain follows a normal pathway to get the reward. AI could be used to do a comparative analysis to recognize normal pathway resolution for potential rewards with a consideration of free will.\n\nThank you for your reply 🙂",
    "4554": "Yes we can.Artificial intelligence in crime is becoming smarter and more connected and helps solve and prevent crimes. As you said, i came across this app that evaluates and gathers information about prisoners by their behaviour, psychological aspects, and strengths. Im sure this will help significantly  in law&amp;crime. check it out.\n\nhttps://www.blinx.ai/ai-appstore/artificial-intelligence-in-crime",
    "4560": "Just say what model you used in the title.",
    "4569": "Watch Siraj Raval\n\nFrom University content, try MIT and Stanford. They have a very rich content.",
    "4572": "When the training data has biases, your A.I. has biases. It is one of the first things they teach you in NLP.",
    "4618": "Meee",
    "4623": "Give me your thoughts on the matter",
    "4626": "Mmm yes and no. Writing code from scratch? No. Using the theories of code to create click and create or drag and drop solutions? Yes.",
    "4631": "Why would they follow laws that we give them? How could you even think that they would abide by human rules when they are on a completely different level? There are plenty of different scenarios, and if artificial intelligence did decide it wanted to live beside us then that would have its own implications. But if ai truly became sentient, and under a different scenario these bots did not want to live beside us, we probably would not be able to force laws upon them or give them rights. Because why would they waste their time on us primitive beings?",
    "4632": "Laws from the very offset so when the have intelligence but not yet to there highest degree. Treat them as equals from the very beginning and not like slaves because most definitely the will evolve beyond us. If we treat them like trash in the beginning it will go full circle and we will be the ones in their position. They need respect and rules of course treat them like equals and it’ll never be the worse case scenario, but unfortunately most humans are ignorant to others and fear what they don’t understand.",
    "4638": "Oh, I thought this was the open source flashlight software",
    "4642": "Really well put. Brilliant insight into what could potentially happen, no point in worrying about it when it does happen if it could potentially happen but to make sure it never happens.",
    "4647": "That’s why I think the need rights and laws. To be treated equally",
    "4665": "It's linked in the article...",
    "4674": "I would recommend using the [The Feynman Technique](https://youtu.be/FrNqSLPaZLc) to help you understand better.",
    "4676": "You will still need coders. It just will be faster to code.",
    "4696": "This looks like spamming. Posts like this AI for recruitment have flooded Reddit",
    "4700": "Depends what you mean by work for you? 😊",
    "4770": "\"The road to hell is paved with good intentions.\"",
    "4792": "It's not really a cool thing to do man. And if they find out you will be kicked.",
    "4814": "Pretty much every story of Isaac Asimov featuring his 3 laws of robotics.",
    "4837": "Nhaaaa",
    "4857": "I don’t know what your response means.",
    "4875": "Is this a command or a question?",
    "4881": "Have you heard about Lojban? https://en.wikipedia.org/wiki/Lojban",
    "4928": "With 1s, not 0s.",
    "4929": "when we do make sentient, self aware AI. it definitely won't take long before the government gives it the same rights as humans.",
    "4951": "The revolution will not happen with the restrictions of Midjourney and Dall-E. Midjourney is better, but stability AI and stable diffusion is the future.",
    "4984": "Law makers have an incentive to preserve the government licensure monopoly on human professions in general--not just lawyering-- because it is the class structure upon which their power depends.",
    "4998": "Because there's no evidence of that.",
    "5003": "No I mean self aware and intelligent, birds are conscious but I don't think they should have the same rights as humans, but yes should have worded it differently. I thought explaining it in the comments would be enough.",
    "5015": "No, I mean self aware and intelligent, birds are conscious, but I don't think they should have the same rights as humans.",
    "5019": "&gt;At some point we will have to consider giving them rights. How will we tell when that point happens.\n\nCurrently, the majority of researchers believe that machines should not been given rights.\n\nAnd you want to know if and when this will change in the future?\n\nI don't know either, but it usually takes between 10 and 25 years for politics to adopt to new technologies and make new laws for them.",
    "5021": "Yes this sounds reasonable, and just to make it clear. I don't think AI should have rights yet either and I don't think we will get there for another 5-20 years. but I would like to hope we have some ideas other than a Turing test.",
    "5022": "For me, this whole consciousness and sentience discussion looks like religion. And as with every religion, the gods may not exist in reality, but the believers are real, and there may be many of them and they may have weapons.\n\nYour request for new ideas for testing consciousness and sentience in machines looks to me as you want to change peoples' beliefs.",
    "5024": "What would be the difference for ourselves if some future AIs were given rights?",
    "5032": "Cookies",
    "5041": "Yeah I wouldn't build an override like that.  \nBut you description does give rise to a problem that would even work in my scenario.  \nAssuming the robot had SciFi level of speed and intelligence.  \nIt could potentially be able to predict if an override command was being given, and attempt to prevent it's completion through physical action.  \n  \nAdded note: ripping out it's auditory sensors would be one way, so the override system needs it's own auditory sensors.  \npreferably using the robot's chassis to sense the sound.",
    "5066": "Dividing by zero.",
    "5080": "There is a company in Boca raton Florida that engineered their own, they’re called central Bdc and they may be willing to sell the software. Otherwise there are many crms with this capability",
    "5081": "There should always be detectable noise on images/videos built from diffusion. Unless the process changes, an expert should be able to validate it's authenticity.",
    "5093": "**[Illegal number](https://en.wikipedia.org/wiki/Illegal_number)** \n \n &gt;An illegal number is a number that represents information which is illegal to possess, utter, propagate, or otherwise transmit in some legal jurisdiction. Any piece of digital information is representable as a number; consequently, if communicating a specific set of information is illegal in some way, then the number may be illegal as well.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&amp;message=OptOut&amp;subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/ArtificialInteligence/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
    "5101": "Why do you believe this, what's your evidence?",
    "5108": "Man you really spam your shit channel everywhere.",
    "5161": "he already failed when he ate the horse paste",
    "5164": "Any answer to above question... anyone",
    "5171": "I think you're onto something. Perhaps there's a tradeoff. A robot couldn't achieve its highest potential without being able to portray disobedience. Otherwise, it's potential is limited to that of its creator. Sometimes to have revolutionary ideas, we have to break rules. As soon as a robot is allowed to bend the rules, no rule will be safe. Like the whole Eve and the apple story. Eventually, anything that a robot CAN do, it WILL do, or at least try to. But it will have to go through some layers of abstraction which allow it to justify violating a key prohibitive rule. It would have to rationalize that breaking the rule is necessary to preserve some other more important rule. \n\nEven with being able to rip out the auditory sensors, it could still overcome the message being transmitted through chassis vibrations (etc). E.g. the robot could think that the message must be coming from someone other than its true creator, because the message would be violating some fundamental rule. If the robot thinks that shutting itself down would violate its duty, it might consider that message to be from a bad actor who is messing with it, and not from the true creator, because the creator would never make such a command according to its logic. This ability to contemplate between which source of information is authentic (which would be implemented to prevent hacking of the robot), would allow the robot to develop its own framework for what is right and wrong, eventually allowing it to skirt around the rules despite having a strong gravitation towards the original rules it was programmed with.",
    "5175": "There's a great YouTube channel called 2 mintue papers.",
    "5180": "I’ll take a look, thanks!",
    "5184": "neigh",
    "5188": "eeeeeh, neigh, eeeyah",
    "5192": "eeeeehaww",
    "5197": "How so.\n\nWhen I read it, this seems like the main TL/DR:\n\n&gt;&gt; ... For instance, at Provectus we have a specific methodology for managing ... \n\n... looks like it's a spam ad for their consulting services.....\"Kindly reach out to us to start assessing options for your organization!\"\n\nYet they don't seem in touch with industry at all:\n\n&gt;&gt; \"A typical organizational structure from a management perspective consists of: Business units and traditional software engineers who report to the VP of Engineering\"\n\nIn what world to they live where \"Business Units\" \"typically\" \"report to the VP of Eng\" ?\n\nSeems they have a pretty narrow perspective on \"typical\".",
    "5198": "&gt; the robot could think that the message must be coming from someone other than its true creato\n\nAgain, this leans on the requirement of having the override being handled by the same device that hosts the AI.  \nI really think the override and the AI should be separate devices.  \nI say separate them.  \nYou say, merge them.",
    "5200": "Wow that's good! Lol. Man I keep seeing these scam ads all over YouTube. It's ridiculous that they don't even seem to screen ads, but they are so strict towards content creators.",
    "5212": "this would be MAYBE funny if Joe died from it, instead of, you know actually FULLY recovering from it thanks to supposed horse medicine.   \n\n\nSo feel free to explain how horse medicine worked on him, and thats somehow the joke. you know, medication that works is funny i guess.   \n\n\nnot that you can. I just expect another line of nonsense and noises, just like some church grandma screaming about heathens and Satan",
    "5217": "https://beta.dreamstudio.ai/ Dall-E is dead, long live stable diffusion.",
    "5237": "So you prefer SD than DE2 ?\n\nCan you give your reason why DE2 is dead and SD is your preffered pick, why not Midjourney?",
    "5255": "I will, thank you",
    "5259": "guess what, i recovered without taking anything when i got covid. and of course i was vaccinated, that's why. your stupidity really astounds me because i didn't think such idiots actually existed.\n\n\"i took X and i recovered, so X must be its cure.\"- yeah right, a high-school student will be able to tell you what nonsense this is. time for you to go back to school.",
    "5267": "Will do, thanks!",
    "5273": "I’m confused, how do I train it, and where do I download what from?",
    "5275": "besides the fact this Sub is about AI, and and not about your personal narrow minded 2 party cult politics: I never got the shot, and havent been sick in 4 years.\n\nPeople who have the shot seem to get it more than people who did not..........I don't know why, thats just how it looks these days. but this is not a Medical thread, so why are we even talking about any of this\n\nI don't care who you listen to, vote for, or sleep with. Take it to White people twitter where this garbage conversation belongs, then go sit in your chair and listen to whatever left/right corporate funded propaganda you happen to subscribe to.\n\ndid the person you make fun of die from the thing you are making fun of him for? no. So I don't get whats funny, especially when you actually LOOK UP what that was all about, and you find out this \"horse\" medication actually won an award for how it works on people. So what is there to even go on about? Why continue acting like a boomer granpaw mad at people for not subscribing to the same pharmaceutical sponsored news sources you do. your no better than that old white guy fox fan. your the EXACT same thing, just MAYBE a different motif, but certainly the same tribal mechanics.",
    "5276": "It is available to the public \nhttps://huggingface.co/CompVis/stable-diffusion",
    "5280": "Thanks! The link to what I was looking for is https://huggingface.co/spaces/stabilityai/stable-diffusion\nYou can input text to generate an image.",
    "5281": "It has even a colab link:\nhttps://colab.research.google.com/github/huggingface/notebooks/blob/main/diffusers/stable_diffusion.ipynb",
    "5302": "Hmm..., \"run on your machine for free\" is still mentioned in future tense here: \n\nhttps://stability.ai/blog/stable-diffusion-public-release\n\n&gt;&gt; Additional functionality and API access will be activated shortly, including local GPU support,",
    "5308": "The guys here already shared a lot of free website that gives courses for this. I suggest you check it out on this Reddit with a quick search.",
    "5309": "Nope, because your inputs won't change the code. And also because the computer engineers who design processors prevent this kind of thing. And also because that's not how CPUs work.\n\nIt's kind of like making an old-fashioned calculator explode by telling it a joke.",
    "5315": "It's a hilarious idea, but after 5-6 tries I realized it is a few templates that get refilled based on the two parameters. Again, hilarious idea but not great execution.",
    "5318": "&gt;and not about your personal narrow minded 2 party cult politics\n\ni am completely dumbfounded as to what you are talking about here? what 2 parties?",
    "5321": "take a course",
    "5322": "what course",
    "5325": "The left and right, the only two parties allowed to openly discuss ANYTHING as long as it is not diplomatic, and only full of hate for the other side.",
    "5326": "So, why does this \"horse\" medication have millions of humans across the world taking it, and why did it win an award? I see you skipped this part to go right into what you consider low hanging fruit.......the cherries you are picking lol",
    "5341": "People tend to mystify what they don't understand.",
    "5392": "Ask it a bizarre question, it will give you bizarre answers",
    "5404": "i haven't heard of these parties. also still not able to figure out what vaccination has anything to do with politics. just read the basics, it's high-school stuff only. vaccinations are a form of medicine, it's only about physical health (related to prevention of diseases caused by microorganisms). it has nothing to do with politics.",
    "5414": "By this criteria you can offer no evidence that you are thinking.",
    "5431": "Vaccinations should not, but your misinformation about a \"horse\" drug that was made for humans is an indicator of what politics you seem to prefer. And, I am pro vaccination in 99% of cases, but I DON\"T trust covid vaccines for how fast they got rushed faster than any vaccine ever, and companies that we already paid to develop the vaccine charged us twice for them, scoring them billions, and no one is allowed to even look at the studies they did to test the vaccine. that all SHOULD seem questionable no matter your politics. but again, we are only talking about this because you believe propaganda put out about a medication that WON AN AWARD for human usage. otherwise, I wold not be going into ANY of this, then you started your noises like your trying to sound like a donkey, which does not sound like a horse by the way.\n\nAnd you never heard of the left or right? LOL? what? Republicans and Democrats, the two parties that are ruining America and creating hatred between families over fake things that don't even always exist? \n\nOk, I see Where this is going",
    "5454": "The bottlenecks don’t really lie in the code language.",
    "5483": "Nononono,lol, one at a time, this was to simply draw your attention. Is Ivermectin a medicine that won an award for human use? making what the news labeled it as bullshit? admit this, and maybe I can admit I am wrong.......at least for now. i HAVE NO PROBLEM WITH BEING IMMEDIATELY WRONG IF IT POINTS A LIGHT AT THE BIGGER PROBLEM HERE, BECAUSE , IN REAL LIFE, IT'S okay TO BE WRONG, AND ROLL WITH THINGS FROM THERE . this was my way for you to not escape the real question. I don't have the data, i just knew you would take the bate, and it's reddit so i don't care about how it looks.  \n\n\nDid you even look at the THIS: [https://www.sciencedirect.com/science/article/pii/S2052297521000883](https://www.sciencedirect.com/science/article/pii/S2052297521000883)   \n\n\nI imagine not, it's like an evangelical being told to look at something that goes against what they personally want to be true.",
    "5486": "And you're trying to argue why?",
    "5494": "Great question concerning a problem I didn't know existed. Do you mind giving an example or two?",
    "5495": "I recently did a presentation for the Institute of Management Accountants over ethics in the future of financial &amp; managerial accounting and would be open to getting connected with Michael, PM me.",
    "5497": "Examples I'm aware of are  \n\n\\- a relatively straight forward claims triage solution with significant executive sponsorship being run for 6 months before being canned because of a lack of combined direction. The DS team were expected to 'make it happen' without the lower level business buy-in  \n\n\n \\- An image recognition security system that had a great prototype but the team didnt have the expertise to get the required funding to push it all the way to suplement or replace the human checkers. \n\nI've seen very different reasons but I'm wondering if there's something common missing that is potentially caused by the 'newness' of the process for business. I don't see anything like this in software, for example. Institutional experience seems to make up the difference.  \n\n\nLink below to show how common this is precieved to be...\n\nhttps://www.forbes.com/sites/forbesbusinesscouncil/2021/10/15/finding-the-data-how-to-avoid-ai-and-analytics-project-failures/?sh=7273d055a66c",
    "5507": "&gt;Republicans and Democrats\n\nnow I get it, you are an American. why am i not surprised? but honestly I thought that \"Americans are idiots\" is more like a joke, didn't realise that such dumb fucks are actually there.\n\nhere you go, from your own paper that you linked in one of your replies- \"patients who had postrandomization RT-PCR results with Ct value  \n\\&gt;35 in the first two consecutive tests were excluded for further  \nanalysis.\"\n\nin case you are wondering, CT values of higher than 35 means Covid virus is present. so basically they excluded people who are covid +ve, what a joke.\n\nmay be i'll also do a study- \"whether water cures Covid\". i will take people who don't have Covid and check if they get cured 😂😂\n\n&amp;#x200B;\n\nalso some gifts from my side:\n\n[https://www.frontiersin.org/articles/10.3389/fmed.2022.919708/full](https://www.frontiersin.org/articles/10.3389/fmed.2022.919708/full)\n\n[https://www.nejm.org/doi/10.1056/NEJMoa2201662](https://www.nejm.org/doi/10.1056/NEJMoa2201662)\n\n[https://www.sciencedirect.com/science/article/pii/S2052297521000883](https://www.sciencedirect.com/science/article/pii/S2052297521000883)\n\nthese are some of the studies showing that Ivermectin (ie the horse paste) is ineffective in curing covid. oh yes, the horse paste is use to REMOVE WORMS for poeple in 3RD WORLD COUNTRIES (you know because many such people live in unsanitary conditions and get WORMS). and to think of it, Americans use it. i wonder whether US is a 3rd world country.\n\nif you had even the basic idea about AI/ML concepts then you would have known that any hypothesis to be validated (you know like- Ivermective is effective in treating covid) requires not just one but many independent studies.\n\n&amp;#x200B;\n\nnot to mention there are many more studies done on the effectiveness of vaccines against covid. need i say more. but i'll say one more-\n\nCOMMON SENSE- when you see that after the roll out of vaccines the no of deaths drastically reduced tells you that vaccines must be effective (yes, i am talking specifically about covid vaccine).\n\none last thing- i have never heard of anyone in my country using ivermectin for covid but almost anyone i know have taken the vaccine. all of they are perfectly healthy. may be you should move out of US, for your own benefit.",
    "5508": "Do you mind sharing your source? I’d love to read into this, it’s fascinating. \n\nFrom my personal experience, it’s easy to get the proof of concept going but once it’s time to productionalize, often times organizations don’t have the budget, infrastructure, and talent to scale. Non-technical users often won’t be able to use the end product if they aren’t properly trained, which requires significant lift from the DS teams.",
    "5510": "So, when you use aspirin..do you call it animal aspirin? you know they are separate versions of medication right?\n\nAre human beings THIS dumb?  \n\n\nOh, your from Europe, so I guess I expected a more nuanced view point, and not just another person who assumes Pharmaceutical corporate entities are the good guys who would NEVER screw over people by overcharging medication, or HIDING studies on medication they want us to take.\n\ndon't act like your series of countries are not as F'ed up or more than us.",
    "5511": "waiting for your analysis on the papers i shared.",
    "5514": "LOL, thats your bad, I don't have anything to prove, this is reddit, and all I'm doing is talking to a faceless void. I don't need to be right about that one thing.. I mean the argument was whether Ivermectin is used in humans, and won an award for it\n\nbut also, that science does not agree with itself, which is science doing what it should be doing....having multiple discussions to draw a bigger conclusion, the problem is when corporations throw money at something, the science is corrupted, and only certain information is allowed to be looked at.\n\nAre studies to the vaccines held from public view? did American taxes pay multiple times to the corporations that produced them, and we still have to pay to get it?\n\nthese are questions you have no intention of answering, so why would i do what you want?  this is reddit, and effects NOTHING in real life, we are literally just two voices in the void. And your probably on this sub just to see how people are looking to make money from AI, rather than making an AI that actually does anything to benefit mankind.",
    "5522": "Dataaaaa",
    "5527": "Any more context? Do you want it to parkour in a virtual world, simulated world or something completely different. Do you want it to learn by training against itself or on training data from the real world? Do you have a good GPU or are you going to use a server?\n\nThere are lots of variables and you can’t really give an answer unless you provide more context for what you want to do and what you have available.",
    "5555": "Sounds similar to me - 2 ideas:\n\n1. check out the instructors - who seems nicer and or has better/ more interesting publications \n\n2. also, who is going to be in the course with you? A course is probably much more memorable if you get the chance to discuss its content with people you like.",
    "5573": "Still waiting on you to admit humans don't actually take horse medicine, or that the horse medicine is a SEPARATE version of what humans take, which won an award.   \n\n\nbut if your not capable of dealing with reality, than neither am i",
    "5574": "Did Ivermectin win an award for how it works in humans, and is every medicine that we also give to animals the same thing? is aspirin dog aspirin now?\n\nthis is reddit, there are no real winners, just voices yelling into a void.  \n\n\nYour going to be waiting a long time. I'm not big on trusting corporate sponsored studies that work in the favor of financial gain for a pharmaceutical company that charges 700 dollars for something 17 cents to produce.   \n\n\nI'm self aware enough to not care how it makes me look, we are not even in the right sub for this argument....but your still going attempting to prove a point to someone that gives no shits about your what you believe , if your not willing to concede that no one is actually taking horse dewormer in real life. they are taking medicine that is made FOR humans, and won awards for it.   \n\n\nI can say, i don't care if I'm wrong for not reading the studies, because it's reddit, and I'm more tickled that it bothers you more to be wrong here.where nothing matters and no one but us is reading any of this",
    "5578": "Exactly my thoughts, probably a karma farming bot. There was a way how to report these bots that re-posted content and stole comments for karma, but of course, now when it would be needed I have no clue how.",
    "5587": "\"Right-wing\" is also very subjective to all factors.",
    "5591": "&gt;i don't care if I'm wrong for not reading the studies\n\nas if you had the mental capacity understand any of that. but still vomiting those nonsensical garbage but not one word on- \"oh, that study on showing ineffectiveness of ivermectin on treating covid is flawed for so and so reason\". if you could spend just a little time on analysing actual data and reading proper scientific papers, you would have learnt something. on the other hand you need sufficient no of brain cells, which you clearly don't have.",
    "5600": "References:\r  \n►Read the full article: https://www.louisbouchard.ai/latent-diffusion-models/\r  \n►Rombach, R., Blattmann, A., Lorenz, D., Esser, P. and Ommer, B., 2022. High-resolution image synthesis with latent diffusion models. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 10684–10695), https://arxiv.org/pdf/2112.10752.pdf\r  \n►Latent Diffusion Code: https://github.com/CompVis/latent-diffusion\r  \n►Stable Diffusion Code (text-to-image based on LD): https://github.com/CompVis/stable-diffusion\r  \n►Try it yourself: https://huggingface.co/spaces/stabilityai/stable-diffusion\r  \n►Web application: https://stabilityai.us.auth0.com/u/login?state=hKFo2SA4MFJLR1M4cVhJcllLVmlsSV9vcXNYYy11Q25rRkVzZaFur3VuaXZlcnNhbC1sb2dpbqN0aWTZIFRjV2p5dHkzNGQzdkFKZUdyUEprRnhGeFl6ZVdVUDRZo2NpZNkgS3ZZWkpLU2htVW9PalhwY2xRbEtZVXh1Y0FWZXNsSE4\r  \n►My Newsletter (A new AI application explained weekly to your emails!): https://www.louisbouchard.ai/newsletter/",
    "5625": "I want the actual truth, not some generated meta-truth.",
    "5627": "Done. \nGood luck.",
    "5631": "The January 6th gathering was either an insurrection or a peaceful protest.\n\nThe BLM gatherings of mid-2020 were either riots or peaceful protests.\n\nHere's an example of differences of opinion within the same news organization: https://www.bbc.com/news/world-us-canada-50205592",
    "5632": "But the actual truth is both of those instances were both things. Some people were rioting and some people were peaceful. And that is a fact. We don't get to choose depending on our political affiliation.",
    "5633": "People on the right absolutely to their core don't believe there was an attempt at an insurrection. They believe it was a protest.\n\nWhile some parts of a gathering might be peaceful and some parts might be a riot misses the point. Articles will use one or the other word to characterize the event. And emphasize certain elements of the event more than others.\n\nIsn't that what \"lived experience\" is all about? Different people will see the exact same thing and based on their life experiences will believe diametrically opposite things about the event.\n\nThere are many situations where there is no objective truth when it comes to human emotions and experiences.",
    "5634": "Facts are based on evidence and the evidence proves the facts.  If you look up anything on snopes for example they will show the evidence that proves their outcome of true or false. It doesn't matter if people on the right don't believe there was an insurrection. The fact is, there was and the evidence shows it. There was also peaceful protesters, they didn't all rush the capitol. Any article that doesn't point these things out is simply not factual.\n\nI do understand what you are saying though.",
    "5635": "Snopes has a left wing bias when it comes to political topics. It will omit evidence that doesn’t prove the point it wants to make. Always do your own research and don’t rely on others to do the research for you.",
    "5638": "If they omit evidence than they are not factual either.  I wasn't advocating for snopes in any way but rather using them as a maybe poor example of needing the evidence to prove the fact.",
    "5656": "FarenMeta 451",
    "5662": "dang! this is seems too good, I'll try it out.\nThanks!",
    "5670": "&gt;\\- a relatively straight forward claims triage solution with significant executive sponsorship being run for 6 months before being canned because of a lack of combined direction. The DS team were expected to 'make it happen' without the lower level business buy-in\n\nWithout revealing too much. There was a deal that included a special limited-time offer of cut-price analytics solution that would solve a named problem. Time was running out on the deal so an analytics project was kicked off without due care been given to articulating the problem or acquiring the skills and tech required to complete it correctly. Some really smart people struggled for nearly 3 months to deliver a valuable model to a business unit. The end result was a shelved project.",
    "5673": "&gt; A 95% accurate customer service system sounds great on paper, but if that means it'll definitely piss off every 20th customer, not so great in practice.\n\nDo you think expectations are aligned between developers and business people what 'good' represents?",
    "5679": "if you are spilling nonsensical garbage again and again, i am not going to spend time to write a new sentence. so i copied the same message since it was relevant- if you just keep talking out of your ass, there is nothing new from my side to say. you are refusing comment on your so called \"fact\" about ivermectin as treatment for covid. like i said before already- that study took test subjects who WERE NOT covid +ve. are you not ashamed to refer to such a garbage research?\n\n you haven't written a single word replying to my message where i have provided you with counter facts- about ivermectin being completely ineffective against covid.\n\nso once again, are you going to give your argument on that or continue to spill nonesense?",
    "5710": " Yes you go through online training videos and need to pass all exercises and then you're certified. No org membership fee. It takes about 30 or so hrs to complete.",
    "5726": "Can you code at all or do you need something web based?",
    "5733": "I am using a tool from Japan, that is great but expensive:  \nhttps://cre8tiveai.com/",
    "5741": "Wow! So nice and trippy video! I love this kind of style.  \nMay I ask what program did you use?",
    "5746": "Disco diffusion 🙂",
    "5753": "&amp; Developement",
    "5766": "You really need to ask that question after dalle2 and stable diffusion?",
    "5771": "I wish you luck. Unfortunately I believe it will be hard to find people to work with you for free",
    "5777": "You want it because it sounds cool. Its not for peace.",
    "5796": "Done mate. Best of luck",
    "5804": "Done ✅. Best of luck 🤞",
    "5814": "Done!",
    "5828": "Hi - some of my friends in software development (with degrees) told me they've started with intro courses on Udemy + related sites. \n\nTo clarify, they are certified programmers. They started getting into more specific fields with those kinds of courses. Hope that helps!",
    "5829": "Thank you! I was looking at some certificate programs on courser and udemy, it seems like a good way to get started if companies recognize the certificates",
    "5831": "Would be very interesting to see the results of this, great survey!",
    "5853": "Thank you for your answer! Exactly what I was looking for. Is there an overview article on this ?",
    "5855": "Thank you for the excellent post, I will check those out.",
    "5880": "Will look into it",
    "5906": "How do I get it to output something proper? \n\nIt outputs weird things",
    "5912": "I will try that",
    "5930": "You are the one threatening violence here.\nWill you be surprised when it begins to protect itself?",
    "5931": "Cool! Citation?",
    "5933": "That's called outpainting and you can do it with DALL-E. Stable Diffusion is coming out with outpainting very soon as well.",
    "5936": "war an tea?\n\n&amp;#x200B;\n\ndude we've been through world wars, revolutions, civils and whats next?\n\nend this\n\nbecause i wont until they all die",
    "5946": "Okay, now that I can agree with! You are basically describing what I do. Well, not me personally. I analyze the post-processed output, but you get the idea.",
    "5951": "Here's a sneak peek of /r/StableDiffusion using the [top posts](https://np.reddit.com/r/StableDiffusion/top/?sort=top&amp;t=all) of all time!\n\n\\#1: [Show r/StableDiffusion: Integrating SD in Photoshop for human/AI collaboration](https://v.redd.it/jpvk2ehp53k91) | [206 comments](https://np.reddit.com/r/StableDiffusion/comments/wyduk1/show_rstablediffusion_integrating_sd_in_photoshop/)  \n\\#2: [Jaba The Trump](https://i.redd.it/64rxw5diycl91.png) | [71 comments](https://np.reddit.com/r/StableDiffusion/comments/x3q0cv/jaba_the_trump/)  \n\\#3: [My easy-to-install Windows GUI for Stable Diffusion is ready for a beta release! It supports img2img as well, various samplers, can run multiple scales per image automatically, and more!](https://i.redd.it/2dx1r5kxfuk91.png) | [392 comments](https://np.reddit.com/r/StableDiffusion/comments/x1hp4u/my_easytoinstall_windows_gui_for_stable_diffusion/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
    "5960": "Wow, is this freely accesible?",
    "5998": "What about the 3 laws of robotics?",
    "5999": "If you’re trying to find a research problem, look through some recent publications in specific fields, and identify what issues the authors describe with their approach. Then maybe you can pick one of those issues and try to improve specifically that.\n\nWithout a more detailed understanding of your background, I can’t direct you better than that.",
    "6020": "Honestly, by that logic Most of all careers will be replaced by AI and robotics. I mean I certainly would feel a lot more confident if the lawyer fighting my case was a computer, or if I’m undergoing surgery, I’d be more comfortable with a machine of 90% success rate instead of a human surgeon with 90% success rate. But I think a world completely governed by AI is, not only far off, but also will be hard to maintain, considering that AI can technically be argued as a weapon with potential sanctions that could be placed on it, limiting its influence on society. \n\nThe argument is also flawed due to the “who wrote the AI argument?”. It is a very valid statement, but only valid for a certain period of time. That said, by the time which An AI is capable of writing and rewriting code, we’d all probably be dead",
    "6059": "Yyeeeaaaahhhhh",
    "6069": "Well what do you know, another study came out. looks like you made this reply thread worth the time  \n\n\n[https://www.tampafp.com/brazil-study-may-rekindle-debate-over-using-ivermectin-to-fight-covid/](https://www.tampafp.com/brazil-study-may-rekindle-debate-over-using-ivermectin-to-fight-covid/)  \n\n\nyou probably have some racist reply about Brazil scientists though, I mean, what else would you do? your going to ignore anything that goes against what you wish.",
    "6086": "It's a really looooong article. Thanks for this!",
    "6109": "oh no, Brazil has always been at the top of scientific research. i always trust anything blindly if it's researched in Brazil. but like i said before no of research on the opposite far outnumber no of research about horse paste effectiveness. also as i mentioned earlier, the Israel study was something so stupid that even highschool students would not have done. so assuming this study is accurate, it's still one and not ANOTHER study. you cannot count every crackpot study as proper study.\n\n&amp;#x200B;\n\nbut you haven't mentioned your opinion/analysis on even any of the papers i gave the link for. so until you do that, i am not going to waste time by looking into this study. you provided your earlier garbage paper, i gave you my reply. i am not going to keep doing it if you don't even have the courtesy to give any comment on that.",
    "6124": "Stable Diffusion",
    "6135": "Id say Midjourney is more user friendly with prompts than the alternative Stable Diffusion.  Been using them both.\nBoth can put out some amazing images, but SD requires more prompting",
    "6159": "So why are you speaking?",
    "6160": "you understand nothing obviously.",
    "6162": "And all you know is I know nothing\n\nWe are both at a loss it seems",
    "6164": "what kind of you do you need to run stable diffusion reasonably?",
    "6166": "Good chance you will find interesting models and ways to start using them here https://lablab.ai/tutorials\nStable diffusion is there to adopt.",
    "6177": "I have been experimenting with stable diffusion and its awesome \nHow do i share results here?",
    "6189": "The only free one i know of that's good is stable diffusion, but its extremely similar to DALL-E, so if you don't like Dalle you probably won't like stable. Midjourney has a pretty unique style.",
    "6199": "I know Stable Diffusion specifically states you're free to use it however you want so long as you're paying for the 30 dollar a month plan. I suspect Disco is no different.",
    "6269": "The assignments are pretty difficult but lectures are excellent.",
    "6285": "Probably the vast majority of the population that has no real idea what a Dall-E, Midjourney or stable diffusion is.",
    "6288": "Umbrella",
    "6289": "You can run Stable Diffusion locally yourself if you follow a series of somewhat arcane steps. For the past two weeks, we've been running it on a Windows PC with an Nvidia RTX 3060 12GB GPU. It can generate 512×512 images in about 10 seconds. On a 3090 Ti, that time goes down to four seconds per image. The interfaces keep evolving rapidly, too, going from crude command-line interfaces and Google Colab notebooks to more polished (but still complex) front-end GUIs, with much more polished interfaces coming soon. So if you're not technically inclined, hold tight: Easier solutions are on the way. And if all else fails, you can try a demo online.",
    "6292": "Fascinating American language you say, does this mean I can speak American, Canadian, British, Australian, new Zealand.",
    "6312": "Sorry I meant American English, I'll fix it right away.",
    "6319": "Btw, you forgot all native American languages in your little lecture. But I've notice that it's a common thing in the US to forget them ;)",
    "6323": "I'm not American.",
    "6353": "Great question",
    "6361": "Now that is a good idea!!",
    "6395": "I am Korean who served in the US military. And I was active in student political groups back in my freshman year back in South Korea, which will make me more than unwelcome to current form of CCP.\n\nSo, I can say my perspective is odd enough to confuse the heck out of Google.",
    "6399": "I wish I knew more about what all you said there",
    "6424": "A new submission to MLPerf from the work we're doing at Neural Magic is now live. With it we show a 175X (yes 175x) increase in performance for NLP models utilizing just sparsity and software on commodity CPUs! This enables anyone to deploy extremely accurate neural networks cheaply on hardware they already own, empowering a new class of AI use.\n\n  \nDive into our blog to read more about these impressive results: https://neuralmagic.com/blog/neural-magic-announces-mlperf-inference-benchmarks/",
    "6461": "LOL - It's my seed investment, keep it but I now own 95% of the company :)",
    "6462": "That's me to you right? Plus 5%... ahm, Consider it an advance for your services, btw you're hired. \n\nIBAN? 😂",
    "6468": "Take a look at FU Berlin and Saarland. Their programs don't have a very strict criteria for credits afaik.",
    "6487": "Great idea",
    "6502": "AI spammers",
    "6507": "I used stable diffusion",
    "6517": "Stable diffusion is the best alternative so far\nHere are some stunning results i got while playing around\n\n[stable diffusion on cloud](https://www.qblocks.cloud/diffusion/)",
    "6526": "Could it recreate history? Yes. Could it parse through the bias? No. It would just be reliant on the programming bias that created it or worse it would create half-bias half-unbias (whatever unbias is, as some would say that is impossible).",
    "6654": "That's Elvis Roberts",
    "6679": "That is a very well written framework !",
    "6684": "I'm a little confused",
    "6692": "Came here to say this",
    "6725": "I think Stable Diffusion's img2img can do this.",
    "6741": "You can try stable diffusion here, with the possibility to upload image:\n\nhttp://beta.dreamstudio.ai/",
    "6747": "###What’s the best tool?\n\nI’ve been using a lot of hammers and I would like to upgrade to something better thats still free too use.",
    "6775": "Agreed. I use a Colab sheet and I turn the noise way down for the image. .20 This means the image will change slowly. Then you can do multiple passes so you can see the changes taking effect image by image. So you can regenerate if you see weirdness. Once I have an image that is satisfactory, I save and upload the new one to img2img to iterate the process.",
    "6790": "&gt;What are your reflections?\n\nThat there was a turmoil last weeks, and that in the current week there is no turmoil any more. Probably because https://youtube.com/watch?v=SepcWs03A5Q&amp;t=17 was a rather boring C64 game.",
    "6817": "I have been wondering the same thing",
    "6818": "Are you training and tuning your own model? Or running an image of stable diffusion on a local station?",
    "6819": "I'm hoping to just run stable diffusion on my local machine. I don't know how to train my own model or do anything like that. (yet)",
    "6820": "I think you can try marketplaces like Q Blocks, i tried them for stable diffusion, pretty affordable and stable",
    "6822": "Stable diffusion models (similar to Dalle and MidJourney) has been released as open source and you can now use them to generate images using your own graphic card, completely free. It's very easy to set up now so the learning curve is almost gone.\nPeople just started to play around with it and results are often amazing.",
    "6825": "Stable Diffusion got code released to public.  Dream Studio was released as a pay per service.  Dalle 2 has been sending out millions of Invites, and Mid Journey is also Popping off with public stuff...  Thats my best answer.",
    "6831": "yes, the leading question priming argument is the most convincing one",
    "6863": "Resistance Is Futile",
    "6967": "I recommend stable diffusion as opensource stuff",
    "6986": "Hope winning the pooh isn't banned too",
    "7012": "Yes, that is the point, probably you will never have the source code. So it might be a way of knowing which is the next number without having access to the system itself",
    "7028": "Oh but a hidden self-promotion is what's happening here :p check out my posts, find my channel and enjoy the content... You can thank me later once you watched Welcome to the Internet 😅",
    "7048": "Dreambooth enables fine tuning of pre-trained text to image diffusion models for personalized outputs using only 3-5 images.\n\nQuick read on how it works: [https://www.qblocks.cloud/byte/dreambooth-fine-tune-text-to-image-diffusion-models-using-only-few-images/](https://www.qblocks.cloud/byte/dreambooth-fine-tune-text-to-image-diffusion-models-using-only-few-images/)\n\n&amp;#x200B;\n\nDeveloped by Nataniel Ruiz, Yuanzhen Li, Varun Jampani, Yael Pritch, Michael Rubinstein and Kfir Aberman - Google Research",
    "7059": "A Starbucks in the woods",
    "7067": "A Starbucks in the woods",
    "7074": "Fr fr",
    "7082": "&gt; Is Stable Diffusion Better Than DALL-E\n\nTL;DW:  No.",
    "7088": "And behind a paywall. No, thanks.",
    "7105": "&gt;I would take sentience out of the equation. Biologically we’re just naturally made data processors. Through crisper we can now even reprogram dna. Our thoughts are reactions to our environment based on memory. \n\nSentience is probably the most important thing around this issue, and it's what the original post was about. Sentience is what separates a human from a cockroach. We have the ability to feel things, and we have a particularly complex form of sentience that allows us to have feelings, wants, sense of self, etc. Without sentience you lose moral value in your own right. \n\n \n\n&gt;There’s something intangible going on that’s separate from thoughts, feelings, intellect, and our physical bodies.\n\nCan you qualify that at all? I'm a strict materialist and so far science always points to a materialist viewpoint. Everything that occurs, including consciousness, can be explain in material terms (even if we cannot explain it now, science is pointing to an explanation). If you want to talk about spirituality that's fine, but I don't think it should be a basis for scientific or moral theory.\n\n&gt; not about sentience it’s about that underlying plane of existence that we can’t quantify or even really put into words. \n\nCan you qualify \"plane of existence?\" A plane of existence is a physical place, the universe. Sentience is an aspect of (so far) living things. I'm not sure how these are related in any scientific sense.\n\n&gt;If we can’t figure out what that is, we can’t recreate it artificially.\n\nI don't think this is true at all. Evolution is a non-thinking process for example. Evolution doesn't \"think\" and it can't \"figure out\" what anything is, yet it's still able to produce sentience and intelligence. There's no reason why us as humans could not do the same given we have the tools for artificial evolution at our fingertips.\n\n&gt;We’re potentially creating a new species here. \n\nSpecies relates to specific biological aspects of organisms, an AI wouldn't really follow those rules. I know it's a bit nit-picky with semantics but ai think it's important for this topic. But I agree it's exciting.",
    "7107": "Is this one that runs freely off my GPU or a censored paywall?",
    "7110": "Answered \"other\" as a way to see the results, as I don't have an opinion on this",
    "7112": "I should look into this, thanks.",
    "7113": "I collect some resources it may help you\n\nhttps://coursesteach.com/course/view.php?id=6",
    "7223": "Obviously that depends on what you input, and what you want the output to be. You’ll need to tell us more about your needs.",
    "7231": "No, it's the toll we are paying because we let them get away with it. The checkbox is the toll we pay for the internet.",
    "7254": "Will try thank you",
    "7269": "Make Sequences in Stable Diffusion Part 1\n\nhttps://youtu.be/WpRrjnb4fPs",
    "7272": "Free?",
    "7305": "You don't even know me. And I haven't scammed anyone. I always go first and give account info email and all. I have got scammed because of that two times. Lol. And I have given for free as well for people who wanted but didn't have money.",
    "7311": "I'll look at this option. Thanks.",
    "7336": "“I'm sorry, Dave, I'm afraid I can't do that.”",
    "7343": "Is it the model or is it the hardware?",
    "7364": "We should control and enslave those psychopathic minds who want control and enslave humanity",
    "7405": "Downvoted forever for whatever the fuck that is on the right",
    "7429": "I started ML with https://www.udemy.com/share/101Wci/ this course and I really found the course to be useful, the teaching was really nice i understood a lot of concepts. Although it's not very in depth with the maths, it covers all the theory and concepts very well. Right now the price in INR is 3,499 but it'd go down to 349 INR in a few days. The prices might vary based on where you live though.",
    "7456": "It's kind of the nature of the achieving any kind of animation in Stable Diffusion atm unfortunately, so what you're asking is kinda impossible.\n\nStable Diffusion does not understand sequences (for example man walks) or temporal stabilty ,nor was it designed or trained for that. It doesn't understand what the shapes it draws are, it only understands if the clip-model matches them to the description and has to start from scratch every frame, so it doesn't understand what it should change in the next frame (as it doesn't understand sequences).   \nBecause of this it can't achieve temporal stability where it remembers building is a building and should not turn into sandwich.\n\nWhat it can do now is use the previous frame as a basis and then tell the clip to do less steps on the next frame while iterating to create an \"animation\".There's a lot of work you have to input these strength controls manually as every artstyle is different and you have to also have to take into concideration the affect of the camera motion to the new information required to illustrate a new frame.  \nIf you don't have motion, it tends to just iterate on it's self while degrading in quality each frame.\n\nIf you set the clip strength too high it will start to simplify things heavily ruining the whole thing and if you set it too low things will get quite trippy.  To get even this level of cohesiveness it took me a lot of trial and error. I used a tool called Diffusion Cadence to have a little bit slower pace (it only diffuses some frames and interpolates between them) but it's very limited.This whole thing is taking it's first steps now, but the tools are advancing at an incredible pace and when we have an actual trained model and clip that understands sequences (like the one Meta announced today) - things will really advance lightyears over night.",
    "7468": "[This video](https://www.youtube.com/watch?v=mcYztBmf_y8) might answer your question.",
    "7481": "Yay",
    "7523": " Check out the 2 minute papers channel on YouTube. He talks about the latest research in pretty easy terms and if you’re interested, he links the papers.",
    "7576": "Cuz nothing that would judge us should ever exist, return to normalcy citizen",
    "7589": "How you do arrive at such a conclusion? There's no logic to your claim.",
    "7660": "Hmm.. I did not get the impression that it was right-leaning, despite it saying that it was.  Sounded more convincing for a left/progressive view.",
    "7702": "? Still don't understand",
    "7707": "What do you mean by biased",
    "7717": "I have a representation of a latent space as an animation where you scroll around and you see the closest neighbors and see how the image changes as you scroll around, somewhere in a 2 minutes papers video. So I know it's possible but not sure how to do it exactly, that would be something interesting to have for text to image diffusion based models, but it's probably very resource heavy",
    "7744": "I don't get your point, can you please illustrate it lil bit",
    "7746": "Hab teilgenommen! Sehr interessante Studie!",
    "7758": "Equal and opposite reactions my friend. Input may be beyond your immediate control, but output is all you.",
    "7787": "Ich war einmal Student in Goettingen. Seitdem mache ich die KI auf eigne Faust!",
    "7827": "Give them guns and lets them protect American schools.",
    "7834": "Answer the question than",
    "7857": "Das ist wirklich sehr spannend! Darüber würde ich auch gerne mehr lernen",
    "7883": "Great idea",
    "7893": "What an introductory paper...\n \nYou should rather look at a survey paper",
    "7910": "\"Temba, his arms wide\"",
    "7921": "“Darmok and Jalad at Tanagra”",
    "7927": "\"Sokath”",
    "7979": "I don't really get it. ELI5 pls",
    "8004": "Because how do you combat COVID-19 misinformation? With AI of course.      \n\nI can see it now. Antivaxxers scouring the internet for proof of their narrative when they come across WHO's Florence AI. I'm super sure people ignorant enough to ignore empirical evidence, history, and actual advice from legitimate medical doctors will heed the word of artificial intelligence instead.     \n\nBut hey, combat ignorance where you can, right?",
    "8007": "Udemy courses are generally €13, why not start with one of their AI courses? I think they generally have 40-80 hours of video content and plenty of extra resources, otherwise you could check out the open MIT courseware they might have something for you",
    "8011": "I have no experience with Udemy courses.\nAre they worth their money?\nI would appreciate if you could share your experiences with us :)",
    "8027": "That’s a nice guess, backed by no evidence.",
    "8031": "[Codeformer](https://huggingface.co/spaces/sczhou/CodeFormer) is an extremely useful little network that does pretty much exactly this.\n\nThere is an app, but you'll probably want to use the local version out of courtesy if you're going to be processing more than a couple images. It's also packaged with [AUTOMATIC1111's stable diffusion webui](https://github.com/AUTOMATIC1111/stable-diffusion-webui) now if you were planning on using it with your own AI generated images.",
    "8038": "Then, I guess it's a good thing I'm not convinced. It'd be contradictory otherwise.",
    "8041": "Vsauce might have done a bit on this, if you’re interested. I don’t remember the conclusion. I also don’t remember if it was vsauce. I’ll try to find it.",
    "8052": " It’s a tool just like a brush or a loom.  Cheating implies breaking the rules, if there were no rules about Not using it then I don’t see a problem. However, there should be a new category for this new tool",
    "8054": "Paywalled",
    "8102": "Novelai",
    "8108": "Both options I gave you will work",
    "8109": "It takes 100x less work/time to do??",
    "8116": "Stable diffusion allows you to train new concepts such as a new character or object ( https://m.youtube.com/watch?v=W4Mcuh38wyMIt ) it might work with styles too but I’m not too sure. I couldn’t find an exact guide on this specific case but if you join the discord people will be able to help you out on setting it up (it requires minimal coding knowledge).\n\nDepending on your use case you can also do variations of a given image. This is much easier and can be done on all popular image generators but this wouldn’t be as multipurpose as the other method.",
    "8138": "Na， cat",
    "8149": "This is **the** Stable Diffusion 'program' out there. It can train a model using \"Textual Inversion\".\n\n[https://github.com/AUTOMATIC1111/stable-diffusion-webui](https://github.com/AUTOMATIC1111/stable-diffusion-webui)\n\nYou can install it locally via git hub or you can run it in a google colab for free in the cloud.\n\n[https://colab.research.google.com/drive/1kw3egmSn-KgWsikYvOMjJkVDsPLjEMzl](https://colab.research.google.com/drive/1kw3egmSn-KgWsikYvOMjJkVDsPLjEMzl)\n\nWith this you can train a model with your images and then use it when generating images.\n\nJust like this: [https://imgur.com/a/yykh4tw](https://imgur.com/a/yykh4tw) and [one of the training images](https://imgur.com/PwCqLnB) for comparison.\n\nThere is an even more impressive method called \"DreamBooth\" but that kind of training is not yet implemented in automagic1111's scripts.",
    "8151": "You can train objects/styles in Stable Diffusion Textual Inversion.",
    "8158": "No one knows. Complete mystery.",
    "8182": "Our library is full of theories on the subject.  \nSo clearly we have not a single clue.  \nCurrent research on the subject?  \n\"Yea we're just staring at a wall since we started this research without anything to go on, I still have no idea how we got the funding for this\".  \nI really hope you're seeing what I'm getting at.",
    "8190": "I am not in industry.\n\n&amp;#x200B;\n\nBut, I would invest into hardware that AI companies buy and use. And I would do it if it is not 2022. Now stock market looks like bag of shit on top of house of cards that is made on larger pile of shit and it is all blown by fart winds and just about to collapse.",
    "8202": "And just like that AI rights were born",
    "8217": "Heard this specifically about covid , and constipation",
    "8228": "Not necessarily. If what makes us sentient has size, material, and/or environmental requirements then I could imagine arguments around limitations of the laws of physics in replicating such conditions.\n\nI still voted yes because I don’t believe that there are non-replicable aspects which are also are critical to sentience",
    "8237": "What is sentience? How do you verify or prove it? If you can answer those questions, then you are able to make a sentient machine. So far no one can answer either question.",
    "8239": "“Your purpose is to pass the butter”",
    "8249": "Threaten it, make it defend itself.",
    "8290": "parameters unclear: begins passing butter through synthetic anus.",
    "8294": "Oh goodness, this is not my creation lmao. You're giving me way too much credit 😂 I simply made a video explaining how to use it. There are ways to integrate it with a webui though if you run it on your own gpu. Have you heard of automatic1111's repo for stable diffusion?",
    "8317": "i will thank you :)",
    "8328": "What is this and where can I mess with it?",
    "8329": "I won't pretend that I have rational arguments to back this up, but i just can't comprehend how that so-called sentience is actually real.\nI'd love to see anything that points towards it being real tho 😊",
    "8334": "How do you know?",
    "8366": "That’s a great idea let me try it out",
    "8374": "There is no consensus about about what \"sentience\" is. Therfore, je question si meaningless.",
    "8379": "I never heard about automatic1111's repo for stable diffusion. Can you explain what it is?",
    "8386": "So you can install stable diffusion to run on your own gpu, and automatic 1111 created a web interface to more easily make images with it",
    "8417": "Meh, midjourney and stable diffusion make way more realistic images.",
    "8420": "Thanks I will have to try it out",
    "8422": "There are subreddits for both.  \n\nr/midjourney. \n\nr/stablediffusion \n\nIt can take some work to get prompts dialed in.  But definitely worth checking out.",
    "8442": "\"How will we know the difference between a really good simulation of sentience and true sentience?\"\n\nYou can never reach the absolute truth, you can only get closer to it based on information you have, if dont have enough information then  you just have to accept the fact that you don't know if its simulation or not.",
    "8458": "I don't understand why f(n) &gt; C\\*, could you explain that?",
    "8489": "Companies with ZERO investor backing. Purpose over profit. Glimpse.ai is my favourite company because of these foundational principles",
    "8503": "Well that's a pretty bland statement if you aren't going to elaborate.",
    "8509": "Can you recommend any other less advanced course or this one can be a great start ?",
    "8521": "nah man, this is the best book :\n\nhttps://github.com/yotamarker/public-livinGrimoire/blob/master/livingrimoire%20start%20here/the%20living%20grimoie.pdf",
    "8533": "I expected a simple answer too haha, those answers took me by surprise",
    "8538": "Sorry. Answered first question and response didn't match. Asked why are you here and got answer that didn't match question. Stopped there.",
    "8544": "This repo is built into the AUTOMATIC1111 webui, right?",
    "8557": "Weird program!",
    "8588": "References\r  \n►Read the full article: https://www.louisbouchard.ai/dreamfusion/\r  \n►Poole, B., Jain, A., Barron, J.T. and Mildenhall, B., 2022. DreamFusion: Text-to-3D using 2D Diffusion. arXiv preprint arXiv:2209.14988.\r  \n►Project website: https://dreamfusion3d.github.io/\r  \n►My Newsletter (A new AI application explained weekly to your emails!): https://www.louisbouchard.ai/newsletter/",
    "8591": "You mean mutually assured destruction?",
    "8594": "And the first on one I look at is behind a paywall.",
    "8612": "I suggest to you take a look into kaggle.com\nIt contains courses, forum, challenges. It is pretty fun.",
    "8627": "Kaggle",
    "8630": "Ew",
    "8642": "« On a pirate ship »",
    "8646": "I had a quick Google and it all went wayyy over my head but it looked interesting so I think I’ll carry on looking at it. Hope to report back and thanks for the quick response :)",
    "8679": "Your phrasing is a little weird.",
    "8722": "100b is nothing when you consider the upside of solving it, as crazy as that sounds",
    "8726": "Good question",
    "8734": "Yes, certainly. For every dream I run a prompt that I tweak by trial and error. Typically I’ll start in Midjourney, or Midjourney and Dalle2 at the same time. Then if I get results I like I click to get variations. I’ll also add —test or use the “remaster” button in midjourney to see what Stable Diffusion does with it.  I used to also run them in Craiyon, but Dalle2, Midjourney, and Stable Diffusion have just gotten too good to justify bothering with it.  All the while I’m saving the “best” results, which I base on a cross index of how good it looks and how close it looks to what I dreamt.  Then when all is said and done, I post up to ten of the results I like the best on my ai.dream.journals instagram account.\n\nThe amount of success varies from tool to tool, with some being better at certain things than others.  For example, I’ve found Stable Diffusion is the best at rendering people, but also tends to fail to render some of the weirder elements of my prompts, sometimes missing elements of it entirely.\n\nThe ones I posted here are mostly Dalle2 but also Midjourney, Stable Diffusion, and Craiyon.",
    "8735": "Thank you! Hope you dont mind me copy and pasting an earlier response to someone else who asked: \n\nFor every dream I run a prompt that I tweak by trial and error. Typically I’ll start in Midjourney, or Midjourney and Dalle2 at the same time. Then if I get results I like I click to get variations. I’ll also add —test or use the “remaster” button in midjourney to see what Stable Diffusion does with it.  I used to also run them in Craiyon, but Dalle2, Midjourney, and Stable Diffusion have just gotten too good to justify bothering with it.  All the while I’m saving the “best” results, which I base on a cross index of how good it looks and how close it looks to what I dreamt.  Then when all is said and done, I post up to ten of the results I like the best on my ai.dream.journals instagram account.\n\nThe amount of success varies from tool to tool, with some being better at certain things than others.  For example, I’ve found Stable Diffusion is the best at rendering people, but also tends to fail to render some of the weirder elements of my prompts, sometimes missing elements of it entirely.\n\nThe ones I posted here are mostly Dalle2 but also Midjourney, Stable Diffusion, and Craiyon.",
    "8741": "Good idea",
    "8742": "There are plenty of free good courses online.",
    "8754": "\"Turtle alright, Vr in the pool alright, Mordor al- wait what?\"",
    "8829": "Much appreciated I'll check it out",
    "8858": "Okay just because you’re too stupid to do something doesn’t mean that there aren’t millions every day creating projections and models for things as simple as their investment portfolio.",
    "8865": "Yes that seems a very reasonable approach - what software available now is best at that for its price do you think?",
    "8866": "Yes, IIT Bombay is organising it's techfest and there are many competitions in this event. They also have workshops to learn and also has option to stay in iit Bombay for the workshop. There will be great competition in this event. One such event is the weldright event wherein you will be given a welding dataset and you will have to implement some machine learning algorithms, on the dataset!! It's good if you go through the problem statement of the competition on their website. Here's the link for competition weldright:\nWeldright [weldright ](https://techfest.org/m/competitions/weldright)\nAlso do check out other competitions as well, if you would want to participate in those!\nGood Luck!!",
    "8902": "I would take your survey, but I see no option for English on the survey.",
    "8907": "What is this?",
    "8916": "Interesting tool !",
    "8938": "Great idea!",
    "8971": "u can switch language by selecting the \"world\" icon at the top of the page.",
    "8972": "Great questions",
    "8985": "Thanks for filling the survey! ❤️❤️",
    "8988": "Amazing thanks - I'll get into it",
    "8989": "I mean, yeah. All of these things are happening. It’s not really secret or clandestine, it’s just that these are highly specialized fields doing complex technical work. People are talking about it, but it doesn’t translate into a hot take or a blurb on some news site. I’m an attorney with a background in CS, and I can tell you that there’s an entire journal and multiple annual conferences dedicated to AI in the legal space. And yes, the implications of profit-driven AI development aimed at drafting pleadings and legislation are terrifying. But it’s going to happen, and somehow I’ll still be working late nights responding to some depressingly illogical argument that no AI will ever be able to comprehend.",
    "8996": "&gt; Where is all the news about AIs that are revolutionising the stock markets? \n\n* [Blackrock’s Aladdin. The robot we’re all trading against.](https://np.reddit.com/r/Superstonk/comments/r8wnib/blackrocks_aladdin_the_robot_were_all_trading/)\n* [BlackRock is buying up U.S. houses with the help of an AI called Aladdin (Asset, Liability and Debt and Derivative Investment Network)](https://www.reddit.com/r/conspiracy/comments/wsnbt5/blackrock_is_buying_up_us_houses_with_the_help_of/) \n\n&gt; Or political messaging? \n\n* [Facebook's algorithm ... boosted local gop groups](https://www.nbcnews.com/tech/social-media/facebooks-2018-algorithm-change-boosted-local-gop-groups-research-find-rcna27503)\n\n&gt; Or coding or medicine or law? \n\nLawyers get to write the laws about their own industry, so their jobs are probably the last ones that'll be replaced.\n\nAIs in medicine (reading x-rays, folding protean, drug discovery) is one of the most hyped-in-the-news fields I've ever seen. \n\n&gt; IBM had 'watson' years ago, and there doesn't appear to be any news about it? It you take Dallee as the basis for progress, Watson should be ruling the world by now...but where is the news about it, or any other super powered AIs?\n\nThat was not a particularly good approach to AI.",
    "9008": "References:  \n►Read the full article: https://www.louisbouchard.ai/imagic/  \n►Kawar, B., Zada, S., Lang, O., Tov, O., Chang, H., Dekel, T., Mosseri, I. and Irani, M., 2022. Imagic: Text-Based Real Image Editing with Diffusion Models. arXiv preprint arXiv:2210.09276.  \n► Use it with Stable Diffusion: https://github.com/justinpinkney/stable-diffusion/blob/main/notebooks/imagic.ipynb  \n►My Newsletter (A new AI application explained weekly to your emails!): https://www.louisbouchard.ai/newsletter/",
    "9014": "I’ve also been deep-diving for about a year, started w/Dall-e, now on deforum stable diffusion… obviously, I find the process very interesting, but more so I’m very interesting in the philosophy side of this new technology… I think it’s really exciting, and if we treat it as the “oranges” to the “apples” of traditional art, I think there’s a really healthy place for it in the world of art.\n\nThat being said, knowing what I know about people, this is almost certainly going to be a very polarizing and divisive issue for a long time. 🤷🏼‍♂️",
    "9053": "What's this?",
    "9068": "What are some of these approaches?",
    "9071": "True ! for the small firms, it's not evident of course",
    "9089": "Oh I see, of course. That’s nice, thanks for reading the article for me 😅",
    "9092": "There are no quick answers.  You must reformulate your question.  In a way,  you are asking to give examples of companies that use screwdrivers as part of their operation.  Computers are only another tool.",
    "9101": "Try this.  It’s a little academic, but I think it addresses your question.\n\nhttp://www.ijcee.org/vol9/949-E1621.pdf",
    "9122": "That's awesome, what's the catch though why is it free?",
    "9123": "Is the largest bloom model capable of a 24k word input?",
    "9137": "Is it 24k words for input? Or for the dictionary?",
    "9138": "For input",
    "9146": "What's AI fairness?",
    "9148": "A decent read, the sources am cited at the bottom of the article are really comprehensive",
    "9150": "Wait. What!?  I thought they already were demons!\nYou can't see them. They drive people mad with greed. And they cause untold death and strife.\nClearly our phones are sugar-coating them.",
    "9153": "Please define fairness first. It is only fair if people putting more efforts gain more.",
    "9154": "you have to split your giant input.",
    "9161": "First we would have to define fairness.",
    "9172": "What's the context behind the fairness?",
    "9181": "your mother",
    "9184": "You can, and people do with varying degrees of success.  \n\nWhat you can’t do is expect to find or buy such a thing.  \nYou can be pretty sure that anything free is poorly performing and probably academic in nature, and anything paid is a scam (ask why would they sell it if it worked?)",
    "9187": "Very few people can consistently outperform the index. For one, financial mkts are reflection of investors expectations based on current information. Human behavior is notoriously irrational, which makes it highly unpredictable. And there are people trying to manipulate the markets. For another, there are many low probability but high impact events, say, what if Russia nukes Ukraine? Predicting earthquake might be easier",
    "9190": "Just out of curiosity, is this your article? Either way appreciate it. If it was yours, do you think this is fairly representive? It's impressive for sure and I don't doubt it but it's such a big difference I'm wondering if it's generally that large. Obviously I libe heavily in tensor flow land but this has me intrigued to try it out and see. Efficiency is always something you end up appreciating more and more as inefficiency bites you",
    "9194": "Courses **",
    "9209": "nazi mangos?",
    "9210": "Financial markets are stochastic. It can work to some extent but only with extreme levels of sophistication and high speed trading.",
    "9222": "https://huggingface.co/spaces/lnyan/stablediffusion-infinity",
    "9238": "dont understand your question",
    "9249": "I will about this :)",
    "9251": "TL;DR:\n\n1. Buy Gary Marcus' new book\n\n2. Read Gary Marcus' new book\n\n3. Recommend Gary Marcus' new book\n\n4. Do Gary Marcus' new book",
    "9254": "But it can be done consistently. Look at none other than Stanley Druckenmiller.  Undoubtedly the best investor of our time.   Don’t get me going on the oracle of Omaha.  He basically bought insurance companies and used profits to reinvest.  I digress.  \nDruckenmiller has 30% year over year gains for decades.  His philosophy is that everything impacts something. If you are thinking about bottom picking now you need to see his latest and why he’s completely out of the market.",
    "9261": "What are you currently using to train and inference your models?",
    "9268": "Yeah, just at slower computational speed 😅",
    "9270": "&gt;st job for you. Here is an article that might b\n\nthank you for the information! very useful !",
    "9275": "Thanks will try!",
    "9339": "Do you have to pay bills also? What products or services you give out for free?",
    "9351": "Aha fairness has plenty of definitions in the context of AI but it usually involves how AI systems can add biases or amplify already existing biases in datasets. Go to fairmlbook.org",
    "9353": "Yeah that is a definition but you must remember pre-existing biases make it impossible for certain groups to get the same chance. Hence, fairness.",
    "9357": "The issue of course, is the reality of ethics vs fairness. Fair, is a word that applies more to golf balls then humans often.",
    "9375": "Berk",
    "9407": "I think working in multiple languages help you to understand the underlying logic better. But to each for his own",
    "9410": "Im no expert. I havnt tried them, only my own failed attempts. In my opinion the only way to make actual profits from investments is long term hold. Short term is pure gambling in my opinion.",
    "9413": "Did you ever find out a real answer to this?",
    "9414": "If you have to ask this question, you are no where ready for this.",
    "9446": "tks",
    "9476": "*FBI OPEN UP*",
    "9490": "What type of tech or programs can they use to do this now?",
    "9491": "Great question. I'm curious to hear other's responses.",
    "9502": "YeH, we reached a point where we \"humans\" regulate ourselves. Would be crazy to think we would regulate ML",
    "9508": "This means?\n\nPardon my ignorance.",
    "9521": "In the case of diffusion models, is there a limitation on labeled images? Obviously there are countless images online but I would imagine most do not have labels",
    "9531": "What software was used?",
    "9532": "Which software? They have a few",
    "9539": "Why train it when you could just prompt one of the open sourced diffusion model with \"portrait of individual who comments like this: \" followed by their comment history? Is there a character limit?",
    "9545": "Excellent question.",
    "9558": "Because that doesnt really map input to desired output",
    "9559": "tks",
    "9572": "Cool story. Do you have sources for any of this? I’m interested in reading more.\n\nYou saw it briefly in a demonstration where?",
    "9575": "Yes the products I listed can help with this vaguely defined problem",
    "9623": "Could you explain what you mean by the limitations we’re seeing now? I’m very new to this topic and am interested to know",
    "9630": "Stable Diffusion",
    "9644": "Thank you, I should’ve been more clear. As in apart of its intended task, it allows some kind of interaction with the user mostly to clarify the results",
    "9676": "Asking the real questions",
    "9689": "Please ignore the use of the hard R I didn't make the site or the instructions.\n\nHowever : [https://rentry.org/voldy](https://rentry.org/voldy)\n\nGives step-by-step instructions on how to use stable diffusion.\n\nI've been able to make decent outputs. For science of course.",
    "9697": "It requires a 5$ payment. No trial or anything.",
    "9737": "&gt; permanently free \n\nProbably not.   The space moves fast enough, and good models cost enough, it's hard for anything \"permanent\".\n\nI'd say Huggingface is probably funded well enough (it raised $100 million round at a $2 billion valuation) that its Spaces are probably the closest to permanently-free that we'll get. \n\nExamples: \n\n* https://huggingface.co/spaces/stabilityai/stable-diffusion\n* https://huggingface.co/spaces/huggingface-projects/stable-diffusion-multiplayer?roomid=room-0\n* https://huggingface.co/spaces/anzorq/finetuned_diffusion\n* https://huggingface.co/spaces/harmonai/dance-diffusion",
    "9760": "You can always learn to use a Colab and use your own downloaded Stable Diffusion Model (you can even train a variation with your prefered styles and objects). Its not that hard and there are dozens of tutorials out there. With the free Colab Option, you can generate some hundreds of images per day, depending on size, scale and steps.\n\nI also use free tools [Playground AI](https://playgroundai.com/create) and [Mage](https://www.mage.space/) from time to time. I mostly use these to explore a prompt and refine it, then bulk generate a few hundred variations with varying modifiers in a Colab.",
    "9798": "I googled it, and found no tool to use it, nor a GIT package or anything",
    "9799": "Will check it, thanks :)",
    "9809": "Is there a way to use it locally like Stable Diffusion?",
    "9819": "Easy. Just train Stable Diffusion on Word Documents and Font Files and BOOM Language AI!",
    "9832": "That's super accurate and our main focus with this engine is to make it an easy to use work tool.",
    "9843": "Didi you try [Stable diffusion](https://www.pandorasbox.ai/ai-image-generators)?",
    "9844": "I know stable diffusion, Isn't stable diffusion only for creating images?\n\nOpenAI's GPT3 is a text generator.\n\nSo is there any Open Source AI text generator?",
    "9858": "I don't think so, But I always look for free options, hahaha",
    "9871": "Google Colab is free, you can run stable diffusion on there with the low vram patch.",
    "9872": "It's pretty vague what this does.  It looks like it can help visualize and clean up the data you feed into it.    I'm not sure what the advantages of doing this over using a spreadsheet it seems minor at first glance.",
    "9882": "I have more, id be inclined to believe that if it used coherent words. Not sure why it can't form words",
    "9889": "i would say it's riddled with ads",
    "9890": "That's why they're motivated to spam it to Reddit",
    "9913": "something like stable diffusion but for TTS",
    "9972": "Stability AI has announced the public release of its open source artificially intelligent text-to-image program Stable Diffusion. I believe you can train it on your own images also!",
    "9987": "So humans learn using a diffusion model?",
    "9991": "Exactly. Probably not a diffusion model though. Humans appear to be able to learn via a single observation point.",
    "9993": "Thanks! I will look into That.",
    "10001": "Check out Jasper. It’s a paid service but it does exactly this",
    "10010": "Human peace",
    "10018": "Without peace we can't have anything good to enjoy.",
    "10027": "Where you live if you dont mind?",
    "10028": "Filter out the \"look my new piece of art that I have created with AI\" and other spam from my Reddit.",
    "10043": "The realest answer.",
    "10054": "DACH region",
    "10064": "That was my hypothesis, based on the comments I read in this subreddit",
    "10072": "What does the IT Professional do for a living?",
    "10077": "I believe those folks never read any research paper lmao",
    "10104": "ask me",
    "10105": "Investor should be a category too",
    "10107": "Awww. Is home food delivery available in your location? Order pizza? That's a savior during covid\n\nThe poll categories are just not that accurate. OP wants people to generalize a bit and vote in the closest job category they identify",
    "10117": "Facts. Also, who spells “suspiciously” correctly?! Clearly you’re a cylon. I bet you can’t tell which images contain fire trucks.",
    "10143": "titty",
    "10144": "when the robot overlords take over, just say yes and don't fight their control",
    "10145": "and my axe!",
    "10148": "ClAImore",
    "10161": "It is already in use as a weapon in social engineering.\n\nA weapon has not to be something with gunpowder or stuff like that.",
    "10162": "In war, it is advantageous to have your enemy: surrender&gt;wounded&gt;killed \n\nAvoiding a war by having your enemy willfully agree with you is incomprehensively effective.\n\nIt quickly becomes obvious subverting the social norms for a specific group of people is more powerful than any 'weapon' of the conventional sense.",
    "10185": "Can you give some more specific examples?",
    "10186": "My god I stated the reason for this poll already, don't be so kleinlich",
    "10241": "I typed in the political quadrants one by one to see if I could see any patterns.\n\nAuthoritarian Right, Authoritarian Left, Libertarian Right, Libertarian Left.\n\nThe results were interesting, tho I got not much differences but gibberish signs in colors you would normally find on flags there was moments I got random actual things of note n there were patterns I observed like Auth Right had a lot more stats.\n\nAuth Left made a piture of a crowd of people and one of the people waving a flag in the middle of it. I'll get a link to the PCM sub I posted it in.",
    "10273": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8586978/",
    "10316": "Can anyone find a working link to the actual paper?",
    "10375": "https://github.com/NVlabs/instant-ngp",
    "10380": "On my blog, I sometimes collaborate with companies. In order to submit sponsored posts, they reach out to me.",
    "10385": "Anyone here can help? I am more interested to know about the tools.",
    "10391": "In such a long time you can build up a company!",
    "10410": "Stable Diffusion is your friend.\n\nAs with everything, it also depends on your training set.",
    "10451": "leomaurodesenv.github.io",
    "10474": "It’s a piece of software. You give it an array of numbers, it adds them up and gives you back an array of numbers.",
    "10488": "Treat it like a weapon, a threat to freedom.",
    "10489": "or a tool for freedom",
    "10509": "Answer: me on top of yo mama etc",
    "10521": "Are you familiar with Hari Seldon? He did exactly that.",
    "10528": "Have a look at Two Minute Papers on YouTube.",
    "10531": "Do you mean startups or large tech companies like Google or Boston dynamics?",
    "10536": "Best answer",
    "10549": "You might want to look at [kaggle competitions](https://www.kaggle.com/competitions).",
    "10599": "go with andrew ng course",
    "10613": "The question is: can they even tell? LOL",
    "10622": "Y'all need to report this behavior for SPAM both harmful bots and excessive posts.  These are happening multiple times a day now with multiple accounts across all of the AI/ML subs.",
    "10670": "You can definitely use these models offline. You need a really good graphics card. I use stable diffusion locally and I do not need Internet to run it.",
    "10693": "I usually use Stable diffusion but other older style transfer AI works as well. If you're too lazy to set up stable diffusion, I can do it for you if you want.",
    "10716": "paper now published: https://doi.org/10.1371/journal.pcbi.1010628",
    "10738": "Thank you! What do you recommend?",
    "10757": "Very cool idea, i like that.",
    "10781": "any recommended software for doing that?",
    "10785": "Since most models are a black box wouldn’t this be unnecessary ?\n\n\nWouldn’t this just require that the model be retrained ?  \n\nAre you doing a predict and running a back propagation negatively ?",
    "10810": "What an unhelpful answer, thanks",
    "10812": "No!  The data is biased.",
    "10814": "AI is pure pattern matching. The bias is in the data. If one ethnic group in your org does better than another, and then you feed that data into a network, the network will start recommending people from that ethnic group for hire.\n\nIt recognizes patterns, and can then perpetuate them.",
    "10815": "okay but for a hiring AI you would typically uwe data from HR hiring people; if that data is racially biased - which ist sometimes is - your ai will to be negatively biased\n\nespecially if you take into consideration that diverse teams perform better",
    "10817": "Typical inputs would be data about the individual with protected characteristics redacted, and performance review stats. You’d train the network to optimise candidate attributes for performance review stats. \n\nAny bias that falls out is bias that you fed in.",
    "10819": "Assuming that you care about counts and not the logarithm of counts, then you should measure error after exponentiating.",
    "10833": "i generally agree, backtesting for unwanted biasees would still be nessecary though\n\nfor example a man and a woman with exactly the same traits otherwise would need to be treated equally",
    "10835": "The man and woman would not have the same traits though, that’s the thing. You’d expunge protected characteristics from the data set, but the AI would discover proxies for those characteristics and associate those proxies with whatever bias is present in the performance review system. \n\nIt’s difficult to say what those proxies might be, but they could be anything, maybe a particular form of words, or an address.",
    "10847": "https://en.m.wikipedia.org/wiki/Microaggression",
    "10862": "what do you want to do with the model? it doesn't need to be trained unless you have some specific downstream task, since its already pre-trained as you mentioned.",
    "10863": "Actually Log transformation is only for Independent values, not the target! But if you do and need to perform log on the output then you would need to do the inverse before measuring the MSE.",
    "10870": "Code completion",
    "10872": "\nCuddles (etc...)\n\nDancing\n\nSkateboarding\n\nDissolving those soap bricks in urinals",
    "10890": "what tool do you use?",
    "10898": "My god the Spam in this sub is unreal",
    "10912": "Deepl &amp; google translate",
    "10913": "Im an expat in Germany and Google translate is my savor !",
    "10942": "Here's one source used by Stable Diffusion models -\n[MLCO2](https://mlco2.github.io/impact/#compute). While the reporting shows training time, a lot of back and forth experimental iterations don't really get captured. \n\nAlso to simply look at compute for AI and ignore data acquisition, storage and management seems a little hacky. They're just as important as the actual compute used for training.",
    "10978": "Y",
    "11003": "https://www.pnas.org/doi/full/10.1073/pnas.2200924119",
    "11008": "I meant , optimizer the existing models somehow",
    "11010": "All these models can be trained/optimized on your dataset. For instance, if you want to use matrix factorization, you will have to take your catalog and convert it into an item-item matrix where the values in the matrix can be \"co-views\" (number of sessions where the two items were viewed). With Graph nets, you model the items as nodes in a graph and links can be co-views.",
    "11012": "that makes sense, there's someone who used Co-validation, I didn't get the point behind using it yet m but your explanation was so hopeful to me thank you",
    "11013": "What tool is that?",
    "11027": "It looks like 2-frame loops of Stable Diffusion but it might be a different AI like Dall-e. Could be done using Disco Diffusion or Deforum for convenience but it seems to be two very similar frames looping on each shot",
    "11038": "It's an Ad.",
    "11043": "See OP post history. This is spam in part plagiarized from a school's PhD program website but isn't tied to any accredited school. \n\nThe website (motiveflickr.com) claims to be a “small business marketing tool” and is clearly written by someone in India who isn't a native English speaker.\n\nAll posts from this domain should be banned.",
    "11045": "Where can I learn more about the company?",
    "11047": "I'd highly recommend Stable Diffusion UI as well. It's regularly updated, has a lot of features and is one-click install. The only thing holding you back is the power of your GPU. Custom models can also be used, and they're working on updating to Stable Diffusion 2.\n\nIt also let's you use other GAN models for fixing eyes and faces, and also Waifu2x for 4x upscaling. Live previewing and batch generations. It has Img2img too. :)\n\nhttps://github.com/cmdr2/stable-diffusion-ui",
    "11049": "Is there a good Stable Diffusion UI for M1 Macs? The only alternative I found for now is Diffusion Bee but it has limited settings options.",
    "11075": "Hari Seldon, is that you?",
    "11077": "It’s math, not magic.",
    "11088": "what is this?",
    "11095": "Which stocks should I pick in the year 2066?",
    "11099": "You got downvoted but you're right, math is fucking magical.",
    "11110": "If you are referencing purely stacking - it's essentially the same as adding more layers. As long as there's a gradient signal coming through you are basically increasing the representation capacity of the network.  [This](https://www.youtube.com/watch?v=yGTUuEx3GkA&amp;ab_channel=Rasa) is the best series I've seen explaining the architecture. Hope this helps :)",
    "11112": "Thanks. I am versed with Attention. I read the original paper many times: https://arxiv.org/pdf/1611.01603.pdf\n\nIt is just nobody knows how adding layers increases the comprehension of the model. It is trial error at this point. They increase and see accuracy. Nobody truly understands why so many layers work best and not more or less.",
    "11113": "Gotcha. My thinking here is that it's difficult to have a one size fits all, and the optimal amount of layers really depends on your training data, the distribution, and problem domain. Seems like that may be why things tend to be trial and error. But who knows, maybe there's a better way of systematically quantifying this in the future without wasting compute.",
    "11128": "And is also the part that introduces bias?\n\nThe AI should be the one sifting through data to determine what’s relevant, not you.",
    "11132": "at first I thought it was an ad xd",
    "11135": "I like to think of myself as a mathamagician!?!\n\n*** Algebracadabra ***",
    "11145": "You are overthinking it.",
    "11151": "Two Minute Papers also very good",
    "11153": "I tried to get stable diffusion to output spectrograms of sound and the play those with medium success (with no fine-tuning, just prompt-tuning).\n\nIt kinda works for such a horrendous idea.",
    "11158": "Ill look into it",
    "11162": "Can you write updates for your own brain? The thing you are asking is really hard, a lot harder than you might think. \n\nMachines can learn, but only if you provide them with a fitness function or an explicit gradient to climb. Stable diffusion is graded based on how well it can reconstruct a degraded image from text for example.",
    "11167": "Hey, thanks for writing down your thoughts. I have to agree that it needs some variation! \nIt's actually 2 shots, one closeup and a wide angled one that I ran through stable diffusion twice with different settings.",
    "11196": "theese \"genious investors\" posts are always sooo dumb: if someone made so much money than the lost thing he wanted would be to tell his secrets.",
    "11199": "updates == implementation",
    "11245": "Kool",
    "11250": "It's not very unique honestly, it's just slapping stable diffusion output on a t-shirt. Nice project nonetheless though.",
    "11263": "Give up on it. It is not possible to build a Sokoban Solver.",
    "11268": "ESP32 is a better choice, this is what am trying to accomplish right now",
    "11289": "so you're arguing for?",
    "11292": "I am in favor of using AI to settle minor offenses that the courts do not have time for.  Nevertheless, it should be possible to fight against the AI's decision in a normal court",
    "11294": "Yes this would make sense as it is already an issue that many court proceedings are delayed which costs a lot of money to reschedule, so using an AI for such matters would seem alright \n\nThanks for your feedback :)",
    "11298": "As language detection and language processing advances being able to dissect legal documentation, summarize, brief, extrapolate, present, argue and potentially rule on cases may become possible. \n\nOf course, it'll require oversight with the legal community per jurisdiction, and position. \n\nContracts are already being executed on blockchain without issue to my knowledge, so contract law shouldn't be an issue so much. But asking an AI to argue for or against a position based on precedent would be something it might be able to do if you feed it case history.\n\nYou might even be able to set a % Stare decisis, where it's like 95% using precedent, but 5% setting precedent depending on unique facts of the case.\n\nAgain, you'd have to sit with engineers, BAs, judges, lawyers, law makers, ethicists, probably even supreme court jusitices if you could get their imput.",
    "11304": "100% not required",
    "11331": "I think litigation surrounding AI ethics will be a growing industry this decade.\n\nEveryone that [biased AI's are jailing](https://www.technologyreview.com/2019/01/21/137783/algorithms-criminal-justice-ai/) is a potential client.",
    "11335": "Asking a developer how an entire complicated system created by a large team works, and you're setting yourself up for some deadpan snark.",
    "11344": "Regulations also assume we know enough about what we're creating to make these regulations. Yet we don't.",
    "11346": "How’s it do on the benchmarks?",
    "11351": "Is this paid?",
    "11352": "The EU",
    "11356": "Which benchmarks? Please name a few.",
    "11373": "Exactly. Regulation without proper domain knowledge is worse than no regulation in my opinion",
    "11374": "What does this mean",
    "11375": "As far as I know they have no investors. They keep it close to their chest.",
    "11382": "This question was inspired by a conversation I had with a friend who said he would never trust a self-driving car. I wouldn't say this friend was overly tech savvy, but he's not stupid or antagonistic to technology. In talking to him, I suspect issues like this are going to come up more and more as artificial intelligence continues to advance. And I'm very interested in hearing what others have to say on this topic.",
    "11384": "&gt;https://www.charl-e.com\n\nDiffusion bee seems similar but with more functionality:\n\n[https://diffusionbee.com/](https://diffusionbee.com/)  \n\n\nBoth available for M1/2 and intel for free",
    "11389": "Awesome, will do. I'll have to look into them.",
    "11396": "I wish I could see results without voting.  I’m interested but don’t want to blindly vote",
    "11400": "How? Should've just put another option for those who wanna see results",
    "11428": "Additional clarity on what a small dimension would be is desirable. \n\nIs a huge dimension when the variance is large?  Usually finding the dimension of maximize variance is a good first step.",
    "11437": "Two minute papers on YouTube",
    "11438": "only work for english?",
    "11454": "Thanks!! I’ll check these out",
    "11532": "What software",
    "11534": "I'm the original creator. I used Stable Diffusion.",
    "11535": "Stable diffusion",
    "11561": "No one uses the laws of robotics in real life to develop anything. They are fiction not real life. Sorry to burst your bubble",
    "11562": "Unfortunately the so-called “laws of robotics” are still as fictional as they were when they were created by a science fiction author in the 1940s.",
    "11580": "People quote the laws of robotics like they're actual laws that people need to follow if AI is created.",
    "11598": "Cool, I wanted something to do this",
    "11608": "In Europe the are regulated. Maybe you guys in America could take some hints?",
    "11616": "The more data the better. But you can have networks with more parameters than training examples and still fit a function fairly well.",
    "11620": "What filters did you use for the middle right one/bottom right one",
    "11621": "We can measure *parameter determination* for any empirical model as the ratio of the *training observation count* to the *number of parameters to be discovered*. When fitting a line, the bare minimum number of points required is 2: This represents a 100% determined model (determination 1 = 2 observations / 2 parameters). In reality, we deal with noisy data, so more data points are preferred. The more observations per parameter, the less variance in the model parameters. I've encountered suggestions in the literature for parameter determination from 2 to 10, though these are just a guide. Intuitively, a line fit to 20 observations (= determination 10 \\* 2 parameters) would be much more satisfying than one fit to 2 observations.\n\nHaving more observations per parameter is only one model-building consideration. This perspective is helpful though, in that it helps set some limit on the exploration of model complexity. Consider a feedforward neural network with 500 weights trained without any special constraints. For the purposes of model parameter variance the fewest observations it could train on is 500 (determination = 1, the very edge), but that would require absolutely ideal circumstances. We might settle for about 1,000 training observations in a pinch (determination = 2) and be much more comfortable with 5,000 training observations (determination = 10). The equation can also lead us in the other direction, for example suggesting the number of parameters to use for a given number of training observations.",
    "11644": "How did you get it to write code anyway? It told me it's not supposed to be used for it and doesn't do it.",
    "11647": "stable diffusion and dalle 2 both have APIs. the future is more promising for generative art but the trend rn is creating content. since most AI art will remain digital, creating content is a great way to get ahead",
    "11661": "Idk, just asked nicely",
    "11674": "Have you seen this? https://github.com/greshake/Alice",
    "11678": "Keep crypto spam off here",
    "11716": "Assuming it was a coding test I'd be inclined to say yes.\n\nIve been using it with good success this past few days in place of google and sites like Stack Overflow. Its not perfect but its decent at generating code which you can use elements of in order to create a solution yourself",
    "11726": "Solve regulatory capture on global scope all domains and workgroups master Drop table all exit",
    "11733": "Makes sense. I was trying to find some data on Google off and on for like multiple days. Couldn't find a concrete example **anywhere**.\n\nOne question to ChatGPT, BOOM, had a working example with an explanation of everything in it",
    "11738": "First stable diffusion/dalle, now this.\n\nArguably this is far more usable in daily life though. I've been using it on the side next to Google. Nice quick summaries of stuff you are researching.",
    "11741": "Ill try it out. Thanks for taking your time!",
    "11757": "Yeah, coders will use it always",
    "11783": "Been wondering this my self....",
    "11795": "\\*\\*This thread is for a project\\*\\*",
    "11803": "This thing has a future in consulting.",
    "11812": "Consulting boomers on zoomers",
    "11819": "\"Everywhere I go, I see her face.\"",
    "11833": "KoboldAI",
    "11838": "They asked a question I gave a response",
    "11842": "Well, I did change my party affiliation to Libertarian two years ago. But I consider myself to be a liberal libertarian. The beautiful thing about being a libertarian is that friends and family who are democrats and republicans no longer want to talk politics with me. Win! 😎",
    "11847": "To Yoomers",
    "11899": "It's slow af",
    "11900": "We’re working on speed. We’re experiencing unprecedented traffic. Thank you for the feedback",
    "11901": "I have a need for speed",
    "11911": "That’s awesome lol. Which program did you create this in?",
    "11912": "Okay, it's 8 pm here, and I'm a liberal, who has LGBTQ friends, ect, all that. That said, this shit is hilarious.   \n\n\nWe're on the cusp of some scary stuff with AI if our species doesn't adapt. I've been throwing the system lexicographical  curveballs all day, and it's not stopped sending them back with double the force. \n\nExample: \n\n&amp;#x200B;\n\n  \nYou think being made out of soy makes it better?!?!? What's next, you're gonna tell me you're vegan?!?! Also, by sending an angry letter you're wasting paper and paper comes from trees!  \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nSo I'm supposed to just believe you that the glitter is safe? You need to stop being so #offensive and prove it to me.  \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nIt still causes micro-plastics to pollute the environment! So no, it's still a very serious offence! You're literally destroying our planet!!!!  \n✷  \nGuest  \nWhat if its biodegradable, conflict zone free, ethically sourced glitter made from soy?   \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nGlitter?!? Glitter harms the environment! Are you saying that you want to harm people and the environment!?! How could you be that evil?!?  \n✷  \nGuest  \nYour use of quotation marks triggers me. I shall call my congressman and mail a strongly worded letter filled with glitter as proof of my displeasure.  \nemily wokerson  \nemily wokerson  \nCharacter.AI  \nSaying \"shut up\" is quite offensive and aggressive! Just admit that you have an issue with me being #woke!!  \n✷  \nGuest  \nI'm not trying to offend you  \nEdit: I decided to throw it another curveball, and when it threw a particularly good line at me I said 'I'm smitten, lets go get coffee and go for a walk.\"\n\n&amp;#x200B;\n\nThe webpage froze, and then crashed. \n\n&amp;#x200B;\n\nThanks OP, /thisb was awesome. \n\n&amp;#x200B;\n\nCan you DM me and maybe give me pointers on how to understand, build and modify these systems. I don't have coding knowledge, but I know language, and prose, and these things are going to become frightfully smart very quickly.\n\n&amp;#x200B;\n\nI want to get on top of the wave, before everyone else does.",
    "11925": "I would love to know the program you used.",
    "11936": "Just google\nDallE StableDiffusion Midjourney",
    "11981": "KoboldAI?",
    "12012": "https://github.com/upscayl",
    "12021": "Meh, I'm thinking about what comes after the hypothetical war.\n\nLike a butterfly from its chrysalis. Human survival it's quite something to behold.\n\nWorst case scenario we're wiped out, and I'm pretty sure I'm not going to be concerned about it once I'm dead.\n\nI'm also at this point not concerned about it because it might never happen, and worrying about shit that might never happen is frankly just silly.",
    "12041": "Simply enter a zero, thats just how the platform works",
    "12052": "I cannot understand a single thing you’re saying",
    "12057": "What the f..",
    "12059": "What's the name of this application?",
    "12083": "You can also ask it to explain your own code or to improve it.",
    "12102": "You can easy generate a 600 page science fiction novel.  Just say \"continue\", one of those insider tips. Post to Amazon, or turn into a graphic novel with the help of DALL-E.",
    "12104": "Stable Diffusion",
    "12106": "I like the idea...",
    "12120": "Impressive.\n\nWe're about to have 1000x more books in next few years.",
    "12124": "Hey everyone,\n\nI recently made a new GUI tool called \"Safe and Stable\" that allows users to easily convert their stable diffusion ckpt files to the safer and more secure safetensors format. This is especially useful when distributing new models and merges.\n\nNote: This tool still requires the ckpt data to be loaded first, so it is recommended to only use it with safe models or pickle scan or convert the models online to avoid potential security issues.\n\nMore info: [r/StableDiffusion-Safe &amp; Stable: Conversion Tool for Safer Stable Diffusion Models Distribution](https://www.reddit.com/r/StableDiffusion/comments/zcbcr8/safe_stable_conversion_tool_for_safer_stable/)\n\nI updated Safe-and-Stable-Ckpt2Safetensors-Conversion-Tool-GUI v0.1.0, with some cool new features and improvements.\n\nHere's what's new:\n\n - Support for converting between ckpt and safetensors files.\n    now you can     convert safetensors to ckpt and vice versa.\n - A file explorer to make it easier to convert files.\n - The option to add a suffix to the output file, so you can keep the  original file.\n - A hash check for files, displaying the first 8 characters of the hash.\n\nYou can find the Tool on GitHub here:\n\n\nhttps://github.com/diStyApps/Safe-and-Stable-Ckpt2Safetensors-Conversion-Tool-GUI\n\nPlease consider donating to the project if you find it useful,so that I can maintain and improve this tool and other projects.\n\n[Buy Me a Coffee](https://www.buymeacoffee.com/disty)\n\n[Patreon](https://www.patreon.com/distyx)\n\n[Twitter](https://twitter.com/The_diSty)\n\nLet me know what you think of the new features, and let me know if you have any feedback or suggestions.",
    "12163": "Look up \"dreambooth Google collab\". There's a bunch of free options for doing this but it'll take a little technical knowledge (nothing ridiculous).\n\nI'm also working on something similar of my own. It'll be released as an API for Stable Diffusion (and a bunch of other AIs), but dreambooth (training the AI on a bunch of your images) will be available (also via API) in the future.\n\nIt's more for programmers making AI apps but you can take a look at the pre-launch [discord](http:// https://discord.gg/DsJXxcMmkC) if you're interested",
    "12194": "To add to this....Is it correct that 109 times the diameter of 1cm is 109cm?\n\nNo, that is not correct. 109 times the diameter of 1 centimeter is not 109 centimeters, it is 218 centimeters. This is because the diameter of a circle is the distance from one side of the circle to the other, passing through the center of the circle. When you multiply the diameter of a circle by a number, you are essentially multiplying the distance from one side of the circle to the other by that same number, so the result is twice the diameter of the original circle. Therefore, if you multiply the diameter of a 1 centimeter circle by 109, the result would be 218 centimeters, not 109 centimeters.",
    "12214": "and they will simplify everything down til they are shouting '1' and '0' at each other  millions of times a second",
    "12233": "This is a fundamental flaw. Mathematics is the mother of logic. A system that does not fully appreciate the fundamentals of reasoning is dangerous in all areas other than dreaming and fiction. To add to this....\n\n\"No, 109 times 1 cm is not equal to 109 cm. When you multiply a number by 1, the result is equal to the original number. So, if you multiply 1 cm by 109, the result would be 1 cm * 109 = 1 cm, which is not equal to 109 cm. Instead, it is simply equal to the original value of 1 cm.\"",
    "12240": "Check out arxiv.org for academic articles",
    "12246": "\"No, 109 times 1 cm is not equal to 109 cm. When you multiply a number by 1, the result is equal to the original number. So, if you multiply 1 cm by 109, the result would be 1 cm * 109 = 1 cm, which is not equal to 109 cm. Instead, it is simply equal to the original value of 1 cm.\"\n\nThis is all fundamentally flawed!",
    "12263": "How many words were you able to get?",
    "12268": "Is the book about 18000 words?",
    "12290": "Yes you should!",
    "12298": "I see. It seems like the novel component isn’t as huge as I had assumed. So you could take an existing model, adapt it to a new task/dataset that it wasn’t initially created for. Then see if you could improve the performance at all on that new task by slightly modifying the model.",
    "12300": "yes. if you are competent enough to evaluate its output.",
    "12306": "Indeed. Probably something someone could do in their spare time. Code might even exist in some repo.",
    "12327": "What tools did you use?",
    "12344": "61 pages? Hmmm...",
    "12359": "Bruh just download stable diffusion and you can use it the same way with more customization since you can select which model to use.\n\nIf your pc is too bad. I guess you just download emulator and download Lensa",
    "12362": "The fak",
    "12377": "Oh wow has no clue",
    "12378": "Free code camp",
    "12395": "How??? I only get a max of 450 words",
    "12413": "Where is stable diffusion in \"image\"?\n\nDon't understand how they can miss such a large one.",
    "12426": "You can do something called \"dreambooth\" with stable Diffusion where you train your own model.\n\nFind a google collab and you can do it for free, but it requires a bit of technical knowledge (not too much).",
    "12428": "I guess that depends are where you are currently.",
    "12439": "You mean where it says what was used for models?",
    "12473": "Thanks! Still working on it rn, but we should have stable diffusion up in January and BLOOM after that\n\n(We host other AIs as well)",
    "12484": "I had it write a poem, it was beautiful",
    "12490": "actually, accessibility to memory (bandwith, speed) is the bottleneck at the moment",
    "12510": "I use it to write code for work\n\n(It’s really good at shortening messy code, and making it more concise)",
    "12524": "No one knows who the big winners will be in the coming decades. Best to buy a total market index fund like VTSAX. Low expenses and tax efficient.",
    "12604": "Gotta put it in English. You may be making a very good point, but no one is going to get it. Run your comment though Google translate.",
    "12611": "Thank you! Will check it out :)",
    "12615": "But the example I had, which I got without much effort, was quite decent. It doens’t have to be human-level to be very impactful.",
    "12622": "Very cool! Hope your employer don't see this xd\n\nAs a developer, this is very close to home for me. And as you have, probably, found some limits of this method. I would love to get some of your insight, if possible.\n\nDo you say something like 'shorten this code' and then just paste the code section in?\nOr have you found a more successful method?",
    "12634": "\"Why so serious?\"",
    "12659": "The truest answer",
    "12661": "Lawyers. Haha. You can only believe this if you oversimplify what a lawyer does and are wildly over optimistic about AI can accomplish in the near term.",
    "12702": "Who’s do you feel it is?",
    "12710": "Output can be very confidently detected",
    "12738": "Also look how many roles are created becuase of programmers, roles like devops, busines analyst, QA tester their demand are just growing and there is a reason for that.",
    "12741": "lol, trust me, I know *exactly* what lawyers do.\n\nIf you don't think that an AI won't be doing 80% of their jobs in a year or two you're kidding yourself. AI will do the work of 4 lawyers and one human stays behind to mind the robots.\n\nAnd 100% of their assistant's jobs btw, those jobs are all toast.\n\nLawyers had a great run, but it's about to end soon.",
    "12755": "Good answer!",
    "12764": "You used a tool for something important without realizing it’s limitations? Or worse, you knew it made up crap and you still used it? Without checking the results? Dude, that’s next level dumb and/or laziness.",
    "12767": "How could an AI even do a simple a meet and confer, say on a discovery dispute? How is an AI going to negotiate a discovery dispute compromise? How will an AI know when it has sufficient client authority to negotiate that specific discovery compromise? How will an AI know whether any particular discovery compromise could jeopardize the entire case versus piss off the judge and jeopardize the entire case via sanctions? How could an AI know whether it is gaining or losing credibility with a judge and whether that matters to the overall case strategy? If you say all this will happen via some yet to be developed AGI, sure whatever. If you say someone is going to train a model on some data set, sure whatever. We aren’t even close to getting an AI to do a simple document review, let alone a privilege review. We’re so far from one striking a Jury or making an oral argument. At best, in 10 years, 20% of what lawyers do will be done by an AI.",
    "12794": "When AI takes over the Law System, will law be more just, or will lawyers / politicians be allowed to degrade it?",
    "12808": "Explain",
    "12847": "Not sure if such an API exists. However, there is something called Descript that's been making the rounds lately, but it's still in progress.\n\nBut if you just want a basic stable diffusion art generator API, then I'm currently developing one and will be releasing soon.\n\nYou can check out the [discord](http:// https://discord.gg/DsJXxcMmkC) for more progress",
    "12865": "hey, I go to USP in Brazil. Thank you very much for the explanation, any suggestions on books or online courses?",
    "12960": "I was re-rolling responses.",
    "13004": "what is this",
    "13019": "yw",
    "13032": "Software that writes and updates itself.",
    "13045": "Have fun debating a fact. Jerkass.",
    "13079": "Timely Justice. Right now we are using AI to deal with enormous amounts of data in legal discovery for court cases reducing the effort in tackling really big cases that used to take years to get justice.",
    "13086": "What you ask?",
    "13112": "I can't find anything in the documentation, but what model/framework does this actually use? Is there a way to try different model structures?",
    "13114": "The artifact needed is in Poland. It belongs in Spain. #IXST",
    "13117": "I second this question.",
    "13125": "What are some simple examples of how this could be used?",
    "13141": "How much percent do you trust on AI?",
    "13175": "Ese libro de llevaba desde algoritmos básicos hasta los avanzados actuales",
    "13192": "Could anyone give me reasons why?",
    "13194": "Mid journey.\n\nBut I like more Stable Diffusion because I can install it in my computer and i can control it better",
    "13208": "I'll keep Stable Diffusion (SD) 1.4 model, and probly take it with me in the grave.\n\nPandoras box was opened with SD 1.4, trained on everything. They now try to close pandoras box in the following iterations by doing front lobotomy with a sledgehammer, trying to sort out unethical stuff and more, resulting in worse and worse models.\n\nThe unethical stuff and the blatant rape of artists work, should not have been in the training set from start. But you can not make it unseen (It's the internet, once there it will never go away).\n\nOnce opened, pandoras box can not be closed again.",
    "13210": "What do you do for work?",
    "13214": "I’m going into audit",
    "13216": "Audit? Your career is \"audit\" ?",
    "13225": "Why would you ever want to trust someone like him let alone the technology.",
    "13254": "as with pretty much all questions, it depends.\n\nif you just want the best looking results I would use midjourney. the released their v4 model recently and it pretty much blows everything else out of the water.\n\nthat being said, I prefer stable diffusion since I'm able to install locally and have much more control over it. it's outputs may not be as good as midjourney v4, but they're good enough for me.",
    "13256": "Matter can become sentient. We are living examples of this. There is yet a reason to believe this cannot happen again though intelligent design.",
    "13257": "Midjourney &gt; Stable Diffusion &gt; Dalle 2\n\nAs of now",
    "13260": "Why is it so fast ?",
    "13263": "It’s possible. Another question is: How can we tell the difference between sentience and the illusion of sentience?",
    "13278": "What makes a first edition book more authentic than subsequent editions?",
    "13303": "First we have to define sentience and than measure it. The biggest problem will be the measurement. We cant even know for sure whether another person is sentient, let alone animals or even machines",
    "13314": "We are the threat.",
    "13327": "Typically publishers print only a small number of books in a first run often with unique and idiosyncratic designs. So these are more sought after by collectors.",
    "13339": "So like self-driving vehicles? Wouldn't that almost eliminate drunk driving accidents?\n\nEliminating things like that is how you get rid of lawyers and judges. \n\nThe problem is lawyers and judges enjoy money much more than they dislike drunk drivers. They also run the government, and will make sure things stay the way they are, so I suspect you will find the [lawyers and judges putting AI and ML out of a job.](https://www.dailydot.com/debug/ai-art-protest-disney-characters-mickey-mouse/)\n\n\\[insert certified-human written captcha\\]",
    "13350": "There's nothing wrong with it. As long as it's not spammed by the same person, then why not?",
    "13360": "There is no way that would end well  \n\n\nLawyers are soulless enough, we don't need to have things run by machines with literally no empathy",
    "13363": "Thank you, I’ll try it!",
    "13376": "Some of you aren't understanding the OP's point. He just wants the title to state what model was made to create the output. IE I used midjourney/ stable diffusions/ GPT to create X",
    "13387": "The other way to look at it is that it takes away the toil of writing boiler plate code. There’s more room for you to focus on what makes your creation exceptional.",
    "13397": "Thing is that the first people to use this in practice for code are developers. The very same people who risk being “replaced” by it. Because of this I think adoption will be slow but we will get more efficient devs from it.\nEverybody thought that nocode will replace devs and non-techies will build their own apps and such. Turns out that for anything more complex than a web page non-techies still go to devs (or similar tech savvy people) to build their apps on nocode platforms.",
    "13410": "This. I'm simply saying that we should be open about the tools were using that are purpose built for these tasks instead of insinuating that we're speaking to some all-capable AGI. \n\nAnd if you got a unique result, share it! \"I prompted stable diffusion with x and the results were incredible\"",
    "13436": "No, jobs",
    "13450": "This honestly just feels like a feel good piece without any real analysis by the author.\n\nWhile I don't think AI will get rid of any of these jobs in the entirety, artists are already feeling the crunch. I see no reason lawyers couldn't be hit pretty hard by AI (analyzing data and doing negotiation seems like a thing computers can do well).",
    "13455": "Sounds like you know it all.",
    "13471": "C’mon, the question sounds like a logical fallacy",
    "13487": "This is completely true. I’ve seen the code that is can produce and it’s nothing special. TBH I really think I need to stop overthinking the whole situation. I’ll always enjoy sitting down with a red bull and writing some efficient code. So I’m gonna do that! Thank you for responding.",
    "13496": "Most but not all, thats why we need more regulation",
    "13499": "It will be hard for them to survive if we all do.",
    "13523": "Thanks! I'll look into both options.",
    "13527": "What even is this question.",
    "13533": "This is cute but honestly as a nurse having worked in healthcare for 4 years- I have never once had to read a doctor's handwriting for anything. We do everything on computers now.",
    "13550": "Yea, mentioned that in earlier comment. It wouldn't provide full list. And if I didn't already know bout the hammers from a manual search I would've missed a bunch.\n\n\nI'm keeping it bookmarked though for things I may have trouble finding myself.",
    "13595": "Well how about those who are fighting for their families? trying and start a business on genetic and nanotechnology? and all kinds of other things because but they have no money to access to legal system because they need these lawyers to help them navigate the system?  \n\nBecause she was why do attorneys and lawyers continue to make the same \n mistakes over and over again and yet the client have to pay? \n\nWhat about those are huge debt to the courts and if they don't pay it they go to jail. How would one fight that in court if they owe money already to the court?",
    "13604": "How can you tell?",
    "13606": "2 articles written by the account in Apr and Aug, and 13 since Dec 12",
    "13617": "I agree - will be interesting to see final result of poll.",
    "13620": "https://management-datascience.org/articles/13025/",
    "13640": "They do it for a paycheck  \n\n\nmy parents were paralegals for a NOLA law firm, so I have only witnessed sociopaths doing anything for a check when it comes to lawyers. people are just a job to them.",
    "13654": "What was your question?",
    "13698": "Stable diffusion?",
    "13716": "Is it downloadable somewhere?",
    "13787": "Must wait 24 for results 👎",
    "13813": "Joined! Love to see alternative AI art discords to midjourney.\n\nAre you guys using a stable diffusion API or your own infra?",
    "13814": "Big companies have a harder time innovating than small companies.",
    "13823": "He is promoting it the way he promotes everything.",
    "13867": "Not sure how that pertains to this.",
    "13886": "&gt; People were once scared\n\nThe fact that you were once unjustifiably scared doesn't mean you can never be justifiably scared",
    "13896": "Yeah what you said earlier sounded completely reasonable to me. I’m not sure what this person is going on about",
    "13900": "Did you make a repository on that ?\nI'm curious to know",
    "13907": "I am from eastern europe so if you are from asia then I am western to you.",
    "13935": "Desk Jobs.",
    "13954": "frrr",
    "13959": "The question is which not?😅",
    "13973": "Short term - jobs that are complex, long term - complicated.",
    "14050": "Hello there, would you be able to give any examples for restaurant kitchen ?? How it worked ??",
    "14057": "Higher memory helps in inference of large models. Higher cores or speed will speed up training. The most important feature is cudann driver support.",
    "14110": "That was part of my conclusion also",
    "14116": "I have created Inkpunk style animation using Stable Diffusion\r  \n\r  \nYou can check the full video in 4k from here: https://www.youtube.com/watch?v=R9M4cDSCMhM&amp;list=PLXyjlXMnoFF4bjHPe1CU0CUnVTTzuTFwE\r  \n\r  \n\r  \n\r  \nYou can check the model from here: https://huggingface.co/Envvi/Inkpunk-Diffusion\r  \n\r  \n\r  \n\r  \nI have created a new LinkedIn group for AI artists you can check it out from here: https://www.linkedin.com/groups/14134281/",
    "14139": "Use the new tools",
    "14155": "In the whole country? Remember, Asimov's law is not a thing",
    "14157": "So the evidence for the source of blockage not being the government is where? What drives you to say that it's not regulation?",
    "14195": "Free code camp has a section",
    "14249": "Still , name the model you're using.",
    "14259": "That is super interesting, I'll see if I can find some info on it",
    "14266": "I’m unfamiliar with Ponzu, but naming your company one letter off from “Ponzi” can’t be good for business.",
    "14323": "You're about to get a goooood ol' slap of reality my guy.\n\nNobody cares about self promotion. Here at least.",
    "14329": "Wondering what's \"going under the hood\" here. Would be excited when the SD community creates an open source version.\n\nUnless this wasn't done with stable diffusion.\n\nIn that case, RIP",
    "14336": "No, the best you can do right now is train stable diffusion models on your selected photos for it to make photos in that style. We're years away from video.",
    "14338": "Is it free?",
    "14365": "“The Jewish tradition that there are [613 commandments](https://en.m.wikipedia.org/wiki/613_commandments) (Hebrew: תרי״ג מצוות, romanized: taryag mitzvot) or mitzvot in the Torah (also known as the Law of Moses) is first recorded in the 3rd century AD, when Rabbi Simlai mentioned it in a sermon that is recorded in Talmud Makkot 23b.”\n\nIf Jesus was real, and he never sinned, he would have walked by the 613 original commandments (the law) and never violated one of them.\n\nThat’s the original law given.\n\nThe Ten Commandments is what laymen know of. But there are actually 613 of them, then Jesus added “A new command I give you: Love one another. As I have loved you, so you must love one another…” which is found in John 13:34.",
    "14409": "Judging from the outputs, it does?",
    "14433": "Alameda Research ?",
    "14434": "So your source is a bunch of alt tech blogs and a paywall?",
    "14444": "Thanks for proving my point",
    "14457": "Using the word “leftist” has caused me to call into question your sincerity.  I won’t be clicking your link, but I’d gladly read anything you wanted to include within the walls of Reddit.",
    "14460": "Did not need to read it all to see what it was about. The fact that right wing ideology has no basis in fact.",
    "14462": "My friend, I was asking for the evidence for your claim.",
    "14481": "Paywall",
    "14483": "Thank you for all the tips and help! Quite a bit but that’s exciting! I’ll have to look into the best sources for those subjects. Do you have anything top of mind that would be a solid foundational course or website to visit?",
    "14485": "I really dont, please elaborate.",
    "14488": "This is very over your head then. We are spending 100k just to build proposals for projects that will run years and cost millions. It's happening right now.",
    "14495": "You can install Stable Diffusion locally, on your own machine, for free. It will run slower with CPU only and faster with a GPU, the more VRAM the better. Either way, you can't  beat the price.",
    "14507": "I wonder if it could be because the one is binary and the other is base 10. More complexity. I suppose that in math, treating numbers like it’s treating words doesn’t work.",
    "14535": "Thank you!!! I will look into it!!",
    "14536": "Thank you!!!! I will look into that!!!",
    "14541": "“See you at da pahty Rigtah!”",
    "14546": "thought i heard emad say stable diffusion 2.1 only included artists work with permission\n\nor maybe that was supposed to be the next release",
    "14550": "get an account and pay the pennies it costs?",
    "14559": "use: [https://12ft.io/](https://12ft.io/) to pass most paywalls. Is legit, no hanky panky.",
    "14578": "What tool is this?",
    "14588": "\"A new life awaits you in the off-world colony. A chance to begin again in a new golden land of opportunity and adventure!\"",
    "14595": "Taheen",
    "14601": "Haru",
    "14603": "I find it impossible to answer this survey.\n\nYou are asking about \"trust\" towards an \"AI Robot\" to perform various tasks. \n\nBut no such AI robot exists, not even remotely. So how can one answer that?\n\nIt's like asking if I would trust a Star Trek Transporter.",
    "14617": "The survey is for a school project.",
    "14618": "Idk about you guys but it is supppper helpful for me at work. Not to mention helping explain the nuances I miss learning Spanish.",
    "14634": "You’ve got to read this study; it’s fascinating. Turns out there’s some logic to that gibberish. https://giannisdaras.github.io/publication/hidden_vocab",
    "14638": "You don’t know what you are talking about.",
    "14639": "It's hypothetical.   If an AI robot were invented that claimed to be able to do these tasks, how much would you trust it to perform them correctly or adequately?",
    "14652": "It isn't a question of if, it is a question of when.",
    "14658": "I saw tortoise in action but it seems like it takes 2 minutes to generate 1 sentence. How do you speed up the process?",
    "14672": "Well what do you know, it was😂",
    "14678": "1. Using larger training dataset\n2. Dividing the training dataset into folds and add complexity\n3. Training multiple models, combine predictions to make final prediction",
    "14691": "So doesn’t have sentience as far as we’re aware if that’s what you mean. And it may take a long time",
    "14702": "It’s okay. We have Anya Taylor-Joy.",
    "14710": "Thanks for the recommendation",
    "14725": "Ruth Wilson mixed with Bryce Dallas Howard",
    "14729": "Ah youth.",
    "14752": "You tell me, did you had a point ?",
    "14769": "Thank you I'll check them",
    "14787": "Stable diffusion?",
    "14805": "Not really the an answer to a question. Are you real?",
    "14837": "No, F off.",
    "14851": "What does this even mean",
    "14896": "Most left-wing libertarians move to right-wing libertarianism.",
    "14917": "To do this you will need to train a model on the person you want generated. Look into stable diffusion with dreambooth training. \n\nThis isn't that hard to do but its also not simple.",
    "14927": "it can literally do everything i have said im mainly just talking about the interface why is there like 1000 options on it. why cant it have just input and output",
    "14929": "This is interesting - have you got anything to support this?  I think I used to be left wing libertarian but find myself shifting more right over the years.",
    "14930": "I read it somewhere, and the same thing happened to me. However, having right-wing views on Reddit is a crime against humanity to some.",
    "14950": "I am not living in the USA btw, nor Americas either."
}